import React, { useState } from 'react'

import 'primereact/resources/themes/saga-blue/theme.css'; // เลือก theme ตามที่คุณต้องการ
import 'primereact/resources/primereact.min.css';
import 'primeicons/primeicons.css';
import { Panel } from 'primereact/panel';
import { InputText } from 'primereact/inputtext';
import { InputTextarea } from 'primereact/inputtextarea';
import 'react-datepicker/dist/react-datepicker.css';
import { ScrollPanel } from 'primereact/scrollpanel';
import axios from 'axios';
import '../css/TQF7_0.css';

function TQF7_0() {

  const [dataTqf7_0, setDateTqf7_0] = useState({
    ประจำปีการศึกษา:"2565",
    เริ่มวันที่:"1 สิงหาคม 2564",
    สิ้นสุดวันที่:"31 กรกฎาคม 2565",
    ชื่อหลักสูตรภาษาไทย:"วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร",
    ชื่อหลักสูตรภาษาอังกฤษ:"Bachelor of Engineering Program in Computer Engineering",
    ชื่อหลักสูตรย่อ:"วศ.บ.(วิศวกรรมคอมพิวเตอร์)",
    คณะ:"คณะเทคโนโลยีอุตสาหกรรม",
    มหาวิทยาลัย:"มหาวิทยาลัยราชภัฏสวนสุนันทา",
    หลักสูตรปรับปรุง:"2563",
    ปีเกณฑ์มาตรฐานหลักสูตร:"2558",
    บทสรุปผู้บริหาร:"หลักสูตรวิศวกรรมศาสตรบัณฑิต  สาขาวิชาวิศวกรรมคอมพิวเตอร์ คณะเทคโนโลยีอุตสาหกรรม มหาวิทยาลัยราชภัฏสวนสุนันทามีผลการดำเนินงานในปีการศึกษา2564ได้มาตรฐานตามมาตรฐานการศึกษาระดับอุดมศึกษาแห่งชาติและมี………. ตามเกณฑ์การประเมินคุณภาพการศึกษาระดับหลักสูตร 6 องค์ประกอบ (13 ตัวบ่งชี้) โดยมีจำนวน …1 องค์ประกอบ อยู่ในระดับดีมาก (องค์ประกอบที่ 4…) และมีจำนวน …. องค์ประกอบ อยู่ในระดับดี  (องค์ประกอบที่ …. ) มีจำนวน …. องค์ประกอบอยู่ในระดับปานกลาง (องค์ประกอบที่ …. ) และ มี …. องค์ประกอบอยู่ระดับน้อย  (องค์ประกอบที่ ….) ",
    คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ_1:"",
    คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ_2:"4.81",
    คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ_3:"",
    คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ_4:"4",
    คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ_5:"",
    คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ_6:"",
    ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ_1:"ผ่าน",
    ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ_2:"ดีมาก",
    ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ_3:"",
    ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ_4:"ดี",
    ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ_5:"",
    ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ_6:"",
    หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ_1:"",
    หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ_2:"",
    หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ_3:"",
    หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ_4:"",
    หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ_5:"",
    หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ_6:"",
    เฉลี่ยรวมทุกตัวบ่งชี้ของทุกองค์ประกอบ_คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ:"",
    เฉลี่ยรวมทุกตัวบ่งชี้ของทุกองค์ประกอบ_ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ:"",
    เฉลี่ยรวมทุกตัวบ่งชี้ของทุกองค์ประกอบ_หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ:"",
    คำนำ:"หลักสูตรวิศวกรรมศาสตรบัณฑิตสาขาวิชาวิศวกรรมคอมพิวเตอร์คณะเทคโนโลยีอุตสาหกรรมมหาวิทยาลัยราชภัฏสวนสุนันทา จัดทำรายงานผลการดำเนินงานของหลักสูตร (มคอ. 7) ที่เป็นรายงาน            การประเมินตนเอง(SelfAssessmentReport)ฉบับนี้ขึ้นมาเพื่อวิเคราะห์และประเมินผลการดำเนินงานตาม \n เกณฑ์คุณภาพการศึกษาภายใน ประจำปีการศึกษา 2564 (1 สิงหาคม 2564-31กรกฎาคม2565) \nภายใต้ระบบและกลไกการประกันคุณภาพ6องค์ประกอบ14ตัวบ่งชี้โดยการรวบรวมและสังเคราะห์ผลการดำเนินงานของหลักสูตร ประจำปีการศึกษา 2564 หวังเป็นอย่างยิ่งว่ารายงานผลการดำเนินงานของหลักสูตร (มคอ. 7) ที่เป็นรายงานการประเมินตนเอง (Self-Assessment Report) ฉบับนี้ จะสะท้อนผลการดำเนินงาน จุดเด่น จุดที่ควรพัฒนา เพื่อเป็นโอกาสให้หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ คณะเทคโนโลยีอุตสาหกรรมมหาวิทยาลัยราชภัฏสวนสุนันทานำไปพัฒนาปรับปรุงคุณภาพการจัดการศึกษาสู่ความเป็นเลิศในอนาคตรวมทั้งเป็นการให้ความเชื่อมั่นแก่ผู้รับบริการและผู้มีส่วนได้ส่วนเสียตลอดจนประชาชนทั่วไปต่อคุณภาพการจัดการศึกษาของหลักสูตรวิศวกรรมศาสตรบัณฑิตสาขาวิชาวิศวกรรมคอมพิวเตอร์คณะเทคโนโลยีอุตสาหกรรมมหาวิทยาลัยราชภัฏสวนสุนันทาท้ายนี้ขอขอบคุณผู้บริหารคณาจารย์และบุคลากรทุกฝ่ายที่ให้ความร่วมมือในการปฏิบัติงานและมีความมุ่งมั่นที่จะร่วมกันพัฒนาคุณภาพมาอย่างต่อเนื่องจนทำให้การดำเนินงานด้านการประกันคุณภาพการศึกษาภายในของหลักสูตรวิศวกรรมศาสตรบัณฑิตสาขาวิชาวิศวกรรมคอมพิวเตอร์คณะเทคโนโลยีอุตสาหกรรมมหาวิทยาลัยราชภัฏสวนสุนันทา สำเร็จไปได้ด้วยดี",
    ลงชื่อคำนำ:"อาจารย์ ผศ.ดร.รวิ  อุตตมธนินทร์ \nประธานหลักสูตรวิศวกรรมศาสตรบัณฑิต  \nสาขาวิชาวิศวกรรมคอมพิวเตอร์ \nวันที่ 31 กรกฎาคม  พ.ศ. 2564 ",
    ประวัติความเป็นมาของหลักสูตร:"พ.ศ.2563 ได้ทําการปรับปรุงหลักสูตรครั้งล่าสุด เพื่อให้สอดคล้องกับมาตราฐานและสถานการณ์ทางด้านการพัฒนาเศรษฐกิจสังคมและวัฒนธรรม มีจํานวนหน่วยกิตที่เรียนตลอดหลักสูตร 144 หน่วย โดยสภามหาวิทยาลัย มีมติอนุมัติเห็นชอบหลักสูตร ในการประชุมครั้งที่ 7/2558 เมื่อวันที่ 8 กรกฎาคม 2558",
    จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_1 : "1.เน้นการปรับความเชี่ยวชาญของคณาจารย์ให้สอดคล้องกับหลักสูตรเกณฑ์มาตรฐานปี พ.ศ. 2558 \n 2.หากอาจารย์มีวุฒิการศึกษาไม่ตรงควรเร่งสร้างงานวิจัยทางด้านวิศวกรรมคอมพิวเตอร์เพื่อใช้ในการแต่งตั้งอาจารย์ผู้รับผิดชอบหลักสูตร \n 3.หากอาจารย์ผู้รับผิดชอบหลักสูตรมีไม่ครบอาจรวมกับหลักสูตรที่มีความเกี่ยวข้องด้วย โดยแบ่งเป็นแขนงวิชา ",
    จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_2 : "บัณฑิตทำงานตรงสายและมีรายได้เฉลี่ยต่อเดือนสูงมากสามารถใช้เป็นแนวทางในการประชาสัมพันธ์หลักสูตรได้",
    จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_1 : "1.มีแนวทางในการสร้างกิจกรรมทางวิชาการในระดับสูง(การพัฒนาบทความทางวิชาการร่วมกันระหว่างอาจารย์ และนักศึกษา) \n2.ควรประเมินผลสัมฤทธิ์ของการเตรียมความพร้อมและติดตามโดยอาจขยายวิชาที่นักศึกษาอาจมีปัญหาได้เพื่อปรับปรุงและพัฒนานักศึกษาให้พร้อมในการศึกษาเพื่อให้นักศึกษาสำเร็จการศึกษาตามเกณฑ์ \n3.ควรปรับปรุงกระบวนการเสริมทักษะการเป็นอาจารย์ที่ปรึกษาเพื่อให้คำปรึกษากับนักศึกษาให้สามารถสำเร็จการศึกษาในเวลาที่เหมาะสมได้\n4.ควรตั้งเป้าหมายทักษะในศตวรรษที่21เพื่อให้การจัดกิจกรรมต่างๆเพิ่มพูนทักษะที่เป็นเป้าหมายนั้น",
    จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_2 : "",
    จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_1 : "1.คณะควรเตรียมแนวทางในการรักษาคณาจารย์ที่สำเร็จการศึกษาระดับปริญญาเอกเพื่อให้รักษาบุคลากรที่มีคุณภาพไว้\n2.ควรมีการวางแผนในการบริหารอาจารย์ในด้านของการบริหารภาระงานในการสนับสนุนการศึกษาต่อ และการพัฒนาตำแหน่งทางวิชาการโดยที่คุณภาพชีวิตและคุณภาพการเรียนการสอนสมดุลกัน\n3.คณะควรแบ่งอำนาจในการบริหารจัดการภาระงานเพื่อให้ คณะกรรมการบริหารหลักสูตรสามารถบริหารอาจารย์เพื่อส่งเสริมอาจารย์ได้",
    จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_2 : "1. คณาจารย์มีความกระตือรือร้นในการพัฒนาตนเองทั้งทางด้านคุณวุฒิ และตำแหน่งทางวิชาการสูง\n2.กำหนดแนวทางในอนาคตถึงทิศทางของการพัฒนาหลักสูตร เพื่อจัดการอบรมของอาจารย์ให้สอดคล้องกับความต้องการของตลาดแรงงานมากขึ้น",
    จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_1 : "",
    จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_2 : "1.ควรมีพัฒนาทำเนียบว่าผู้สอนว่าผู้สอนสามารถสอนรายวิชาใดได้บ้าง โดยพิจารณาจากวุฒิการศึกษา ประสบการณ์งานวิจัยการฝึกอบรม ฯลฯเพื่อความสะดวกในการจัดผู้สอน\n2.ในการบูรณาการการเรียนการสอนร่วมกับการวิจัย บริการวิชาการ หรือการส่งเสริมศิลปวัฒนธรรม ต้องดำเนินการวางแผนตั้งแต่ก่อนเริ่มภาคการศึกษาใน มคอ. 3",
    จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_3 : "1.ควรทวนสอบวิชาที่มีความผิดปกติของผลการเรียนมากและควรมีแนวทางในการแก้ไขปัญหาที่เป็นรูปธรรมต่อไป",
    จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_4 : "",
    จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_6 : "1.คณาจารย์มีความเข้าใจในความต้องการของนักศึกษา และมีความพยายามร้องขออุปกรณ์สนับสนุนที่สอดคล้องกับนักศึกษา\n2. ควรประเมินปริมาณของสิ่งสนับสนุนการเรียนรู้ทีทางหลักสูตรมี และสิ่งสนับสนุนการเรียนรู้ที่เพียงพอต่อความต้องการของนักศึกษา เพื่อใช้เป็นแนวทางในการพัฒนาศักยภาพของนักศึกษาให้ตรงตามความมุ่งหมายของหลักสูตร \n3. เนื่องจากนักศึกษามีผลการเรียนวิชาโครงงานที่ไม่ผ่านจำนวนมาก ทั้งนี้อาจจะเนื่องมาจากนักศึกษาไม่มีพื้นที่ทำงานร่วมกันนอกเวลาราชการ ดังนั้นคณะควรเตรียมห้องเรียนให้นักศึกษาสามารถทำงานร่วมกัน",
    องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_1 : "1.1การบริหารจัดการหลักสูตรตามเกณฑ์มาตรฐานหลักสูตรที่กำหนดโดย สกอ.",
    องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_2 : "2.1คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ",
    องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_1 : "3.1 การรับนักศึกษา ",
    องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_2 : "3.2 การส่งเสริมและพัฒนานักศึกษา ",
    องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_1 : "4.1 การบริหารและพัฒนาอาจารย์",
    องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_2 : "4.2 คุณภาพอาจารย์",
    องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_1 : "5.1 สาระของรายวิชาในหลักสูตร",
    องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_2 : "5.2การวางระบบผู้สอนและกระบวนการจัดการเรียนการสอน",
    องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_3 : "5.3 การประเมินผู้เรียน",
    องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_4 : "5.4 ผลการดำเนินงานหลักสูตรตามกรอบมาตรฐานคุณวุฒิ ระดับอุดมศึกษาแห่งชาติ",
    องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_6 : "6.1 สิ่งสนับสนุนการเรียนรู้",
    การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_1 : "1.ได้ส่งเสริมและสนับสนุนการปรับความเชี่ยวชาญของคณาจารย์ให้สอดคล้องกับหลักสูตรเกณฑ์มาตรฐานปีพ.ศ.2558ด้วยการเข้าอบรมสัมมนาฯ ต่างๆที่เกี่ยวข้องกับทางด้านวิศวกรรมคอมพิวเตอร์\n 2.ส่งเสริมและสนับสนุนให้อาจารย์สร้างงานวิจัยทางด้านวิศวกรรมคอมพิวเตอร์\n 3.ดำเนินการตรวจสอบจำนวนอาจารย์ผู้รับผิดชอบหลักสูตร",
    การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_2 : "ได้ใช้แนวทางการประชาสัมพันธ์หลักสูตรจากบัณฑิตทำงานตรงสายและมีรายได้เฉลี่ยต่อเดือนสูงมาก",    
    การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_1 : "ประชุมสาขาวิชาฯ วางแผนการรับนักศึกษา",
    การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_2 : "1.ดำเนินกิจกรรมทางวิชาการในระดับสูงด้วยการพัฒนาบทความทางวิชาการร่วมกันระหว่างอาจารย์และนักศึกษา\n2.มีการทวนสอบรายต่างๆ รวมทั้งวิชาที่นักศึกษาอาจมีปัญหาได้เพื่อปรับปรุงและพัฒนานักศึกษาให้พร้อมในการศึกษาเพื่อให้นักศึกษาสำเร็จการศึกษาตามเกณฑ์\n3.สาขาวิชามีการประชุม อาจารย์ในสาขาให้มีกระบวนการให้คำปรึกษากับนักศึกษาให้สามารถสำเร็จการศึกษาในเวลาที่เหมาะสมได้\n4.สาขาวิชาดำเนินกิจกรรมทางวิชาการในระดับสูง ด้วยการจดอนุสิทธิบัตรร่วมกันระหว่างอาจารย์และนักศึกษา",
    การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_1 : "1.คณะมีนโยบาย เปิดสาขาใหม่ และได้ให้ อาจารย์ในสาขาเปิดสาขาใหม่ ดังนั้น อาจารย์จึงต้องออกจากสาขาไปเปิดสาขาใหม่ ทางสาขาวิชาจึงต้องหาอาจารย์มาทดแทนในส่วนของอาจารย์ที่ขาดหายไปด้วย\n2.สาขาวิชาการประชุมวางแผนในการบริหารอาจารย์ เพื่อช่วยเหลือและแบ่งเบาภาระงานของอาจารย์ที่มีการศึกษาต่อและมีการพัฒนาตำแหน่งทางวิชาการ",
    การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_2 : "1.ปี 2564 อาจารย์ในสาขาวิชาฯมีการพัฒนาตนเองทั้งทางด้านคุณวุฒิด้วยการศึกษาต่อระดับปริญญาเอก จำนวน 1 คน \n2.สาขาคณะและสาขามีการประชุม พัฒนาหลักสูตรหุ่นยนต์ ที่สอดคล้องกับความต้องการของตลาดแรงงานมากขึ้น",
    การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_1 : "ปรับปรุงการเรียนการสอนให้สอดคล้องกับสถานการในรูปแบบ online",
    การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_2 : "1.สาขาวิชามีการประชุมเพื่อสอบถามอาจารย์ในสาขาวิชาในเรื่องความสามารถในการสอนรายวิชาต่างๆ เพิ่มเติมจากการพิจารณาจากวุฒิการศึกษาประสบการณ์ งานวิจัย การฝึกอบรม ฯลฯ เพื่อความ สะดวกในการจัดผู้สอน\n2. มีการวางแผนการบูรณาการการเรียนการสอนร่วมกับการวิจัย บริการวิชาการ หรือ การส่งเสริมศิลปวัฒนธรรม ตั้งแต่ก่อนเริ่มภาคการศึกษาในมคอ. 3",
    การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_3 : "มีการทวนสอบวิชาต่างๆ ด้วยการสุ่ม 25% ของรายวิชาทั้งหมด เพราะไม่ได้มีวิชาที่มีความผิดปกติของผลการเรียน",
    การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_4 : "มีการดำเนินงานตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษา โดยมีการประชุมอาจารย์ประจำหลักสูตร เพื่อทบทวนแผน และมีรายละเอียดหลักสูตรตามมาตรฐานคุณวุฒิแห่งชาติ หรือสาขาวิชา",
    การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_6 : "1. มีการประชุมวางแผนและจัดทำแบบสำรวจความต้องการเรียนรู้ในส่วนของนักศึกษาและอาจารย์เพื่อทำแผนงบประมาณในการบำรุงรักษาหรือจัดซื้อใหม่\n2. มีการประเมินปริมาณของสิ่งสนับสนุนการเรียนรู้ที่ทางหลักสูตรมี และสิ่งสนับสนุนการเรียนรู้ที่เพียงพอต่อความต้องการของนักศึกษา\n3.มีการจัดการติดตามงานในวิชาโครงงานผ่านด้วยการประชุมเป็นระยะตามกำหนดเวลาโดยอาจารย์ประจำวิชาโครงงาน ",
    ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_1 : "1.คณาจารย์เข้าอบรมสัมมนาฯต่างๆที่เกี่ยวข้องกับทางด้านวิศวกรรมคอมพิวเตอร์\n2.ส่งเสริมและสนับสนุนให้อาจารย์สร้างงานวิจัยทางด้านวิศวกรรมคอมพิวเตอร์ \n 3.มีอาจารย์ผู้รับผิดชอบหลักสูตรครบถ้วน",
    ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_2 : "มีนักศึกษาที่ลงทะเบียนในปี 2564 มีทั้งหมด จำนวน 40 คน",
    ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_1 : "มีนักศึกษาลงทะเบียนในปี 2564/1 จำนวน 40 คนและมีจำนวนนักศึกษาลงทะเบียนภาคเรียน 2/2564 31 คน",
    ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_2 : "1.อาจารย์และนักศึกษามีบทความวิชาการร่วมกัน จำนวน 6 (ระดับนานาชาติ จำนวน 2 บทความ ระดับชาติ จำนวน 4 บทความ)\n2.มีการทวนสอบรายต่างๆรวมทั้งวิชาที่นักศึกษาอาจมีปัญหาได้เพื่อปรับปรุงและพัฒนานักศึกษาให้พร้อมในการศึกษาเพื่อให้นักศึกษาสำเร็จการศึกษาตามเกณฑ์\n 3.หัวหน้าสาขาและอาจารย์ที่ปรึกษามีการแนะแนวนักศึกษาในแต่ละชั้นปีในเรื่องการใช้ชีวิตในการเรียนและแนวทางในการเรียนภายในมหาวิทยาลัย\n 4.สาขาวิชาดำเนินกิจกรรมทางวิชาการในระดับสูงด้วยการจดอนุสิทธิบัตรร่วมกันระหว่างอาจารย์และนักศึกษา",
    ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_1 : "1.มีอาจารย์ออกจากสาขา 2 ท่าน –ลาออก 1 ท่าน และ ย้ายสาขา 1 ท่านได้หาอาจารย์ ที่มีคุณสมบัติครบถ้วนย้ายมาจากสาขาอื่นมาทดแทน และดำเนินการหาอาจารย์ประจำจากภายนอกมาหาวิทยาลัยมาเพิ่มเติม\n 2.อาจารย์ที่ศึกษาต่อและมีการพัฒนาตำแหน่งทางวิชาการจะมีอาจารย์ภายในสาขาช่วยแบ่งเบาภาระงานในการจัดโครงงาน การวิจัย รวมทั้งบริการวิชาการ",
    ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_2 : "1.	ปี 2564 อาจารย์ในสาขาวิชาฯ มีอาจารย์ได้รับตำแหน่งทางวิชาการ ผศ.จำนวน 1 คน และอยู่ในระหว่างขอตำแหน่งทางวิชาการ จำนวน 1 คน\n2.รับ อ เข้าใหม่ ได้ รศ 1 คน\n3.มีอาจารย์ออกจากสาขาวิชา เพื่อไปอยู่หลักสูตรสาขาด้านหุ่นยนต์ปัญญาประดิษฐ์ จำนวน 1 คน",
    ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_1 : "ปรับปรุงการสอนให้สอดคล้องกับการเรียนการสอนในรูปแบบ online",
    ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_2 : "1.อาจารย์ในสาขาวิชาจำนวน 5 คน ได้จัดทำรายวิชาที่ อ แต่ละท่านถนัดไว้เป็นแนวทางในการจัดการเรียนการสอน\n2. มคอ. 3 มีการวางแผนการบูรณาการการเรียนการสอนร่วมกับการวิจัย บริการวิชาการหรือการส่งเสริมศิลปวัฒนธรรม",
    ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_3 : "ผลการทวนสอบปกติดี",
    ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_4 : "มีการประชุมอาจารย์ประจำหลักสูตรอย่างน้อยร้อยละ 80 เพื่อทบทวนแผน และมีรายละเอียดหลักสูตรตามมาตรฐานคุณวุฒิแห่งชาติ หรือสาขาวิชา",
    ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_6 : "1. มีแผนงบประมาณในการบำรุงรักษาหรือจัดซื้อครุภัณฑ์ปีงบประมาณ 64และ จะเป็นอุปกรณ์สำหรับจัดการเรียนแบบonline และ อุปกรณ์สำหรับ นศ ทำโครงงานด้านฮาร์ดแวร์\n 2. มีการประเมินปริมาณของสิ่งสนับสนุนการเรียนรู้ที่ทางหลักสูตร \n 3.มีนศ.ที่ตกค้างในรุ่นที่แล้วๆมา สามารถทำโครงงานจบและสำเร็จการศึกษาไปได้หลายกลุ่มส่วนด้านพื้นที่ทำงานจะปิด ตามสถานนการโรคระบาด ด้าน นศ. ต้องทำงานที่บ้านและส่งงานติดตามงานทาง online ",
  });

  // (generateDocument) แก้ไข docx
  const PizZip = require('pizzip');
  const Docxtemplater = require('docxtemplater');
  
  const handleGenerateDocx = async (e) => {
    e.preventDefault();
    try {
      // เรียก API เพื่อดึงข้อมูลเทมเพลต DOCX
      const response = await axios.get('https://project-in-back.vercel.app/api/gettqf7', {
        params: { id: '1' },
        responseType: 'arraybuffer',
      });
      const userFormData = dataTqf7_0;  // ใช้ dataTqf7_0 ที่ได้จาก state แทน doc.getData()
  
      const zip = new PizZip(response.data);
      doc = new Docxtemplater();
      doc.loadZip(zip);
      doc.setOptions({ linebreaks: true });
  
      doc.setData(userFormData);
  
      doc.render();
  
      const content = doc.getZip().generate({ type: 'blob' });
      const url = URL.createObjectURL(content);
      const link = document.createElement('a');
      link.href = url;
      link.download = `คำนำ มคอ.7.docx`;
      link.click();
    } catch (error) {
      console.error('Error generating document:', error);
    }
  };
  let doc;
  const handleChange = (event, property) => {
    setDateTqf7_0((prevData) => ({
      ...prevData,
      [property]: event.target.value,
    }));
  
    if (doc) {
      doc.setData(dataTqf7_0);
    }
  };

  return (
    <form onSubmit={handleGenerateDocx}  >
    <div  style={{ width: '100%',marginLeft: '10px', margin:'10px' }}>
    <button className='mybutton' type="button" onClick={handleGenerateDocx}>Docx</button>
    <ScrollPanel style={{ width: "100%", height: "100vh", overflowY:'auto' }}>
    <Panel className='mypanel' toggleable style={{ fontFamily: 'Kanit, sans-serif' }} header="สร้างผลการดำเนินงาน">
  {/***********************************************/}
  <div>
    <span style={{ width: '10%',  }}>เริ่มวันที่</span>
    <InputText
      value={dataTqf7_0.เริ่มวันที่}
      onChange={(e) => handleChange(e, 'เริ่มวันที่')}
      style={{}}
    /><br/><br/>
    <span>ถึงวันที่</span>
    <InputText
      value={dataTqf7_0.สิ้นสุดวันที่}
      onChange={(e) => handleChange(e, 'สิ้นสุดวันที่')}
      style={{}}
    />
  </div>
  <br />
  {/***********************************************/}
  <div>
    <span style={{}}>ประจำปีการศึกษา</span>
    <InputText
      value={dataTqf7_0.ประจำปีการศึกษา}
      onChange={(e) => handleChange(e, 'ประจำปีการศึกษา')}
      style={{}}
    />
  </div>
  {/***********************************************/}
</Panel><br/><br/>
      <Panel className='mypanel' toggleable  style={{ fontFamily: 'Kanit, sans-serif' }} header="เลือกหลักสูตร">
        {/***********************************************/}
        <div style={{ marginBottom: '20px' }}>
          <label>ชื่อหลักสูตร(ภาษาไทย)</label>
          <InputText
          value={dataTqf7_0.ชื่อหลักสูตรภาษาไทย} 
          onChange={(e) => handleChange(e, 'ชื่อหลักสูตรภาษาไทย')} 
          style={{ marginLeft: '10px',marginRight: '10px', padding: '5px', borderRadius: '3px', border: '1px solid #ccc',fontFamily: 'Kanit, sans-serif' }}
          />
          
          <label>หลักสูตรปรับปรุงปี</label>
          <InputText
          value={dataTqf7_0.หลักสูตรปรับปรุง} 
          onChange={(e) => handleChange(e, 'หลักสูตรปรับปรุง')} 
          style={{ marginLeft: '10px',marginRight: '10px', padding: '5px', borderRadius: '3px', border: '1px solid #ccc',fontFamily: 'Kanit, sans-serif'}}
          />
        </div>
        {/***********************************************/}
        <div style={{ marginBottom: '20px' }}>
          <label>ชื่อหลักสูตร(ภาษาอังกฤษ)</label>
          <InputText 
          value={dataTqf7_0.ชื่อหลักสูตรภาษาอังกฤษ}
          onChange={(e)=> handleChange(e, 'ชื่อหลักสูตรภาษาอังกฤษ')}
          style={{ marginLeft: '10px',marginRight: '10px', padding: '5px', borderRadius: '3px', border: '1px solid #ccc',fontFamily: 'Kanit, sans-serif' }}
          />
          <label>ชื่อย่อ</label>
          <InputText
           value={dataTqf7_0.ชื่อหลักสูตรย่อ}
           onChange={(e)=> handleChange(e, 'ชื่อหลักสูตรย่อ')}
           style={{ marginLeft: '10px',marginRight: '10px', padding: '5px', borderRadius: '3px', border: '1px solid #ccc',fontFamily: 'Kanit, sans-serif' }}
          />
        </div>
        {/***********************************************/}
        <div style={{ marginBottom: '20px' }}>
          <label>คณะ</label>
          <InputText 
          value={dataTqf7_0.คณะ}
          onChange={(e)=> handleChange(e, 'คณะ')}
          style={{ marginLeft: '10px',marginRight: '10px', padding: '5px', borderRadius: '3px', border: '1px solid #ccc',fontFamily: 'Kanit, sans-serif' }}
          />
          <label>มหาวิทยาลัย</label>
          <InputText 
          value={dataTqf7_0.มหาวิทยาลัย}
          onChange={(e)=> handleChange(e, 'มหาวิทยาลัย')}
          style={{ marginLeft: '10px',marginRight: '10px', padding: '5px', borderRadius: '3px', border: '1px solid #ccc',fontFamily: 'Kanit, sans-serif' }}
          />
        </div>
        {/***********************************************/}
        <div style={{ marginBottom: '20px' }}>
          <label>ปีเกณฑ์มาตรฐานหลักสูตร</label>
          <InputText
          value={dataTqf7_0.ปีเกณฑ์มาตรฐานหลักสูตร}
          onChange={(e)=> handleChange(e, 'ปีเกณฑ์มาตรฐานหลักสูตร')}
          style={{ marginLeft: '10px',marginRight: '10px', padding: '5px', borderRadius: '3px', border: '1px solid #ccc',fontFamily: 'Kanit, sans-serif' }}
          />
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel className='mypanel' toggleable  style={{ fontFamily: 'Kanit, sans-serif' }} header="บทสรุปผู้บริหาร">
        {/***********************************************/}
        <div style={{ display: 'flex', alignItems: 'flex-start'}}>
            <InputTextarea 
            autoResize 
            rows={4} 
            cols={80}  
            value={dataTqf7_0.บทสรุปผู้บริหาร}
            onChange={(e)=> handleChange(e, 'บทสรุปผู้บริหาร')}
            style={{ fontFamily: 'Kanit, sans-serif' }}
            />
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel className='mypanel' toggleable  style={{ fontFamily: 'Kanit, sans-serif' }} header="สรุปผลการประเมินตนเองตามองค์ประกอบ">
        {/***********************************************/}
        <div>
          <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>องค์ประกอบ</th>
                <th className='TH'>คะแนนการประเมินเฉลี่ย</th>
                <th className='TH'>ระดับคุณภาพ</th>
                <th className='TH'>หมายเหตุ</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'>องค์ประกอบที่ 1</td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ_1} onChange={(e) => handleChange(e, 'คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ_1')}></InputText></td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ_1} onChange={(e) => handleChange(e, 'ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ_1')}></InputText></td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ_1} onChange={(e) => handleChange(e, 'หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ_1')}></InputText></td>
              </tr>
              <tr>
                <td className='TD'>องค์ประกอบที่ 2</td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ_2} onChange={(e) => handleChange(e, 'คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ_2')}></InputText></td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ_2} onChange={(e) => handleChange(e, 'ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ_2')}></InputText></td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ_2} onChange={(e) => handleChange(e, 'หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ_2')}></InputText></td>
              </tr>
              <tr>
                <td className='TD'>องค์ประกอบที่ 3</td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ_3} onChange={(e) => handleChange(e, 'คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ_3')}></InputText></td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ_3} onChange={(e) => handleChange(e, 'ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ_3')}></InputText></td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ_3} onChange={(e) => handleChange(e, 'หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ_3')}></InputText></td>
              </tr>
              <tr>
                <td className='TD'>องค์ประกอบที่ 4</td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ_4} onChange={(e) => handleChange(e, 'คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ_4')}></InputText></td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ_4} onChange={(e) => handleChange(e, 'ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ_4')}></InputText></td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ_4} onChange={(e) => handleChange(e, 'หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ_4')}></InputText></td>
              </tr>
              <tr>
                <td className='TD'>องค์ประกอบที่ 5</td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ_5} onChange={(e) => handleChange(e, 'คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ_5')}></InputText></td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ_5} onChange={(e) => handleChange(e, 'ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ_5')}></InputText></td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ_5} onChange={(e) => handleChange(e, 'หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ_5')}></InputText></td>
              </tr>
              <tr>
                <td className='TD'>องค์ประกอบที่ 6</td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ_6} onChange={(e) => handleChange(e, 'คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ_6')}></InputText></td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ_6} onChange={(e) => handleChange(e, 'ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ_6')}></InputText></td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ_6} onChange={(e) => handleChange(e, 'หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ_6')}></InputText></td>
              </tr>
              <tr>
                <td className='TD'>เฉลี่ยรวมทุกตัวบ่งชี้ของทุกองค์ประกอบ</td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.เฉลี่ยรวมทุกตัวบ่งชี้ของทุกองค์ประกอบ_คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ} onChange={(e) => handleChange(e, 'เฉลี่ยรวมทุกตัวบ่งชี้ของทุกองค์ประกอบ_คะแนนการประเมินเฉลี่ย_สรุปผลการประเมินตนเองตามองค์ประกอบ')}></InputText></td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.เฉลี่ยรวมทุกตัวบ่งชี้ของทุกองค์ประกอบ_ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ} onChange={(e) => handleChange(e, 'เฉลี่ยรวมทุกตัวบ่งชี้ของทุกองค์ประกอบ_ระดับคุณภาพ_สรุปผลการประเมินตนเองตามองค์ประกอบ')}></InputText></td>
                <td className='TD'><InputText autoResize style={{width:'100%',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.เฉลี่ยรวมทุกตัวบ่งชี้ของทุกองค์ประกอบ_หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ} onChange={(e) => handleChange(e, 'เฉลี่ยรวมทุกตัวบ่งชี้ของทุกองค์ประกอบ_หมายเหตุ_สรุปผลการประเมินตนเองตามองค์ประกอบ')}></InputText></td>
              </tr>
            </tbody>
          </table>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel className='mypanel' toggleable  style={{ fontFamily: 'Kanit, sans-serif' }} header="คำนำ">
        {/***********************************************/}
        <div style={{ display: 'flex', alignItems: 'flex-start',marginBottom: '20px' ,fontFamily: 'Kanit, sans-serif'}}>
        <label>คำนำ</label>
        <InputTextarea 
        autoResize 
        rows={4} 
        cols={80}  
        value={dataTqf7_0.คำนำ} 
        onChange={(e)=> handleChange(e, 'คำนำ')}
        style={{ marginLeft: '10px',marginRight: '10px', padding: '5px', borderRadius: '3px', border: '1px solid #ccc' ,fontFamily: 'Kanit, sans-serif'}}
        />
        </div>
        <div style={{ display: 'flex', alignItems: 'flex-start',marginBottom: '20px' }}>
        <label>ลงชื่อ</label>
        <InputTextarea 
        autoResize 
        rows={4} 
        cols={80}  
        value={dataTqf7_0.ลงชื่อคำนำ}
        onChange={(e)=> handleChange(e, 'ลงชื่อคำนำ')}
        style={{ marginLeft: '10px',marginRight: '10px', padding: '5px', borderRadius: '3px', border: '1px solid #ccc' ,fontFamily: 'Kanit, sans-serif'}}
        />
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel className='mypanel' toggleable  style={{ fontFamily: 'Kanit, sans-serif' }} header="ประวัติความเป็นมาของหลักสูตร">
        {/***********************************************/}
        <div style={{ display: 'flex', alignItems: 'flex-start' }}>
          <InputTextarea 
          autoResize 
          rows={4} 
          cols={80}  
          value={dataTqf7_0.ประวัติความเป็นมาของหลักสูตร}
          onChange={(e)=> handleChange(e, 'ประวัติความเป็นมาของหลักสูตร')}
          style={{ fontFamily: 'Kanit, sans-serif' }}
        />
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel className='mypanel' toggleable  style={{ fontFamily: 'Kanit, sans-serif' }} header="ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา">
        {/***********************************************/}
        <div>
          <table className='TA'>
            <thead>
              <tr>
                <th className='TH' style={{width:'20vw',height:'5vh',fontFamily: 'Kanit, sans-serif'}} >จุดแข็ง แนวทางเสริมจุดแข็ง จุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ ปีการศึกษา 2564</th>
                <th className='TH' style={{width:'15vw',height:'5vh',fontFamily: 'Kanit, sans-serif'}} >องค์ประกอบ/ตัวบ่งชี้/เกณฑ์การประเมิน</th>
                <th className='TH' style={{width:'23vw',height:'5vh',fontFamily: 'Kanit, sans-serif'}} >การดำเนินการ/กิจกรรม/โครงการ</th>
                <th className='TH' style={{width:'20vw',height:'5vh',fontFamily: 'Kanit, sans-serif'}} >ผลการดำเนินงาน</th>
              </tr>
            </thead>
            <tbody>
            องค์ประกอบที่ 1 การกำกับมาตรฐาน
              <tr>
                <td className='TD'><InputTextarea  style={{width:'20vw',height:'20vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_1} onChange={(e) => handleChange(e, 'จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_1')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'15vw',height:'20vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_1} onChange={(e) => handleChange(e, 'องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_1')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'23vw',height:'20vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_1} onChange={(e) => handleChange(e, 'การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_1')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'20vw',height:'20vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_1} onChange={(e) => handleChange(e, 'ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_1')}></InputTextarea></td>
              </tr>
            องค์ประกอบที่ 2  บัณฑิต
              <tr>
                <td className='TD'><InputTextarea style={{width:'20vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_2} onChange={(e) => handleChange(e, 'จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_2')}></InputTextarea></td>
                <td className='TD'><InputTextarea style={{width:'15vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_2} onChange={(e) => handleChange(e, 'องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_2')}></InputTextarea></td>
                <td className='TD'><InputTextarea style={{width:'23vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_2} onChange={(e) => handleChange(e, 'การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_2')}></InputTextarea></td>
                <td className='TD'><InputTextarea style={{width:'20vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_2} onChange={(e) => handleChange(e, 'ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_2')}></InputTextarea></td>
              </tr>
            องค์ประกอบที่ 3 นักศึกษา
              <tr>
                <td className='TD'><InputTextarea style={{width:'20vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_1} onChange={(e) => handleChange(e, 'จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_1')}></InputTextarea></td>
                <td className='TD'><InputTextarea style={{width:'15vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_1} onChange={(e) => handleChange(e, 'องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_1')}></InputTextarea></td>
                <td className='TD'><InputTextarea style={{width:'23vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_1} onChange={(e) => handleChange(e, 'การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_1')}></InputTextarea></td>
                <td className='TD'><InputTextarea style={{width:'20vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_1} onChange={(e) => handleChange(e, 'ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_1')}></InputTextarea></td>
              </tr>
              <tr>
                <td className='TD'><InputTextarea  style={{width:'20vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_2} onChange={(e) => handleChange(e, 'จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_2')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'15vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_2} onChange={(e) => handleChange(e, 'องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_2')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'23vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_2} onChange={(e) => handleChange(e, 'การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_2')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'20vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_2} onChange={(e) => handleChange(e, 'ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_3_2')}></InputTextarea></td>
              </tr>
            องค์ประกอบที่ 4 อาจารย์
              <tr>
                <td className='TD'><InputTextarea  style={{width:'20vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_1} onChange={(e) => handleChange(e, 'จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_1')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'15vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_1} onChange={(e) => handleChange(e, 'องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_1')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'23vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_1} onChange={(e) => handleChange(e, 'การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_1')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'20vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_1} onChange={(e) => handleChange(e, 'ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_1')}></InputTextarea></td>
              </tr>
              <tr>
                <td className='TD'><InputTextarea  style={{width:'20vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_2} onChange={(e) => handleChange(e, 'จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_2')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'15vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_2} onChange={(e) => handleChange(e, 'องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_2')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'23vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_2} onChange={(e) => handleChange(e, 'การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_2')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'20vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_2} onChange={(e) => handleChange(e, 'ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_4_2')}></InputTextarea></td>
              </tr>
            องค์ประกอบที่ 5 หลักสูตร การเรียนการสอน  การประเมินผู้เรียน
              <tr>
                <td className='TD'><InputTextarea  style={{width:'20vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_1} onChange={(e) => handleChange(e, 'จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_1')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'15vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_1} onChange={(e) => handleChange(e, 'องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_1')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'23vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_1} onChange={(e) => handleChange(e, 'การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_1')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'20vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_1} onChange={(e) => handleChange(e, 'ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_1')}></InputTextarea></td>
              </tr>
              <tr>
                <td className='TD'><InputTextarea  style={{width:'20vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_2} onChange={(e) => handleChange(e, 'จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_2')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'15vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_2} onChange={(e) => handleChange(e, 'องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_2')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'23vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_2} onChange={(e) => handleChange(e, 'การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_2')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'20vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_2} onChange={(e) => handleChange(e, 'ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_2')}></InputTextarea></td>
              </tr>
              <tr>
                <td className='TD'><InputTextarea  style={{width:'20vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_3} onChange={(e) => handleChange(e, 'จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_3')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'15vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_3} onChange={(e) => handleChange(e, 'องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_3')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'23vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_3} onChange={(e) => handleChange(e, 'การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_3')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'20vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_3} onChange={(e) => handleChange(e, 'ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_3')}></InputTextarea></td>
              </tr> 
              <tr>
                <td className='TD'><InputTextarea  style={{width:'20vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_4} onChange={(e) => handleChange(e, 'จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_4')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'15vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_4} onChange={(e) => handleChange(e, 'องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_4')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'23vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_4} onChange={(e) => handleChange(e, 'การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_4')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'20vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_4} onChange={(e) => handleChange(e, 'ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_5_4')}></InputTextarea></td>
              </tr>
            6. สิ่งสนับสนุนการเรียนรู้
              <tr>
                <td className='TD'><InputTextarea  style={{width:'20vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_6} onChange={(e) => handleChange(e, 'จุดแข็งแนวทางเสริมจุดแข็งจุดที่ควรพัฒนาและข้อเสนอแนะของคณะกรรมการประเมินฯ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_6')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'15vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_6} onChange={(e) => handleChange(e, 'องค์ประกอบตัวบ่งชี้เกณฑ์การประเมิน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_6')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'23vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_6} onChange={(e) => handleChange(e, 'การดำเนินการกิจกรรมโครงการ_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_6')}></InputTextarea></td>
                <td className='TD'><InputTextarea  style={{width:'20vw',height:'30vh',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_0.ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_6} onChange={(e) => handleChange(e, 'ผลการดำเนินงาน_การกำกับมาตรฐาน_ผลการปรับปรุงตามข้อเสนอแนะของผลการประเมินปีที่ผ่านมา_6')}></InputTextarea></td>
              </tr>
            </tbody>
          </table>
        </div>
        {/***********************************************/}
      </Panel>
      </ScrollPanel>
    </div>
    </form>
  )
}

export default TQF7_0