import React, { useState } from 'react'
import { ScrollPanel } from 'primereact/scrollpanel';
import { Panel } from 'primereact/panel'
import { InputTextarea } from 'primereact/inputtextarea'

function TQF7_3() {

  const [dataTqf7_3, setDateTqf7_3] = useState({

    การรับนักศึกษา : "",

  });

  return (
    <div style={{ width: '100%',marginLeft: '10px'}}>
      <ScrollPanel style={{ width: '100%', height: '875px' }}>
      <Panel header="ข้อมูลนนักศึกษา">
        {/***********************************************/}
        <div>
          <span>ตารางข้อมูลนนักศึกษา</span>
          <table className='TA'>
            <thead>
              <tr>
                <th className='TH' rowspan="2">ปีการศึกษาที่รับเข้า(ตั้งแต่ปีการศึกษาที่เริ่มใช้หลักสูตร)</th>
                <th className='TH' colspan="6">จำนวนนักศึกษาคงอยู่ (จำนวนจริง)ในแต่ละปีการศึกษา</th>
              </tr>
              <tr>
                <th className='TH'>2559</th>
                <th className='TH'>2560</th>
                <th className='TH'>2561</th>
                <th className='TH'>2562</th>
                <th className='TH'>2563</th>
                <th className='TH'>2564</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'>2559</td>
                <td className='TD'>62</td>
                <td className='TD'>40</td>
                <td className='TD'>36</td>
                <td className='TD'>37</td>
                <td className='TD'>26</td>
                <td className='TD'>12</td>
              </tr>
              <tr>
                <td className='TD'>2560</td>
                <td className='TD'></td>
                <td className='TD'>40</td>
                <td className='TD'>37</td>
                <td className='TD'>31</td>
                <td className='TD'>31</td>
                <td className='TD'>18</td>
              </tr>
              <tr>
                <td className='TD'>2561</td>
                <td className='TD'></td>
                <td className='TD'></td>
                <td className='TD'>40</td>
                <td className='TD'>37</td>
                <td className='TD'>36</td>
                <td className='TD'>35</td>
              </tr>
              <tr>
                <td className='TD'>2562</td>
                <td className='TD'></td>
                <td className='TD'></td>
                <td className='TD'></td>
                <td className='TD'>27</td>
                <td className='TD'>25</td>
                <td className='TD'>24</td>
              </tr>
              <tr>
                <td className='TD'>2563</td>
                <td className='TD'></td>
                <td className='TD'></td>
                <td className='TD'></td>
                <td className='TD'></td>
                <td className='TD'>39</td>
                <td className='TD'>33</td>
              </tr>
              <tr>
                <td className='TD'>2564</td>
                <td className='TD'></td>
                <td className='TD'></td>
                <td className='TD'></td>
                <td className='TD'></td>
                <td className='TD'></td>
                <td className='TD'>37</td>
              </tr>
            </tbody>
          </table><br/><br/>
          <span>ปัจจัยที่มีผลกระทบต่อจำนวนนักศึกษา</span><br/><br/>
        <InputTextarea autoResize style={{ width: '100%' }} value='1. นักศึกษาบางคนมอบตัวเข้าศึกษา มีรายชื่อในระบบทะเบียน แต่ไม่ได้เข้าชั้นเรียน เนื่องจากย้าย สถานศึกษาตั้งแต่ยังไม่เปิดการศึกษา 
2. นักศึกษาแรกเข้าไม่มีความรู้เบื้องต้นในสาขาวิชาที่เลือกเรียน จึงไม่สามารถปรับตัวเข้ากับการเรียนการ สอนที่เกี่ยวกับสาขาวิชาได้
3. นักศึกษาบางคนประสบปัญหาทางบ้าน ทําให้ต้องพักการเรียน หรือต้องทํางานด้วย เรียนด้วย
4. อัตราการแข่งขันของสถาบันการศึกษาทั้งภาครัฐและภาคเอกชน ส่งผลให้มีจํานวนนักศึกษาแรกเข้าน้อยลง เนื่องจากผู้เรียนสามารถเลือกเรียนกับสถาบันการศึกษาในพื้นที่อยู่อาศัย เพื่อลดค่าใช้จ่ายในการเดินทางและ การเรียน
5. จํานวนค่าใช้จ่ายในการชําระค่ามอบตัวเพิ่มขึ้น ส่งผลให้ผู้ปกครองของนักศึกษาบางคนไม่สามารถหาเงิน มาชําระได้ตามกําหนดเวลา เนื่องจากสภาพเศรษฐกิจ
6. ปัญหาวิกฤติประชากรในวัยเรียนลดลง
'/><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>

      <Panel header="3.1.1 การรับนักศึกษา">
        {/***********************************************/}
        <div>
            <span>การรับนักศึกษา</span><br/><br/>
            <InputTextarea autoResize style={{ width: '100%' }} value='สาขาวิชาวางแนวทางเพื่อผลิตบัณฑิตในวิชาชีพด้านวิศวกรรมคอมพิวเตอร์ ที่มีความรู้ใน การผลิตงานที่มีมาตรฐานเพียบพร้อมไปด้วย คุณธรรม จริยธรรม สามารถสร้างองค์ความรู้ความสามารถทางด้านการ ออกแบบ สามารถวางแผนและปฏิบัติงานวิชาชีพด้านการออกแบบได้อย่างเหมาะสม ตลอดจนเป็นศูนย์กลางรวบรวม ข้อมูล วิจัยและพัฒนา พร้อมทั้งให้การบริการวิชาการด้านการออกแบบแก่ชุมชน เพื่อสร้างความแข็งแกร่งและความ เจริญให้แก่ท้องถิ่นจนเป็นรากฐานที่สําคัญ  และสร้างสรรค์พัฒนาความรู้ด้านการออกแบบเพื่อการพัฒนาที่ยั่งยืน
	หลักสูตรมีการกําหนดคุณสมบัติของผู้สมัครที่ต้องการไว้ใน มคอ.2 และมีแผนรับนักศึกษาปีละ 80 คน โดยการ รับนักศึกษา เป็นไปตามข้อบังคับสภามหาวิทยาลัยราชภัฏสวนสุนันทา ว่าด้วยการศึกษาระดับปริญญาตรี พ.ศ.2551  หมวด 1 ข้อ 6'/><br/><br/>
            <span>ระบบกลไก</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ กําหนดให้มีการจัดสอบปฏิบัติจากการรับตรงจากผู้สําเร็จการศึกษามัธยมปลาย โดยการกําหนดหัวข้อในการสอบปฏิบัติ และสาขาได้มีการ ประชุมหารือทุกปีการศึกษา เพื่อกําหนดหัวข้อให้สอดคล้องกับสภาวการณ์ปัจจุบัน โดยสาขาวิชามีระบบ กลไกและ กระบวนการในการคัดเลือกนักศึกษา  ดังนี้ 
		        1. สาขาวิชาประชุม วางแผน กําหนดเกณฑ์ คุณสมบัติ จํานวนรับและกระบวนการรับนักศึกษา ที่สอดคล้อง กับมคอ.2 กับฝ่ายวิชาการของคณะ และมหาวิทยาลัย         เพื่อดําเนินการประกาศรับสมัคร 
		        2. สาขาวิชาประชุมวางแผนร่วมกับฝ่ายประชาสัมพันธ์ของคณะ เพื่อกําหนดแนวทาง สถานที่ ระยะเวลา และ รูปแบบการประชาสัมพันธ์การรับสมัครนักศึกษา
		        3. ประธานหลักสูตร และฝ่ายวิชาการคณะ พิจารณาคัดเลือกกรรมการสอบคัดเลือก ในระบบ TCAS
		        4. ส่งรายชื่อกรรมการสอบไปยังฝ่ายวิชาการมหาวิทยาลัย เพื่อออกคําสั่งแต่งตั้งกรรมการสอบคัดเลือก
		        5. ดําเนินการจัดสอบ ตามข้อบังคับสภามหาวิทยาลัยราชภัฏสวนสุนันทา ทั้ง 5 รอบของระบบ TCAS คือ		
            รอบที่ 1 : การรับด้วยแฟ้มสะสมผลงาน (Portfolio) โดยไม่มีการสอบข้อเขียน 
		        รอบที่ 2 : การรับแบบโควตา 
		        รอบที่ 3 : การรับตรงร่วมกัน 
		        รอบที่ 4 : การรับแบบ Admission 
		        รอบที่ 5 : การรับตรงแบบอิสระ  
		        6. สาขาวิชาประชุมร่วมกับอาจารย์ประจําหลักสูตรเพื่อประมวลผลการสอบ และแจ้งผลไปยังฝ่ายวิชาการของ คณะ และมหาวิทยาลัย        เพื่อประกาศผู้ผ่านการสอบผ่านเว็บไซต์ของมหาวิทยาลัย
		        7. นักศึกษารายงานตัว และชําระเงินลงทะเบียน
		        8. สาขาวิชาจัดปฐมนิเทศนักศึกษาให้กับนักศึกษาใหม่ พร้อมเชิญผู้ปกครอง โดยช่วงเช้าจะเป็นภาพรวมของมหาวิทยาลัยและคณะ ส่วนช่วงบ่ายเป็นของสาขาวิชา         เพื่อแนะนํานักศึกษาเกี่ยวกับโครงสร้างหลักสูตร แนะนํา อาจารย์ การปฏิบัติตัวของนักศึกษา กฎระเบียบ         และแจ้งกําหนดการการเข้าร่วมโครงการปรับพื้นฐานเพื่อเตรียม ความพร้อมของผู้เรียน
		        9. สาขาวิชาพิจารณาผลการรับนักศึกษา ประเมินผล และวิเคราะห์สาเหตุในกระบวนการรับนักศึกษา เพื่อ ปรับปรุงกระบวนการ
'/><br/><br/>
            <span>ผลการดำเนินงาน</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='เนื่องด้วยเกิดวิกฤติประชากรในวัยเรียนลดลงทาง สาขาได้จัดทำโครงการประชาสัมพันธ์เข้าศึกษาต่อสาขาวิศวกรรมคอมพิวเตอร์ ในช่วงเวลาในการรับสมัครรอบที่ 1-4 โดยประชาสัมพันธ์เชิงรุกผ่าน Social media โดยเฉพาะทาง Facebook
		การรับนักศึกษาในปี 2564 สาขาวิชามีขั้นตอนและกระบวนการในการรับนักศึกษา ที่ปรับปรุงจากการ ประเมินผลในปีที่ผ่านมาโดยยึดตามรูปแบบของมหาวิทยาลัยกําหนด และมีการดําเนินการบริหารจัดการภายใน สาขาวิชาเพื่อให้มีความสอดคล้องและเหมาะสม โดยมีกระบวนการดังนี้ 
		1. สาขาวิชาประชุม วางแผน กําหนดเกณฑ์ คุณสมบัติ จํานวนรับ 40 คน เพื่อให้สอดคล้องกับสถานการณ์ และกระบวนการรับ นักศึกษา ที่สอดคล้องกับ มคอ.2 กับฝ่ายวิชาการของคณะ และมหาวิทยาลัย เพื่อดําเนินการประกาศรับสมัคร โดยมี ผลการดําเนินงาน ดังตาราง
    2. สาขาวิชาประชุมวางแผนร่วมกับฝ่ายประชาสัมพันธ์ของคณะ เพื่อกําหนดแนวทาง สถานที่ ระยะเวลา และรูปแบบการประชาสัมพันธ์การรับสมัครนักศึกษา 
		3. ประธานหลักสูตร และฝ่ายวิชาการคณะ พิจารณาคัดเลือกกรรมการสอบคัดเลือก ในการรับนักศึกษา ระบบ TCAS 
		4. ส่งรายชื่อกรรมการสอบไปยังฝ่ายวิชาการมหาวิทยาลัย เพื่อออกคําสั่งแต่งตั้งกรรมการสอบคัดเลือก ได้แก่ อาจารย์ ดร.เศรษฐกาล โปร่งนุช และผู้ช่วยศาสตราจารย์ขวัญเรือน รัศมี (สอบสัมภาษณ์)
		5. ดําเนินการจัดสอบ ตามข้อบังคับสภามหาวิทยาลัยราชภัฏสวนสุนันทา ได้มีการจัดสอบทั้ง 5 รอบของระบบ TCAS คือ 
รอบที่  1 Portfolio การรับด้วยแฟ้มสะสมผลงาน (Portfolio) โดยไม่มีการสอบข้อเขียน โดยผู้สนใจเข้าศึกษาสามารถสมัครผ่านมหาวิทยาลัย เปิดรับสมัครผ่านทาง Internet ทางเว็บไซต์ที่ admission.ssru.ac.th
รอบที่  2 โควตา การรับแบบโควตาที่มีการสอบปฏิบัติและข้อเขียน โดยผู้สนใจเข้าศึกษาสามารถสมัครผ่านมหาวิทยาลัย เปิดรับสมัครผ่านทาง Internet ทางเว็บไซต์ที่ admission.ssru.ac.th 
รอบที่  3 Admission การรับตรงร่วมกัน โดยผู้สนใจเข้าศึกษาสามารถสมัครผ่าน  ทปอ. (ที่ประชุมอธิการบดีแห่งประเทศไทย) หลังจากนั้นจะส่งข้อมูลผู้สมัครไปให้มหาวิทยาลัยเป็นผู้ประมวลคัดเลือก
เปิดรับสมัครผ่านทาง Internet ทางเว็บไซต์ที่ http://tcas.cupt.net 
รอบที่  4 รับตรงอิสระ โดยผู้สนใจเข้าศึกษาสามารถสมัครผ่าน  ทปอ. (ที่ประชุมอธิการบดีแห่งประเทศไทย) เปิดรับสมัครผ่านทาง Internet ทางเว็บไซต์ที่ http://tcas.cupt.net 
รอบที่  5 รับตรงอิสระ (เพิ่มเติม)  โดยผู้สนใจเข้าศึกษาสามารถสมัครสอบได้ตามความต้องการ โดยที่แต่ละมหาวิทยาลัยจะรับตรงด้วยวิธีการของมหาวิทยาลัยเอง
6. สาขาวิชาประชุมร่วมกับอาจารย์ประจําหลักสูตรเพื่อประมวลผลการสอบ และส่งรายชื่อผู้ผ่านเกณฑ์ให้ ฝ่ายวิชาการของคณะ ได้ดำเนินการส่งรายชื่อเป็นจํานวน 40 คน ให้กับฝ่ายวิชาการมหาวิทยาลัย เพื่อประกาศรายชื่อผู้ผ่านเกณฑ์เข้าศึกษา ผ่านเว็บไซต์ของมหาวิทยาลัย
7. นักศึกษารายงานตัว และชําระเงินลงทะเบียน มีจำนวน 40 คน 
8. สาขาวิชาจัดปฐมนิเทศนักศึกษาให้กับนักศึกษาใหม่ ของมหาวิทยาลัยและคณะ ส่วนช่วงบ่ายเป็นของสาขาวิชา เพื่อแนะนํานักศึกษาเกี่ยวกับโครงสร้างหลักสูตร แนะนําอาจารย์ การปฏิบัติตัวของนักศึกษา กฎระเบียบ และแจ้งกําหนดการการเข้าร่วมโครงการปรับพื้นฐานเพื่อเตรียม ความพร้อมของผู้เรียน
9. สาขาวิชาพิจารณาผลการรับนักศึกษา พบว่า
จํานวนนักศึกษาที่มาสมัครในแต่ละรอบ พบว่าในการรับสมัครก็ยังมีรอบที่จำนวนผู้สมัครน้อยกว่าแผนที่ทำการรับเป็นจำนวนมาก เมื่อถึงขั้นตอนการยืนยันสิทธ์ จำนวนนักศึกษาที่ยืนยันสิทธก็มีจำนวนน้อยลงไป และเมื่อถึงขั้นตอนของการมอบตัวจำนวนนักศึกษาที่มอบตัวจริงๆ จำนวนนักศึกษายังน้อยลงไปอีก ทำให้จำนวนนักศึกษาที่สาขาวิชาได้ น้อยกว่าจำนวนที่วางแผนไว้เป็นจำนวนมาก 
จากประเมินผลและวิเคราะห์สาเหตุในกระบวนการรับนักศึกษา พบว่า 
1. การวางแผนในการแนะแนว และการประชาสัมพันธ์ที่คลาดเคลื่อนกับระยะเวลาการรับสมัครที่มีการปรับเปลี่ยน จึงทําให้ไม่สามารถประชาสัมพันธ์ ไปถึงนักเรียนกลุ่มเป้าหมายได้ทัน
2. ควรมีการเพิ่มช่องทางประชาสัมพันธ์ที่เหมาะและเข้าถึงนักศึกษาได้ดีขึ้น เช่น ช่องทางประชาสัมพันธ์ online  Social media ต่างๆ
3. การประชาสัมพันธ์อาจต้องเพิ่มความสำคัญมุ่งเน้นไปที่ รอบ 1 2 และ 4 ซึ่งเป็นรอบที่ ทำการรับนักศึกษาที่สนใจตรงมายังสาขาโดยตรง โดยมีข้อสังเกตจากจำนวนของผู้ที่รายงานตัว มีจำนวนใกล้เคียงกับผู้ที่มารายงานตัวเข้าศึกษาจริงๆ'/><br/><br/>
            <span>การประเมินกระบวนการ</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='สาขาวิชาพิจารณาผลการรับนักศึกษา ประเมินผล และวิเคราะห์สาเหตุในกระบวนการรับนักศึกษา เพื่อ ปรับปรุงกระบวนการ พบว่า ต้องมีการปรับปรุงแผนการแนะแนวและการประชาสัมพันธ์ ให้มีความสอดคล้องกับ ระบบการรับนักศึกษาที่ปรับเปลี่ยน และออกประชาสัมพันธ์ต่อสถานศึกษาให้มากขึ้น และจัดทําแผนการ ประชาสัมพันธ์ลงสู่สถาบันการศึกษาที่สอนทางสายวิชาชีพมากขึ้น เพื่อให้ได้นักศึกษาเป็นไปตามแผนที่วางไว้'/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='ทางสาขาวิชาพิจารณาผลการรับนักศึกษา ประเมินผล และวิเคราะห์สาเหตุในกระบวนการรับนักศึกษา เพื่อ ปรับปรุงกระบวนการ  พบว่าการรับนักศึกษาในบางรอบจะมีระยะเวลาในการประชาสัมพันธ์ที่กระชั้นชิดมากเกินไป และอาจมีสาเหตุจากการที่ทางสาขาวิชายังไม่เป็นที่รูัจักแพร่หลายในสถานศึกษาระดับชั้นมัธยมศึกษาโดยทั่วไป จึงควรมีการปรับกระบวนการเพื่อให้ได้จำนวนนักศึกษาตรงกับเป้าหมาย ดังนี้
1 ต้องมีการปรับปรุงแผนการแนะแนวและการประชาสัมพันธ์ ให้มีความสอดคล้องกับ กำหนดเวลาของการรับสมัครในแต่ละรอบ และ ระบบการรับนักศึกษาที่ปรับเปลี่ยนไปให้ทัน 
2 เพิ่มการประชาสัมพันธ์ให้เป็นที่รู้จักต่อสถานศึกษาทั้งระดับมัธยมปลายทั้งสายวิทย์และศิลป์  โดยเพิ่มความเข้าใจ และความมั่นใจในสายการเรียนที่ไม่ใช่สายวิทย์คณิตให้เข้าใจว่าสามรถเรียนต่อในสาขานี้ได้
3 ควรมีการจัดทําแผนการประชาสัมพันธ์ลงสู่สถาบันการศึกษาที่สอนทางสายวิชาชีพมากขึ้น 
4 เพิ่มช่องทางในการประชาสัมพันธ์ผ่าน Social media ให้มากยิ่งขึ้น เนื่องจากก่อนหน้ามีการเน้นไปที่ Facebook ซึ่งเป็นสื่อสังคมออนไลน์ที่มีปริมาณผู้ใช้มาก แต่ปัจจุบันนักเรียน นักศึกษามีการใช้งาน Instagram Twitter กันมากขึ้น หรือกระทั่งอาจจะต้องมีการประชาสัมพันธ์ผ่าน Google ให้มีนักเรียน นักศึกษา รู้จักสาขาวิชามากยิ่งขึ้น '/><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="3.1.2 การเตรียมความพร้อมก่อนเข้าศึกษา">
        {/***********************************************/}
        <div>
            <span>ระบบกลไก</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='การเตรียมความพร้อมก่อนเข้าศึกษาของหลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ มีระบบกลไก ดังนี้ 
		1. สาขาวิชาประชุมเพื่อวางแผนการเตรียมความพร้อมก่อนเข้าศึกษาให้กับนักศึกษา และกําหนดและแต่งตั้ง อาจารย์ที่ปรึกษา
		2. สาขาวิชากําหนดแผนโครงการในการเตรียมความพร้อมให้กับนักศึกษา เสนอต่อคณะ
		3. ดําเนินการตามแผนโครงการเพื่อเตรียมความพร้อมให้กับนักศึกษา
		4. สาขาวิชาประเมินผล และวิเคราะห์กระบวนการการเตรียมความพร้อมก่อนเข้าศึกษาของนักศึกษา เพื่อปรับปรุงแก้ไขกระบวนการ'/><br/><br/>
            <span>ผลการดำเนินงาน</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='1. สาขาวิชาประชุมเพื่อวางแผนการเตรียมความพร้อมก่อนเข้าศึกษาให้กับนักศึกษา พบว่านักศึกษาใหม่มีความหลากหลาย ซึ่งเกิดจากการรับนักศึกษาจากทั้งสายวิทย์และสายศิลป์ ทำให้นักศึกษามีพื้นความรู้ทางด้านเทคโนโลยีไม่เท่ากัน โดยเฉพาะทางด้านการเขียนโปรแกรมเบื้องต้น จึงได้มีการจัดให้มีการเรียนปรับพืนฐานในส่วนของการเขียนโปรแกรมเบื้องต้นให้กับผู้เรียนก่อนเปิดภาคเรียน โดยมี ผศ.ขวัญเรือน รัศมี เป็นผู้รับผิดชอบดําเนินโครงการปรับพื้นฐานการเขียนโปรแกรมเบื้องต้น 
		2. กําหนดอาจารย์ที่ปรึกษาตามหลักเกณฑ์ คือ เป็นอาจารย์ประจําหลักสูตร หรืออาจารย์ผู้สอนในหลักสูตรและปัจจุบันไม่ได้ทําหน้าที่เป็นที่อาจารย์ที่ปรึกษาของนักศึกษาชั้นปีที่ 2 – 4 คือ ผศ.ดร.รวิ อุตตมธนินทร์ เป็นอาจารย์ที่ปรึกษา 
		2. สาขาวิชากําหนดแผนโครงการในการเตรียมความพร้อมให้กับนักศึกษา 1 โครงการ ได้แก่ โครงการปฐมนิเทศนักศึกษา
		3. ดําเนินการตามแผนโครงการการจัดปฐมนิเทศนักศึกษาให้กับนักศึกษาใหม่ โดยช่วง เช้าจะเป็นภาพรวมของมหาวิทยาลัยและคณะ  ส่วนช่วงบ่ายเป็นของสาขาวิชา เพื่อแนะนํานักศึกษาเกี่ยวกับ โครงสร้างหลักสูตร แนะนําอาจารย์ การปฏิบัติตัวของนักศึกษา กฎระเบียบ และนักศึกษาเข้าร่วมโครงการปรับ พื้นฐานก่อนเปิดภาคเรียน และเนื่องจากอยู่ในภาวะการระบาดของโรคโควิด-19 ทำให้ต้องจัดการปฐมนิเทศในรูปแบบ online ด้วย'/><br/><br/>
            <span>การประเมินกระบวนการ</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='สาขาวิชาประเมินผล และวิเคราะห์กระบวนการการเตรียมความพร้อมก่อนเข้าศึกษาของนักศึกษา เพื่อ ปรับปรุงแก้ไขกระบวนการในปีการศึกษา 2564 พบว่า การกําหนดแผนโครงการเขียนโปรแกรมเบื้องต้นมีประโยชน์ต่อนักศึกษาในชั้นปีที่ 1'/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='ในปีการศึกษา 2564 คาดว่ายังคงจะเกิดสถานการโรคระบาดโควิด-19 ต่อไปทำให้ทางสาขาวิชามีการประชุมหารือ เพื่อกำหนดแนวทางแก้ไข และได้จัดเตรียมสำหรับการสอน online ทำให้ไม่สามารถใช้สถานที่ในมหาวิทยาลัยสำหรับจัดการเรียนการสอนได้ ทางสาขาวิชาจึงมีแนวทางร่วมกับทางคณะโดยเน้นไปที่การจัดการเรียนการสอนในแบบ online ซึ่งทางสาขาวิชามีการประชุมหารือ เพื่อกําหนดแนวทางแก้ไข และปรับปรุงกระบวนการเตรียมความพร้อม เพื่อให้บรรลุตามเป้าหมายที่หลักสูตรกําหนดในปีการศึกษาถัดไป (2564) โดยมีระบบ กลไกและกระบวนการในการ เตรียมความพร้อมก่อนเข้าศึกษา ใหม่ ดังนี้
		1. สาขาวิชาตรวจสอบปฏิทินวิชาการ และกิจกรรมของมหาวิทยาลัย ก่อนการวางแผนเตรียมความพร้อมก่อนเข้าศึกษา 
		2. สาขาวิชาวางแผนการดําเนินโครงการการเตรียมความพร้อมก่อนเข้าศึกษาให้กับนักศึกษา และกําหนด และคัดเลือกอาจารย์ที่ปรึกษาตามหลักเกณฑ์ เพื่อเสนอต่อคณะ 
		3.ดําเนินการตามแผนการดําเนินโครงการการเตรียมความพร้อมก่อนเข้าศึกษาให้กับนักศึกษา และแต่งตั้ง อาจารย์ที่ปรึกษา
		4. ประเมินผลโครงการการเตรียมความพร้อมก่อนเข้าศึกษา และประเมินผลการทํางานของอาจารย์ที่ปรึกษา
		5. สาขาวิชาประเมินผล และวิเคราะห์กระบวนการการเตรียมความพร้อมก่อนเข้าศึกษาของนักศึกษา เพื่อปรับปรุงแก้ไขกระบวนการ'/><br/><br/>
            <span>การประเมินตนเองจากผลการดำเนินงาน</span>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>เป้าหมาย</th>
                <th className='TH'>ผลการดำเนินงาน</th>
                <th className='TH'>คะแนนการประเมินตนเอง</th>
                <th className='TH'>การบรรลุเป้าหมาย</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'>ระดับ 3 </td>
                <td className='TD'>3</td>
                <td className='TD'>3</td>
                <td className='TD'>บรรลุ</td>
              </tr>
            </tbody>
          </table><br/><br/>
            <span>รายการหลักฐานอ้างอิง</span>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>รหัสเอกสาร</th>
                <th className='TH'>รายการเอกสารหลักฐาน</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'>B.ENG 3.1-2-01</td>
                <td className='TD'>โครงการปรับพื้นฐาน</td>
              </tr>
              <tr>
                <td className='TD'>B.ENG 3.1-2-02</td>
                <td className='TD'>คําสั่งแต่งตั้งอาจารย์ที่ปรึกษา</td>
              </tr>
            </tbody>
          </table><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="3.2.1 การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี">
        {/***********************************************/}
        <div>
            <span>การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ มีระบบกลไกในการ ส่งเสริมและพัฒนานักศึกษา ดังนี้ 
1. สาขาวิชา หรือคณะกรรมการบริหารหลักสูตรประชุม เพื่อพิจารณารายชื่ออาจารย์ที่ปรึกษาสําหรับนักศึกษา จากนั้นส่งรายชื่ออาจารย์ที่ปรึกษาไปยังฝ่ายวิชาการและงานทะเบียนของมหาวิทยาลัย เพื่อแจ้งในระบบ สารสนเทศของมหาวิทยาลัย 
2. คณะดําเนินการแต่งตั้งอาจารย์ที่ปรึกษาวิชาการ และแนะแนวแก่นักศึกษาปริญญาตรี และแจกคู่มือ อาจารย์ที่ปรึกษาให้กับอาจารย์ทุกท่าน 
3. สาขาวิชา และคณะ จัดเวลาให้อาจารย์ที่ปรึกษาพบนักศึกษา เพื่อแนะแนวนักศึกษาปริญญาตรี ทั้งด้านการ เรียน ทั้งด้านวิชาการและการใช้ชีวิตในมหาวิทยาลัย รวมถึงการเตรียมความพร้อมด้านอื่นๆ และการจัดอบรมวิธีการ ลงทะเบียนด้วยตนเอง (Free Enrollment) รวมทั้งวางแผนการดําเนินงานด้านการพัฒนาความรู้พื้นฐาน หรือการเตรียม ความพร้อมทางการเรียนให้แก่นักศึกษา ร่วมกัน 
4. ติดตามสถานภาพนักศึกษาทุกภาคการศึกษา และประเมินความพึงพอใจของนักศึกษาในการควบคุมการ ดูแลการให้คําปรึกษาวิชาการและแนะแนว 
5. สาขาวิชา ทบทวนแผนการดําเนินงานด้านการพัฒนาความรู้พื้นฐาน หรือการเตรียมความพร้อมทางการ เรียนให้แก่นักศึกษาทุกปีเพื่อประเมินการดําเนินงาน และวางแนวทางปรับปรุงแก้ไขในปีการศึกษาถัดไป
6. ส่งเสริมกิจกรรมด้านกีฬา
7. สาขาวิชาดำเนินกิจกรรมทางวิชาการในระดับสูง ด้วยการจดอนุสิทธิบัตรร่วมกันระหว่างอาจารย์ และนักศึกษา
7. สาขาวิชาดำเนินกิจกรรมทางวิชาการในระดับสูง ด้วยการพัฒนาบทความทางวิชาการร่วมกันระหว่างอาจารย์ และนักศึกษา
8. สาขาวิชาดำเนินกิจกรรมทางวิชาการในระดับสูง ด้วยการทำ workshop ระดับนานาชาติร่วมกับมหาวิทยาลัยชิบะ ประเทศญี่ปุ่น'/><br/><br/>
            <span>ผลการดำเนินงาน</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='การควบคุมการดูแลการให้คําปรึกษาวิชาการ และแนะแนวแก่นักศึกษาในระดับปริญญาตรี สาขาวิชามีการ ประชุมและวางแผนการดําเนินงานในปีการศึกษา 2564 โดยมีการดําเนินงานดังนี้ 
1. สาขาวิชา พิจารณารายชื่ออาจารย์ที่ปรึกษาสําหรับนักศึกษาชั้นปีที่ 1 ปีการศึกษา 2564 จากนั้นส่งรายชื่อ อาจารย์ที่ปรึกษาไปยังฝ่ายวิชาการและงานทะเบียนของมหาวิทยาลัย เพื่อแจ้งในระบบสารสนเทศของมหาวิทยาลัยโดย การกําหนดเป็นอาจารย์ประจําหลักสูตร หรืออาจารย์ผู้สอนในหลักสูตร และปัจจุบันไม่ได้ทําหน้าที่เป็นที่อาจารย์ที่ปรึกษาของนักศึกษาชั้นปีที่ 2 – 4 ซึ่งได้แก่ ผศ ดร รวิ อุตตมธนินทร์  B.ENG 3.1-2-01 
2. คณะดําเนินการแต่งตั้ง ผศ.ดร รวิ อุตตมธนินทร์ เป็นอาจารย์ที่ปรึกษาวิชาการ และแนะแนว แก่นักศึกษาปริญญาตรีชั้นปีที่ 1 ปีการศึกษา 2564 และแจกคู่มืออาจารย์ที่ปรึกษาให้กับอาจารย์
3. สาขาวิชาดําเนินงาน ดังนี้
3.1 สาขาวิชา และคณะจัดให้มีการจัดบริการให้คําปรึกษาแก่นักศึกษาทางวิชาการและวิชาชีพ  และแนะแนวการใช้ชีวิตแก่นักศึกษา  แบบ online เพื่อแนะนําการ ลงทะเบียนด้วยตนเอง (Free Enrollment)  และสถานที่พบอาจารย์ที่ปรึกษา เพื่อการแลกเปลี่ยนข้อมูล การแก้ไขปัญหา ทางด้านการเรียน หรือต้องการความช่วยเหลือด้านอื่นๆ เช่น การจัดปฐมนิเทศนักศึกษาใหม่ การจัดปัจฉิมนิเทศนักศึกษา ฝึกประสบการณ์วิชาชีพ เป็นต้น และอาจารย์ที่ปรึกษามีช่องทางในการสื่อสารกับนักศึกษาหลากหลาย เช่น Facebook Line และ Email นอกจากนี้ยังจัดให้มีเจ้าหน้าที่รับผิดชอบในการปฏิบัติหน้าที่ให้คําปรึกษาแก่นักศึกษา 
3.2 สาขาวิชาวางแผนและการดําเนินงานด้านการพัฒนาความรู้พื้นฐาน หรือการเตรียมความพร้อมทางการเรียนให้แก่นักศึกษา ร่วมกันกับคณะ
4. อาจารย์ประจําหลักสูตรติดตามสถานภาพนักศึกษาทุกชั้นปี และทุกภาคการศึกษา เพื่อประเมินความพึงพอใจของนักศึกษาในการควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนว 
		ปี 2564 นี้ อ แต่ละท่านได้ผล อยู่ในช่วง ค่าเฉลี่ย 3.50 – 4.49 หมายความว่า มีระดับความพึงพอใจมาก
5. สาขาวิชาดำเนินกิจกรรมทางวิชาการในระดับสูง ด้วยการจดอนุสิทธิบัตรร่วมกันระหว่างอาจารย์ และนักศึกษา ในปี 2564 นี้ มีการดำเนินการจดอนุสิทธิบัตร จำนวน 4 เรื่อง
		-เครื่องต้นแบบเพื่อการเรียนรู้อักษรเบลสำหรับผู้พิการทางสายตา
		-เครื่องแจ้งเตือนการรับผู้สูงอายุ
		-ระบบแจ้งเตือนอุบัติเหตุสำหรับผู้สูงอายุภายในบ้าน
		-ตู้ต้นแบบขนาดเล็กสำหรับการดูแลต้นสตอเบอรี่ควบคุมผ่านเว็บแอปพลิเคชัน
6. สาขาวิชาดำเนินกิจกรรมทางวิชาการในระดับสูง ด้วยการพัฒนาบทความทางวิชาการร่วมกันระหว่างอาจารย์ และนักศึกษา 	จำนวน 6 เรื่อง
'/><br/><br/>
            <span>การประเมินกระบวนการ</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='สาขาประชุมหารือ เพื่อประเมินผลการดําเนินงานทั้งหมดในปีการศึกษา 2564 พบว่า ไม่พบปัญหาในระบบกลไกการควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี ดังนั้นสาขาวิชาเสนอให้ใช้ระบบ กลไกการควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี รูปแบบเดิม ในปีการศึกษา 2564'/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='สาขาวิชาเสนอให้ใช้ระบบกลไกการควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรีรูปแบบเดิม ในปีการศึกษา 2564'/><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="3.2.2 กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21">
        {/***********************************************/}
        <div>
            <span>ระบบกลไก</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ มีระบบกลไกด้านกิจกรรมการพัฒนาศักยภาพของนักศึกษาและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21 ดังนี้ 
1. สาขาวิชาประชุม วางแผนการดําเนินงานกิจกรรมพัฒนาศักยภาพของนักศึกษาทั้งหมดในปีการศึกษา  ทั้ง ทางด้านงบประมาณและกิจกรรม ร่วมกับคณะ 
2. สาขาวิชาเสนอแผนการดําเนินงานกิจกรรมพัฒนาศักยภาพของนักศึกษาและการเสริมสร้างทักษะการ เรียนรู้ในศตวรรษที่ 21 ทั้งหมดในปีการศึกษา  ทั้งทางด้านงบประมาณและกิจกรรม แก่คณะ
3. ดําเนินกิจกรรมการพัฒนาศักยภาพของนักศึกษาตามแผนงานตามไตรมาศ
4. ประเมินโครงการกิจกรรมการพัฒนาศักยภาพของนักศึกษา ทุกโครงการ เพื่อสรุปผลรายงานต่อคณะ
5. สาขาวิชาทบทวน และประเมินผลการดําเนินกิจกรรมการพัฒนาศักยภาพของนักศึกษาและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21 เพื่อนําไปปรับปรุงแก้ไข
'/><br/><br/>
            <span>ผลการดําเนินงาน</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='กิจกรรมการพัฒนาศักยภาพของนักศึกษาและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21 ในปีการศึกษา 2564 มีผลการดําเนินงาน ดังนี้ 
1. สาขาวิชาประชุม วางแผนการดําเนินงานกิจกรรมพัฒนาศักยภาพของนักศึกษาทั้งหมดในปีการศึกษา  ทั้ง ทางด้านงบประมาณและกิจกรรม โดยแบ่งการดําเนินงานเป็นไปตามไตรมาศ 
2. สาขาวิชาเสนอแผนการดําเนินงานกิจกรรมพัฒนาศักยภาพของนักศึกษาและการเสริมสร้างทักษะการ เรียนรู้ในศตวรรษที่ 21 ในปีการศึกษา 2564  ทั้งทางด้านงบประมาณและกิจกรรม แก่คณะ เพื่อขออนุมัติงบประมาณ และโครงการ 
3. ในปีการศึกษานี้ เป็นการเรียนการสอนแบบ online ดังนั้น จึงได้ งด การจัดกิจกรรมของสาขา โดยใช้กิจกรรมที่ทางมหาวิทยาลัยจัดแบบ online ร่วมกันให้ นศ.
'/><br/><br/>
            <span>การประเมินกระบวนการ</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='ในปีการศึกษา 2564 นี้ ทางสาขางดการจัดกิจกรรม เพราะ ยังคงเป็นการเรียนแบบ online ทําให้การดําเนินโครงการไม่บรรลุ แต่ก็มีกิจกรรมจากทางคณะและทางมหาวิทยาลัยจัดให้กับ นศ อยู่บ้าง ดังนั้นสาขาวิชาจึงขอปรับกระบวนการ และดูสถานการต่อไปก่อนสำหรับปีถัดไป'/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='สาขาวิชา เสนอให้มีการปรับปรุงระบบกลไกด้านกิจกรรมการพัฒนาศักยภาพของนักศึกษาและการ เสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21 ใหม่ ดังนี้ 
	1. สาขาวิชาตรวจสอบกิจกรรมของคณะ และมหาวิทยาลัย ก่อนการวางแผนด้านกิจกรรมการพัฒนา ศักยภาพของนักศึกษาและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21 
	2. สาขาวิชาประชุม วางแผนการดําเนินงานกิจกรรมพัฒนาศักยภาพของนักศึกษาทั้งหมดในปีการศึกษา  ทั้ง ทางด้านงบประมาณและกิจกรรม และแผนงานการบริหารความเสี่ยง กรณีเกิดปัญหา ทั้งก่อนดําเนินกิจกรรม ระหว่างดําเนินกิจกรรม และหลังการดําเนินกิจกรรม 
	3. สาขาวิชาเสนอแผนการดําเนินงานกิจกรรมพัฒนาศักยภาพของนักศึกษาและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21 ทั้งหมดในปีการศึกษา ทั้งทางด้านงบประมาณและกิจกรรม แก่คณะ เพื่อขออนุมัติ งบประมาณ
	4. ดําเนินกิจกรรมการพัฒนาศักยภาพของนักศึกษาตามแผนงานตามไตรมาสที่กําหนดไว้
	5. ประเมินโครงการกิจกรรมการพัฒนาศักยภาพของนักศึกษา ทุกโครงการ เพื่อสรุปผลรายงานต่อคณะ
	6. สาขาวิชาทบทวน และประเมินผลการดําเนินกิจกรรมการพัฒนาศักยภาพของนักศึกษาและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21 เพื่อนําไปปรับปรุงแก้ไข
'/><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="3.2.3 การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์ แก่บัณฑิตศึกษา">
        {/***********************************************/}
        <div>
            <span>การประเมินตนเองจากผลการดำเนินงาน</span>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>เป้าหมาย</th>
                <th className='TH'>ผลการดำเนินงาน</th>
                <th className='TH'>คะแนนการประเมินตนเอง</th>
                <th className='TH'>การบรรลุเป้าหมาย</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'>ระดับ 2</td>
                <td className='TD'>2</td>
                <td className='TD'>2</td>
                <td className='TD'>บรรลุ</td>
              </tr>
            </tbody>
          </table><br/><br/>
            <span>รายการหลักฐานอ้างอิง</span>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>รหัสเอกสาร</th>
                <th className='TH'>รายการเอกสารหลักฐาน</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'>B.ENG 3.1-2-01</td>
                <td className='TD'>คําสั่งแต่งตั้งอาจารย์ที่ปรึกษา</td>
              </tr>
              <tr>
                <td className='TD'>B.ENG 3.2-2-01</td>
                <td className='TD'>ผลการประเมินอาจารย์ที่ปรึกษา</td>
              </tr>
              <tr>
                <td className='TD'>B.ENG 3.2-2-02</td>
                <td className='TD'>ผลการประเมินโครงการ</td>
              </tr>
            </tbody>
          </table><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="ผลที่เกิดกับนักศึกษา">
        {/***********************************************/}
        <div>
            <span>ข้อมูลนักศึกษา และจำนวนผู้สำเร็จการศึกษาตามแผนการศึกษาและจำนวนผู้สำเร็จการศึกษา</span><br/><br/>
            <table>
              <thead>
                <tr>
                  <th rowSpan="2">ปีการศึกษาที่รับเข้า</th>
                  <th rowSpan="2">จำนวนรับเข้า(1)</th>
                  <th colSpan="6">จำนวนนักศึกษาคงอยู่ ในแต่ละปีการศึกษา (2)</th>
                  <th rowSpan="2">จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา (3)</th>
                </tr>
                <tr>
                  <th>2559</th>
                  <th>2560</th>
                  <th>2561</th>
                  <th>2562</th>
                  <th>2563</th>
                  <th>2564</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <th>2559</th>
                  <th>64</th>
                  <th>62</th>
                  <th>40</th>
                  <th>36</th>
                  <th>37</th>
                  <th>26</th>
                  <th>12</th>
                  <th>14</th>
                </tr>
                <tr>
                  <th>2560</th>
                  <th>40</th>
                  <th>-</th>
                  <th>40</th>
                  <th>37</th>
                  <th>31</th>
                  <th>31</th>
                  <th>18</th>
                  <th>13</th>
                </tr>
                <tr>
                  <th>2561</th>
                  <th>40</th>
                  <th>-</th>
                  <th>-</th>
                  <th>40</th>
                  <th>37</th>
                  <th>36</th>
                  <th>35</th>
                  <th>1</th>
                </tr>
                <tr>
                  <th>2562</th>
                  <th>27</th>
                  <th>-</th>
                  <th>-</th>
                  <th>-</th>
                  <th>27</th>
                  <th>25</th>
                  <th>24</th>
                  <th>1</th>
                </tr>
                <tr>
                  <th>2563</th>
                  <th>39</th>
                  <th>-</th>
                  <th>-</th>
                  <th>-</th>
                  <th>-</th>
                  <th>39</th>
                  <th>33</th>
                  <th>6</th>
                </tr>
                <tr>
                  <th>2564</th>
                  <th>40</th>
                  <th>-</th>
                  <th>-</th>
                  <th>-</th>
                  <th>-</th>
                  <th>-</th>
                  <th>37</th>
                  <th>3</th>
                </tr>
              </tbody>
            </table><br/><br/>

            <table>
              <thead>
                <tr>
                  <th rowSpan="2">อัตราการคงอยู่</th>
                  <th >= จำนวนรับเข้า (1) – จำนวน นศ.ที่ลาออกและคัดชื่อออกฯ (3)</th>
                  <th rowSpan="2">*100</th>
                </tr>
                <tr>
                  <th >จำนวนนักศึกษารับเข้า (1)</th>
                </tr>
              </thead>
            </table><br/><br/>

            <table>
              <thead>
              </thead>
              <tbody>
                <tr>
                  <th rowSpan="2">อัตราการคงอยู่ปีการศึกษา 2559 =</th>
                  <th >(64 – 14)*100</th>
                  <th rowSpan="2">= ร้อยละ 78.125</th>
                </tr>
                <tr>
                  <th >64</th>
                </tr>
              </tbody>
            </table><br/><br/>

            <table>
              <thead>
              </thead>
              <tbody>
                <tr>
                  <th rowSpan="2">อัตราการคงอยู่ปีการศึกษา 2560 =</th>
                  <th >(40 – 13)*100</th>
                  <th rowSpan="2">= ร้อยละ 67.50</th>
                </tr>
                <tr>
                  <th >40</th>
                </tr>
              </tbody>
            </table><br/><br/>

            <table>
              <thead>
              </thead>
              <tbody>
                <tr>
                  <th rowSpan="2">อัตราการคงอยู่ปีการศึกษา 2561 =</th>
                  <th >(40 – 1)*100</th>
                  <th rowSpan="2">= ร้อยละ 97.50</th>
                </tr>
                <tr>
                  <th >40</th>
                </tr>
              </tbody>
            </table><br/><br/>

            <table>
              <thead>
              </thead>
              <tbody>
                <tr>
                  <th rowSpan="2">อัตราการคงอยู่ปีการศึกษา 2562 =</th>
                  <th >(27 – 1)*100</th>
                  <th rowSpan="2">= ร้อยละ 96.29</th>
                </tr>
                <tr>
                  <th >27</th>
                </tr>
              </tbody>
            </table><br/><br/>

            <table>
              <thead>
              </thead>
              <tbody>
                <tr>
                  <th rowSpan="2">อัตราการคงอยู่ปีการศึกษา 2563 =</th>
                  <th >(39 – 6)*100</th>
                  <th rowSpan="2">= ร้อยละ 84.61</th>
                </tr>
                <tr>
                  <th >39</th>
                </tr>
              </tbody>
            </table><br/><br/>

            <table>
              <thead>
              </thead>
              <tbody>
                <tr>
                  <th rowSpan="2">อัตราการคงอยู่ปีการศึกษา 2564 =</th>
                  <th >(40 – 3)*100</th>
                  <th rowSpan="2">= ร้อยละ 92.50</th>
                </tr>
                <tr>
                  <th >40</th>
                </tr>
              </tbody>
            </table><br/><br/>

            <table>
              <thead>
                <tr>
                  <th rowSpan="2">ปีการศึกษา</th>
                  <th rowSpan="2">จำนวนรับเข้า(1)</th>
                  <th colSpan="6">จำนวนผู้สำเร็จการศึกษาตามหลักสูตร (2)</th>
                </tr>
                <tr>
                  <th>2559</th>
                  <th>2560</th>
                  <th>2561</th>
                  <th>2562</th>
                  <th>2563</th>
                  <th>2564</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <th>2557</th>
                  <th>60</th>
                  <th>-</th>
                  <th>19 (31.66)</th>
                  <th>-</th>
                  <th>-</th>
                  <th>-</th>
                  <th>-</th>
                </tr>
                <tr>
                  <th>2558</th>
                  <th>64</th>
                  <th>-</th>
                  <th>-</th>
                  <th>38 (59.37)</th>
                  <th>-</th>
                  <th>-</th>
                  <th>-</th>
                </tr>
                <tr>
                  <th>2559</th>
                  <th>62</th>
                  <th>-</th>
                  <th>-</th>
                  <th>-</th>
                  <th>23 (37.09)</th>
                  <th>-</th>
                  <th>-</th>
                </tr>
                <tr>
                  <th>2560</th>
                  <th>40</th>
                  <th>-</th>
                  <th>-</th>
                  <th>-</th>
                  <th>-</th>
                  <th>23 (57.50)</th>
                  <th>-</th>
                </tr>
                <tr>
                  <th>2561</th>
                  <th>40</th>
                  <th>-</th>
                  <th>-</th>
                  <th>-</th>
                  <th>-</th>
                  <th>-</th>
                  <th>26 (65.00)</th>
                </tr>
              </tbody>
            </table>

            <span>ปัจจัยที่ส่งผลกระทบต่อจำนวนนักศึกษา</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='1. ในปีนี้การจบของนักศึกษาจะเป็นส่วนที่เก็บตกจากปีก่อนๆ ที่สามารถเรียนในจบในส่วนของวิชาโครงงาน และ ในหมวดการศึกษาทั่วไปของทางมหาวิทยาลัยได้ ส่วนนักศึกษาที่ยังไม่จบตรงกับปีการศึกษานั้น ส่วนใหญ่จะติดในส่วนของวิชาโครงงาน ดังนั้นจึงเป็นผลกระทบกับการจบ การศึกษาของนักศึกษา ทําให้มีจํานวนนักศึกษาที่ไม่สําเร็จการศึกษาตามกําหนดเวลาตามที่หลักสูตรกําหนด 
		2. ปัจจัยที่ส่งผลกระทบต่อจํานวนนักศึกษาที่สําเร็จการศึกษาตามระยะเวลาของหลักสูตร เนื่องจากหลักสูตรมี รายวิชาที่ให้นักศึกษาดําเนินงานเกี่ยวกับการทําปริญญานิพนธ์ เพื่อให้นักศึกษาเรียนรู้ขั้นตอนและกระบวนการทำโครงงานที่สามารถนําไปต่อยอดในการศึกษาในระดับที่สูงขึ้นได้ แต่นักศึกษาบางกลุ่มใช้เวลาในการค้นคว้าหาข้อมูลเพื่อประกอบการทําปริญญานิพนธ์ค่อนข้างนาน ส่งผลทําให้งานเกิดความล่าช้า 
		3. เนื่องจากสภาพเศรษฐกิจ และปัญหาครอบครัวของนักศึกษาบางคน ทําให้นักศึกษาต้องทํางานไปด้วย และเรียนไปด้วย ส่งผลให้นักศึกษาต้องใช้เวลาในการเรียนเพิ่มมากขึ้น เพราะลงทะเบียนเรียนในแต่ละภาคการศึกษาน้อยลง เพื่อให้มีเวลาในการทํางานเพิ่มมากขึ้น'/><br/><br/>
            <span>การประเมินความพึงพอใจของนักศึกษา</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='ในปีการศึกษา 2564 เนื่องจากเป็นการเรียนแบบ online ในปีนี้จึงไม่ได้ทำการสำรวจประเมินความพึงพอใจของนักศึกษา'/><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="การจัดการข้อร้องเรียนของนักศึกษา">
        {/***********************************************/}
        <div>
            <span>ระบบกลไก</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ มีระบบกลไกในการ จัดการข้อร้องเรียนของนักศึกษา ดังนี้ 
		1. สาขาวิชา หรือคณะกรรมการบริหารหลักสูตรประชุม วางแผนการทํางานด้านการจัดการบริหารความ เสี่ยง ในกรณีเกิดเหตุร้องเรียนจากนักศึกษา 
		2. สาขาวิชาแจ้งช่องทาง และแนวทางการส่งเรื่องร้องเรียนต่างๆ ผ่านทางสื่อสังคมออนไลน์  โทรศัพท์ และ ร้องเรียนโดยตรงกับอาจารย์ที่ปรึกษา โดยผู้เรียนสามารถร้องเรียนได้ตลอด 24 ชม. 
		3. เมื่อสาขาวิชา พบข้อร้องเรียนจากนักศึกษา หลักสูตรจะดําเนินสืบหารายละเอียด ข้อเท็จจริง และประชุมกับผู้เกี่ยวข้อง เพื่อหาแนวทางการปรับปรุงแก้ไขตามเห็นสมควร ในกรณีเร่งด่วนทางหลักสูตรจะแก้ปัญหาให้ทันที 
		4. ติดตามผลการแก้ไขปัญหาจากข้อร้องเรียนของนักศึกษา และประเมินความพึงพอใจของนักศึกษาในการ จัดการข้อร้องเรียนของนักศึกษา 
		5. สาขาวิชา ทบทวนระบบกลไกและแผนการดําเนินงานการจัดการข้อร้องเรียนของนักศึกษาทุกปี เพื่อ ประเมินการดําเนินงาน และวางแนวทางปรับปรุงแก้ไขในปีการศึกษาถัดไป'/><br/><br/>
            <span>ผลการดําเนินงาน</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='ผลการดําเนินงานในปีการศึกษา 2564 ในการจัดการข้อร้องเรียนของนักศึกษามีดังนี้ 
		1. สาขาวิชาประชุม เพื่อวางแผนการทํางานด้านการจัดการบริหารความเสี่ยง ในกรณีเกิดเหตุร้องเรียนจากนักศึกษาประจําภาคการศึกษา 2564
		2. สาขาแจ้งช่องทาง และแนวทางการส่งเรื่องร้องเรียนต่างๆ ผ่านทางสื่อสังคมออนไลน์ อาทิเช่น Facebook  โทรศัพท์ และร้องเรียน โดยตรงกับอาจารย์ที่ปรึกษา โดยผู้เรียนสามารถร้องเรียนได้ตลอด 24 ขม. โดยแจ้งในวันปฐมนิเทศนักศึกษา 
		3. ในปีการศึกษา 2564 พบข้อร้องเรียน
    4.สาขาติดตามผลการแก้ไขปัญหาจากข้อร้องเรียนของนักศึกษาที่มีการร้องเรียนผ่านอาจารย์ที่
ปรึกษาในปีนี้ทำด้วยการสอบถามความคิดเห็นของนักศึกษาในภาพรวม นักศึกษาก็มีความเข้าใจถึงสถานการและความจำเป็นที่ต้องเรียน online
		5. สาขาวิชา ทบทวนระบบกลไกและแผนการดําเนินงานการจัดการข้อร้องเรียนของนักศึกษาทุกปี เพื่อประเมิน การดําเนินงาน และวางแนวทางปรับปรุงแก้ไขในปีการศึกษาถัดไป'/><br/><br/>
            <span>การประเมินกระบวนการ</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='สาขาวิชาทบทวนระบบกลไกและแผนการดําเนินงานการจัดการข้อร้องเรียนของนักศึกษาทุกปี เพื่อประเมินการดําเนินงานและวางแนวทางปรับปรุงแก้ไขในปีการศึกษาถัดไปจากการดําเนินงานพบว่าในปีการศึกษา2564 พบปัญหาในการดําเนินการจัดการข้อร้องเรียนดังนั้นสาขาวิชาเสนอให้ใช้ระบบกลไกการจัดการข้อร้องเรียนของ นักศึกษารูปแบบเดิม ในปีการศึกษา 2565'/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='สาขาวิชาเสนอให้ใช้ระบบกลไกการจัดการข้อร้องเรียนของนักศึกษารูปแบบเดิมในปีการศึกษา 2565 เนื่องจากมีแนวทางการส่งเรื่องร้องเรียนต่างๆผ่านทางสื่อสังคมออนไลน์โทรศัพท์และร้องเรียนโดยตรงกับอาจารย์ ที่ปรึกษา โดยผู้เรียนสามารถร้องเรียนได้ตลอด 24 ชม.'/><br/><br/>

        </div>
        {/***********************************************/}
      </Panel><br/><br/>

            <Panel header="3.3.1 การคงอยู่">
            <span>การคงอยู่</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='นักศึกษาปีการศึกษา 2559 มีอัตราการคงอยู่คิดเป็นร้อยละ 78.125
นักศึกษาปีการศึกษา 2560 มีอัตราการคงอยู่คิดเป็นร้อยละ 67.50
นักศึกษาปีการศึกษา 2561 มีอัตราการคงอยู่คิดเป็นร้อยละ 97.50
นักศึกษาปีการศึกษา 2562 มีอัตราการคงอยู่คิดเป็นร้อยละ 96.29
นักศึกษาปีการศึกษา 2563 มีอัตราการคงอยู่คิดเป็นร้อยละ 84.61
นักศึกษาปีการศึกษา 2564 มีอัตราการคงอยู่คิดเป็นร้อยละ 92.50'/>
            </Panel><br/><br/>
            
            <Panel header="3.3.2 การสำเร็จการศึกษา">
            <span>การสำเร็จการศึกษา</span><br/><br/>
            <InputTextarea autoResize style={{ width: '100%' }} value='การสําเร็จการศึกษาตามระยะเวลาของหลักสูตรเนื่องจากหลักสูตรมีรายวิชาที่ให้นักศึกษาดําเนินงานเกี่ยวกับการทําปริญญานิพนธ์เพื่อให้นักศึกษาเรียนรู้ขั้นตอนและกระบวนการทำโครงงานที่สามารถนําไปต่อยอดในการศึกษาในระดับที่สูงขึ้นได้แต่นักศึกษาบางกลุ่มใช้เวลาในการค้นคว้าหาข้อมูลเพื่อประกอบการทําปริญญานิพนธ์ค่อนข้างนานส่งผลทําให้งานเกิดความล่าช้าอีกทั้งนักศึกษาบางคนตกและยกเลิกรายววิชาในหมวดศึกษาทั่วไปจึงต้องดําเนินการเก็บรายวิชาดังกล่าวในปีการศึกษาถัดมาดังนั้นจึงมีผลกระทบกับการจบการศึกษาของนักศึกษาทําให้มีจํานวนนักศึกษาที่ไม่สําเร็จการศึกษาตามกําหนดเวลาตามที่หลักสูตรกําหนด'/><br/><br/>
            </Panel><br/><br/>

            <Panel header="3.3.2 การสำเร็จการศึกษา">
            <span>ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา</span><br/><br/>
            <InputTextarea autoResize style={{ width: '100%' }}value='สาขาวิชาประชุมวางแผนการทํางานด้านการจัดการบริหารความเสี่ยงในกรณีเกิดเหตุร้องเรียนจากนักศึกษาประจําภาคการศึกษา2563และแจ้งช่องทางและแนวทางการส่งเรื่องร้องเรียนต่างๆผ่านทางสื่อสังคม ออนไลน์  โทรศัพท์ และร้องเรียนโดยตรงกับอาจารย์ที่ปรึกษา โดยผู้เรียนสามารถร้องเรียนได้ตลอด 24 ขม. โดยแจ้ง ในวันปฐมนิเทศนักศึกษา ซึ่งในปีการศึกษา 2563 พบข้อร้องเรียนมายังหลักสูตร 2 ข้อ ได้แก่1)อยากให้อาจารย์ผู้สอนเข้าสอนตรงเวลา2)อยากได้ห้องทำโครงงานที่มีขนาดใหญ่หรือจำนวนเพิ่มขึ้น ซึ่งสาขาได้จัดประชุมสาขาและหัวหน้าสาขาชี้แจงข้อร้องเรียนให้อาจารย์ผู้สอนทราบพร้อมสอบถามและให้อาจารย์ผู้สอนชี้แจงและสุดท้ายหัวหน้าสาขานำผลการชี้แจงแจ้งนักศึกษาผ่านทางสื่อสังคมออนไลน์สำหรับข้อ 2) ได้จัดประชุมสาขาและหัวหน้าสาขาชี้แจงข้อร้องเรียน ให้อาจารย์ในสาขาทราบ พร้อมสอบถามข้อคิดเห็น ทำสรุปการประชุม และสุดท้ายหัวหน้าสาขานำรายงานการประชุมแจ้งให้กับคณะฯ ทราบ และนักศึกษามีความพึงพอใจต่อการจัดการข้อร้องเรียนอยู่ในระดับดีมาก'/><br/><br/>
            <span>การประเมินตนเองจากผลการดำเนินงาน</span><br/><br/>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>เป้าหมาย</th>
                <th className='TH'>ผลการดำเนินงาน</th>
                <th className='TH'>คะแนนการประเมินตนเอง</th>
                <th className='TH'>การบรรลุเป้าหมาย</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'>ระดับ 2</td>
                <td className='TD'>2</td>
                <td className='TD'>2</td>
                <td className='TD'>บรรลุ</td>
              </tr>
            </tbody>
          </table><br/><br/>

            <span>รายการหลักฐานอ้างอิง</span><br/><br/>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>รหัสเอกสาร</th>
                <th className='TH'>รายการเอกสารหลักฐาน</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'>B.ENG 3.3-3-01</td>
                <td className='TD'>ตารางรายงานจำนวนนักศึกษาที่จบในแต่ละปีจากส่วนกลาง</td>
              </tr>
            </tbody>
          </table><br/><br/>
            </Panel><br/><br/>
        
      <Panel header="ตัวบ่งชี้ที่ 2.1 คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ">
        {/***********************************************/}
        <div>
            <span>ผลการดำเนินงาน</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='หลักสูตรวิศวกรรมศาสตรบัณฑิตสาขาวิชาวิศวกรรมคอมพิวเตอร์สำรวจคุณภาพของบัณฑิตที่จบการศึกษาในปีการศึกษา 2564 ที่ครอบคลุมตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ 5 ด้าน คือ (1) ด้านคุณธรรมจริยธรรม(2)ด้านความรู้(3)ด้านทักษะทางปัญญา(4)ด้านทักษะความสัมพันธ์ระหว่างบุคคล และ(5)ด้านทักษะการวิเคราะห์เชิงตัวเลขการสื่อสารและการใช้เทคโนโลยีสารสนเทศสำรวจโดยการแจกแบบสอบถามจากผู้ใช้บัณฑิต ดังนี้
		จำนวนบัณฑิตหลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ ที่สำเร็จการศึกษารวม 23 คน โดยได้รับแบบสำรวจกลับมาจากผู้ใช้บัณฑิต จำนวน 13  ฉบับ คิดเป็นร้อยละ 56.52 จากจำนวนบัณฑิตที่สำเร็จการศึกษาทั้งหมดโดยระดับความพึงพอใจของผู้ใช้บัณฑิตที่มีต่อบัณฑิตหลักสูตรมีค่าเฉลี่ยเท่ากับ 4.50'/><br/><br/>
            <span>ข้อมูลประกอบการคำนวณคุณภาพของบัณฑิตหลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์</span><br/><br/>
            <table>
              <thead>
                <tr>
                  <th>ลำดับที่</th>
                  <th>ข้อมูลพื้นฐานประกอบตัวบ่งชี้</th>
                  <th>หน่วยวัด</th>
                  <th>รวม</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <th colSpan="2">คุณภาพของบัณฑิตปริญญาตรี/โท/เอก ตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ </th>
                  <th>เฉลี่ย</th>
                  <th>4.50</th>
                </tr>
                <tr>
                  <th>1</th>
                  <th>จำนวนผู้สำเร็จการศึกษาทั้งหมด</th>
                  <th>คน</th>
                  <th>23</th>
                </tr>
                <tr>
                  <th>2</th>
                  <th>จำนวนผู้สำเร็จการศึกษาที่ได้รับการประเมินคุณภาพตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ </th>
                  <th>คน</th>
                  <th>13</th>
                </tr>
                <tr>
                  <th>3</th>
                  <th>ผลการประเมินจากความพึงพอใจของผู้ใช้บัณฑิต</th>
                  <th>คะแนน</th>
                  <th></th>
                </tr>
                <tr>
                  <th></th>
                  <th>(1) ด้านคุณธรรมจริยธรรม</th>
                  <th>คะแนน</th>
                  <th>4.60</th>
                </tr>
                <tr>
                  <th></th>
                  <th>(2) ด้านความรู้</th>
                  <th>คะแนน</th>
                  <th>4.45</th>
                </tr>
                <tr>
                  <th></th>
                  <th>(3) ด้านทักษะทางปัญญา</th>
                  <th>คะแนน</th>
                  <th>4.30</th>
                </tr>
                <tr>
                  <th></th>
                  <th>(4) ด้านทักษะความสัมพันธ์ระหว่างบุคคล</th>
                  <th>คะแนน</th>
                  <th>4.31</th>
                </tr>
                <tr>
                  <th></th>
                  <th>(5) ด้านทักษะการวิเคราะห์เชิงตัวเลข การสื่อสารและการใช้</th>
                  <th>คะแนน</th>
                  <th>4.29</th>
                </tr>
                <tr>
                  <th>4</th>
                  <th>อัตลักษณ์ของบัณฑิต</th>
                  <th>คน</th>
                  <th>4.08</th>
                </tr>
                <tr>
                  <th>5</th>
                  <th>ระดับความพึงพอใจในคุณลักษณะของบัณฑิตและผลการปฏิบัติงานของบัณฑิต</th>
                  <th>คน</th>
                  <th>4.50</th>
                </tr>
                <tr>
                  <th>6</th>
                  <th>ผู้ตอบแบบประเมินความพึงพอใจของผู้ใช้บัณฑิตที่มีต่อผู้สำเร็จการศึกษา</th>
                  <th>ร้อยละ</th>
                  <th>56.52</th>
                </tr>
              </tbody>
            </table><br/><br/>

            <span>การประเมินตนเองจากผลการดำเนินงาน</span><br/><br/>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>เป้าหมาย</th>
                <th className='TH'>ผลการดำเนินงาน</th>
                <th className='TH'>คะแนนการประเมินตนเอง</th>
                <th className='TH'>การบรรลุเป้าหมาย</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'>4.50 คะแนน</td>
                <td className='TD'>4.50</td>
                <td className='TD'>4.50</td>
                <td className='TD'>บรรลุ</td>
              </tr>
            </tbody>
          </table><br/><br/>

            <span>รายการหลักฐานอ้างอิง</span><br/><br/>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>รหัสเอกสาร</th>
                <th className='TH'>รายการเอกสารหลักฐาน</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'>B.ENG 2.2-1-01</td>
                <td className='TD'>รายงานสรุปผลการสำรวจความคิดเห็นที่มีต่อคุณภาพของบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ จากสถานประกอบการผู้ใช้บัณฑิต หรือสถาบันที่รับบัณฑิตเข้าศึกษาต่อ ปีการศึกษา 2563</td>
              </tr>
            </tbody>
          </table><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="ตัวบ่งชี้ที่ 2.2 ร้อยละของบัณฑิตปริญญาตรีที่ได้งานทําหรือประกอบอาชีพอิสระภายใน 1 ปี">
        {/***********************************************/}
        <div>
            <span>ผลการดำเนินงาน</span>
            <InputTextarea autoResize style={{ width: '100%' }} value='หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์  สำรวจการมีงานทำของบัณฑิตที่สำเร็จการศึกษาในปีการศึกษา 2564 โดยใช้การสำรวจด้วยการให้บัณฑิตตอบแบบสอบถามด้วยตนเอง ผ่านระบบการลงทะเบียนรับปริญญาบัตรของมหาวิทยาลัย ซึ่งมีบัณฑิตสำเร็จการศึกษาหลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์  จำนวน 23 คน พบว่า มีบัณฑิตตอบแบบสอบถาม 22 คน คิดเป็นร้อยละ 95.65  ของบัณฑิตที่สำเร็จการศึกษาทั้งหมด โดยมีบัณฑิตที่ได้งานทำหรือประกอบอาชีพอิสระภายใน 1 ปี จำนวน 14 คน จากจำนวนบัณฑิตที่ตอบแบบสำรวจโดยไม่นับรวมบัณฑิตที่มีงานทำก่อนเข้าศึกษาหรือมีกิจการของตนเองที่มีรายได้ประจำอยู่แล้วที่ไม่ได้เปลี่ยนงานใหม่ ผู้ที่ศึกษาต่อในระดับบัณฑิตศึกษา ผู้อุปสมบทและผู้ที่เกณฑ์ทหาร ไม่มี'/><br/><br/>

            <span>ข้อมูลประกอบการคำนวณภาวะการมีงานทำหรือประกอบอาชีพอิสระของบัณฑิตที่สำเร็จการศึกษา</span>
            <table>
              <thead>
                <tr>
                  <th>ลำดับที่</th>
                  <th>ข้อมูลพื้นฐานประกอบตัวบ่งชี้</th>
                  <th>หน่วยวัด</th>
                  <th>ผลการดำเนินงาน</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <th colSpan="2">บัณฑิตปริญญาตรีที่ได้งานทำหรือประกอบอาชีพอิสระภายใน 1 ปี</th>
                  <th>ร้อยละ</th>
                  <th>66.67</th>
                </tr>
                <tr>
                  <th>1</th>
                  <th>จำนวนบัณฑิตระดับปริญญาตรีทั้งหมด</th>
                  <th>คน</th>
                  <th>23</th>
                </tr>
                <tr>
                  <th>2</th>
                  <th>จำนวนบัณฑิตระดับปริญญาตรีที่ตอบแบบสำรวจเรื่องการมีงานทำ</th>
                  <th>คน</th>
                  <th>22</th>
                </tr>
                <tr>
                  <th>3</th>
                  <th>จำนวนบัณฑิตระดับปริญญาตรีที่ได้งานทำหลังสำเร็จการศึกษา (ไม่นับรวมผู้ที่ประกอบอาชีพอิสระ)</th>
                  <th>คน</th>
                  <th>14</th>
                </tr>
                <tr>
                  <th>4</th>
                  <th>จำนวนบัณฑิตระดับปริญญาตรีที่ประกอบอาชีพอิสระ</th>
                  <th>คน</th>
                  <th>0</th>
                </tr>
                <tr>
                  <th>5</th>
                  <th>จำนวนผู้สำเร็จการศึกษาระดับปริญญาตรีที่มีงานทำก่อนเข้าศึกษา</th>
                  <th>คน</th>
                  <th>1</th>
                </tr>
                <tr>
                  <th>6</th>
                  <th>จำนวนบัณฑิตระดับปริญญาตรีที่มีกิจการของตนเองที่มีรายได้ประจำอยู่แล้ว</th>
                  <th>คน</th>
                  <th>0</th>
                </tr>
                <tr>
                  <th>7</th>
                  <th>จำนวนบัณฑิตระดับปริญญาตรีที่ศึกษาต่อระดับบัณฑิตศึกษา</th>
                  <th>คน</th>
                  <th>0</th>
                </tr>
                <tr>
                  <th>8</th>
                  <th>จำนวนบัณฑิตระดับปริญญาตรีที่อุปสมบท</th>
                  <th>คน</th>
                  <th>0</th>
                </tr>
                <tr>
                  <th>9</th>
                  <th>จำนวนบัณฑิตระดับปริญญาตรีที่เกณฑ์ทหาร</th>
                  <th>คน</th>
                  <th>0</th>
                </tr>
                <tr>
                  <th>10</th>
                  <th>ระดับความพึงพอใจในคุณลักษณะของบัณฑิตและผลการปฏิบัติงานของบัณฑิต</th>
                  <th>ค่าเฉลี่ย</th>
                  <th>22,286</th>
                </tr>
                <tr>
                  <th>11</th>
                  <th>ร้อยละของผู้ตอบแบบสำรวจเรื่องการมีงานทำ (อย่างน้อยร้อยละ 70)</th>
                  <th>ร้อยละ</th>
                  <th>95.65</th>
                </tr>
              </tbody>
            </table>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="สรุปผลการประเมินตนเององค์ประกอบที่ 2 บัณฑิต และองค์ประกอบที่ 3 นักศึกษา">
        {/***********************************************/}
        <div>
            <span>องค์ประกอบที่ 2 บัณฑิต</span><br/><br/>
            <span>ผลการประเมินตนเองตามองค์ประกอบ</span><br/><br/>

            <table>
              <thead>
                <tr>
                  <th>ตัวบ่งชี้ที่</th>
                  <th>ผลการดำเนินงาน</th>
                  <th>คะแนนการประเมินตนเอง</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <th>ตัวบ่งชี้ที่  2.1  คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ</th>
                  <th>4.50</th>
                  <th>4.50 คะแนน</th>
                </tr>
                <tr>
                  <th>ตัวบ่งชี้ที่  2.2  ร้อยละของบัณฑิตปริญญาตรีที่ได้งานทําหรือประกอบอาชีพอิสระภายใน 1 ปี</th>
                  <th>ร้อยละ 66.67</th>
                  <th>5.00 คะแนน</th>
                </tr>
                <tr>
                  <th>คะแนนเฉลี่ยผลการดำเนินงานองค์ประกอบที่ 2</th>
                  <th colSpan="2">4.75 คะแนน</th>
                </tr>
              </tbody>
            </table><br/><br/>

            <span>องค์ประกอบที่ 3  นักศึกษา</span><br/><br/>
            <span>ผลการประเมินตนเองตามองค์ประกอบ</span><br/><br/>

            <table>
              <thead>
                <tr>
                  <th>ตัวบ่งชี้ที่</th>
                  <th>ผลการดำเนินงาน</th>
                  <th>คะแนนการประเมินตนเอง</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <th>ตัวบ่งชี้ที่  3.1  การรับนักศึกษา</th>
                  <th>ระดับ 3</th>
                  <th>3 คะแนน</th>
                </tr>
                <tr>
                  <th>ตัวบ่งชี้ที่  3.2  การส่งเสริมและพัฒนานักศึกษา</th>
                  <th>ระดับ 2</th>
                  <th>2 คะแนน</th>
                </tr>
                <tr>
                  <th>ตัวบ่งชี้ที่  3.3  ผลที่เกิดกับนักศึกษา</th>
                  <th>ระดับ 2</th>
                  <th>2 คะแนน</th>
                </tr>
                <tr>
                  <th>คะแนนเฉลี่ยผลการดำเนินงานองค์ประกอบที่ 3</th>
                  <th colSpan="2">2.33 คะแนน</th>
                </tr>
              </tbody>
            </table><br/><br/>
            
            <span>การประเมินตนเองจากผลการดำเนินงาน</span><br/><br/>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>เป้าหมาย</th>
                <th className='TH'>ผลการดำเนินงาน</th>
                <th className='TH'>คะแนนการประเมินตนเอง</th>
                <th className='TH'>การบรรลุเป้าหมาย</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'>ร้อยละ 70</td>
                <td className='TD'>ร้อยละ 100</td>
                <td className='TD'>5.00</td>
                <td className='TD'>บรรลุ</td>
              </tr>
            </tbody>
          </table><br/><br/>

            <span>รายการหลักฐานอ้างอิง</span><br/><br/>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>รหัสเอกสาร</th>
                <th className='TH'>รายการเอกสารหลักฐาน</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'>B.ENG 2.2-1-02</td>
                <td className='TD'>รายงานสรุปภาวะการมีงานทำ ประจำปีการศึกษา 2564</td>
              </tr>
            </tbody>
          </table><br/><br/>

        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      </ScrollPanel>
    </div>
  )
}

export default TQF7_3