import React from 'react'

import { Panel } from 'primereact/panel'
import { InputTextarea } from 'primereact/inputtextarea' 
import { InputText } from 'primereact/inputtext'

function TQF7_2() {
  return (
    <div>
      <Panel header="การบริหารและพัฒนาอาจารย์ประจำหลักสูตร">
        {/***********************************************/}
        <div>
            <span>การรับและแต่งตั้งอาจารย์ประจําหลักสูตร</span>
            <InputTextarea autoResize value='{การรับและแต่งตั้งอาจารย์ประจําหลักสูตร}'/><br/><br/>
            <span>ผลการดําเนินงาน</span>
            <InputTextarea autoResize value='{ผลการดําเนินงาน.การรับและแต่งตั้งอาจารย์ประจําหลักสูตร}'/><br/><br/>
            <span>การประเมินกระบวนการ</span>
            <InputTextarea autoResize value='{การประเมินกระบวนการ.การรับและแต่งตั้งอาจารย์ประจําหลักสูตร}'/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span>
            <InputTextarea autoResize value='{การปรับปรุงกระบวนการ.การรับและแต่งตั้งอาจารย์ประจําหลักสูตร}'/><br/><br/>

        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="การบริหารอาจารย์ประจำหลักสูตร">
        {/***********************************************/}
        <div>
            <span>ระบบกลไก</span>
            <InputTextarea autoResize value='{ระบบกลไก.การบริหารอาจารย์ประจำหลักสูตร}'/><br/><br/>
            <span>ผลการดําเนินงาน</span>
            <InputTextarea autoResize value='{ผลการดำเนินงาน.การบริหารอาจารย์ประจำหลักสูตร}'/><br/><br/>
            <span>การประเมินกระบวนการ</span>
            <InputTextarea autoResize value='{การประเมินกระบวนการ.การบริหารอาจารย์ประจำหลักสูตร}'/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span>
            <InputTextarea autoResize value='{การปรับปรุงกระบวนการ.การบริหารอาจารย์ประจำหลักสูตร}'/><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="การส่งเสริมและพัฒนาอาจารย์ประจำหลักสูตร">
        {/***********************************************/}
        <div>
            <span>ระบบกลไก</span>
            <InputTextarea autoResize value='{ระบบกลไก.การส่งเสริมและพัฒนาอาจารย์ประจำหลักสูตร}'/><br/><br/>
            <span>ผลการดําเนินงาน</span>
            <InputTextarea autoResize value='{ผลการดำเนินงาน.การส่งเสริมและพัฒนาอาจารย์ประจำหลักสูตร}'/><br/><br/>
            <span>การประเมินกระบวนการ</span>
            <InputTextarea autoResize value='{การประเมินกระบวนการ.การส่งเสริมและพัฒนาอาจารย์ประจำหลักสูตร}'/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span>
            <InputTextarea autoResize value='{การปรับปรุงกระบวนการ.การส่งเสริมและพัฒนาอาจารย์ประจำหลักสูตร}'/><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="การประเมินตนเองจากผลการดำเนินงาน ">
        {/***********************************************/}
        <div>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง</span>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="รายการหลักฐานอ้างอิง ">
        {/***********************************************/}
        <div>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง</span>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก">
        {/***********************************************/}
        <div>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.ผลการดำเนินการ</span>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.รายการหลักฐานอ้างอิง</span>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ">
        {/***********************************************/}
        <div>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.ผลการดำเนินการ</span>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.รายการหลักฐานอ้างอิง</span>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร">
        {/***********************************************/}
        <div>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.ผลการดำเนินการ</span>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.ข้อมูลประกอบการคำนวณผลงานทางวิชาการของอาจารย์ประจําหลักสูตร</span>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.รายการหลักฐานอ้างอิง</span>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.ผลการดำเนินการในภาพรวม</span>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.การประเมินตนเองจากผลการดำเนินงาน</span>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="ผลที่เกิดกับอาจารย์ประจําหลักสูตร">
        {/***********************************************/}
        <div>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.ข้อมูลพื้นฐานประกอบผลการดำเนินงาน</span><br/><br/>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.ผลการดำเนินการ</span><br/><br/>
            <span>ความพึงพอใจของอาจารย์</span>
            <InputTextarea value='{ความพึงพอใจของอาจารย์}'/>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.การประเมินตนเองจากผลการดำเนินงาน</span>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.รายการหลักฐานอ้างอิง</span>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="สรุปผลการประเมินตนเอง">
        {/***********************************************/}
        <div>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.อาจารย์ประจำหลักสูตร</span>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      
    </div>
  )
}

export default TQF7_2
