import React, { useEffect, useState } from 'react'
import { ScrollPanel } from 'primereact/scrollpanel';
import { Panel } from 'primereact/panel'
import { InputTextarea } from 'primereact/inputtextarea'
import { InputText } from 'primereact/inputtext';
import { Button } from 'primereact/button';
import axios from 'axios';
import * as XLSX from 'xlsx';
import IconButton from '@mui/material/IconButton';
import CloudUploadIcon from '@mui/icons-material/CloudUpload';

function TQF7_3() {

  const [percentage1, setPercentage1] = useState(0);
  const [percentage2, setPercentage2] = useState(0);
  const [percentage3, setPercentage3] = useState(0);
  const [percentage4, setPercentage4] = useState(0);
  const [percentage5, setPercentage5] = useState(0);
  const [percentage6, setPercentage6] = useState(0);

  const [dataTqf7_3, setDateTqf7_3] = useState({

    หัวใหญ่ : "ปีการศึกษาที่รับเข้า(ตั้งแต่ปีการศึกษาที่เริ่มใช้หลักสูตร)",
    หัว1 : "2559",
    หัว2 : "2560",
    หัว3 : "2561",
    หัว4 : "2562",
    หัว5 : "2563",
    หัว6 : "2564",
    ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_1 : "2559",
    ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_2 : "2560",
    ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_3 : "2561",
    ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_4 : "2562",
    ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_5 : "2563",
    ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_6 : "2564",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_1 : "62",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_2 : "40",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_3 : "36",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_4 : "37",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_5 : "26",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_6 : "12",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_1 : "",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_2 : "40",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_3 : "37",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_4 : "31",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_5 : "31",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_6 : "18",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_1 : "",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_2 : "",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_3 : "40",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_4 : "37",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_5 : "36",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_6 : "35",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_1 : "",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_2 : "",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_3 : "",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_4 : "27",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_5 : "25",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_6 : "24",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_1 : "",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_2 : "",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_3 : "",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_4 : "",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_5 : "39",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_6 : "33",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_1 : "",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_2 : "",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_3 : "",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_4 : "",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_5 : "",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_6 : "37",
    ปัจจัยที่มีผลกระทบต่อจำนวนนักศึกษา_นักศึกษาและบัณฑิต :  "1. นักศึกษาบางคนมอบตัวเข้าศึกษา มีรายชื่อในระบบทะเบียน แต่ไม่ได้เข้าชั้นเรียน เนื่องจากย้าย สถานศึกษาตั้งแต่ยังไม่เปิดการศึกษา \n2. นักศึกษาแรกเข้าไม่มีความรู้เบื้องต้นในสาขาวิชาที่เลือกเรียน จึงไม่สามารถปรับตัวเข้ากับการเรียนการ สอนที่เกี่ยวกับสาขาวิชาได้ \n3. นักศึกษาบางคนประสบปัญหาทางบ้าน ทําให้ต้องพักการเรียน หรือต้องทํางานด้วย เรียนด้วย \n4. อัตราการแข่งขันของสถาบันการศึกษาทั้งภาครัฐและภาคเอกชน ส่งผลให้มีจํานวนนักศึกษาแรกเข้าน้อยลง เนื่องจากผู้เรียนสามารถเลือกเรียนกับสถาบันการศึกษาในพื้นที่อยู่อาศัย เพื่อลดค่าใช้จ่ายในการเดินทางและ การเรียน \n5. จํานวนค่าใช้จ่ายในการชําระค่ามอบตัวเพิ่มขึ้น ส่งผลให้ผู้ปกครองของนักศึกษาบางคนไม่สามารถหาเงิน มาชําระได้ตามกําหนดเวลา เนื่องจากสภาพเศรษฐกิจ \n6. ปัญหาวิกฤติประชากรในวัยเรียนลดลง" ,
    การรับนักศึกษา_การรับนักศึกษา : " สาขาวิชาวางแนวทางเพื่อผลิตบัณฑิตในวิชาชีพด้านวิศวกรรมคอมพิวเตอร์ ที่มีความรู้ใน การผลิตงานที่มีมาตรฐานเพียบพร้อมไปด้วย คุณธรรม จริยธรรม สามารถสร้างองค์ความรู้ความสามารถทางด้านการ ออกแบบ สามารถวางแผนและปฏิบัติงานวิชาชีพด้านการออกแบบได้อย่างเหมาะสม ตลอดจนเป็นศูนย์กลางรวบรวม ข้อมูล วิจัยและพัฒนา พร้อมทั้งให้การบริการวิชาการด้านการออกแบบแก่ชุมชน เพื่อสร้างความแข็งแกร่งและความ เจริญให้แก่ท้องถิ่นจนเป็นรากฐานที่สําคัญ  และสร้างสรรค์พัฒนาความรู้ด้านการออกแบบเพื่อการพัฒนาที่ยั่งยืน หลักสูตรมีการกําหนดคุณสมบัติของผู้สมัครที่ต้องการไว้ใน มคอ.2 และมีแผนรับนักศึกษาปีละ 80 คน โดยการ รับนักศึกษา เป็นไปตามข้อบังคับสภามหาวิทยาลัยราชภัฏสวนสุนันทา ว่าด้วยการศึกษาระดับปริญญาตรี พ.ศ.2551  หมวด 1 ข้อ 6",
    ระบบกลไก_การรับนักศึกษา : " หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ กําหนดให้มีการจัดสอบปฏิบัติจากการรับตรงจากผู้สําเร็จการศึกษามัธยมปลาย โดยการกําหนดหัวข้อในการสอบปฏิบัติ และสาขาได้มีการ ประชุมหารือทุกปีการศึกษา เพื่อกําหนดหัวข้อให้สอดคล้องกับสภาวการณ์ปัจจุบัน โดยสาขาวิชามีระบบ กลไกและ กระบวนการในการคัดเลือกนักศึกษา  ดังนี้ \n1. สาขาวิชาประชุม วางแผน กําหนดเกณฑ์ คุณสมบัติ จํานวนรับและกระบวนการรับนักศึกษา ที่สอดคล้อง กับมคอ.2 กับฝ่ายวิชาการของคณะ และมหาวิทยาลัย เพื่อดําเนินการประกาศรับสมัคร \n2. สาขาวิชาประชุมวางแผนร่วมกับฝ่ายประชาสัมพันธ์ของคณะ เพื่อกําหนดแนวทาง สถานที่ ระยะเวลา และ รูปแบบการประชาสัมพันธ์การรับสมัครนักศึกษา \n3. ประธานหลักสูตร และฝ่ายวิชาการคณะ พิจารณาคัดเลือกกรรมการสอบคัดเลือก ในระบบ TCAS \n4. ส่งรายชื่อกรรมการสอบไปยังฝ่ายวิชาการมหาวิทยาลัย เพื่อออกคําสั่งแต่งตั้งกรรมการสอบคัดเลือก \n5. ดําเนินการจัดสอบ ตามข้อบังคับสภามหาวิทยาลัยราชภัฏสวนสุนันทา ทั้ง 5 รอบของระบบ TCAS คือ  \nรอบที่ 1 : การรับด้วยแฟ้มสะสมผลงาน (Portfolio) โดยไม่มีการสอบข้อเขียน  \nรอบที่ 2 : การรับแบบโควตา  \nรอบที่ 3 : การรับตรงร่วมกัน  \nรอบที่ 4 : การรับแบบ Admission  \nรอบที่ 5 : การรับตรงแบบอิสระ \n6. สาขาวิชาประชุมร่วมกับอาจารย์ประจําหลักสูตรเพื่อประมวลผลการสอบ และแจ้งผลไปยังฝ่ายวิชาการของ คณะ และมหาวิทยาลัย เพื่อประกาศผู้ผ่านการสอบผ่านเว็บไซต์ของมหาวิทยาลัย \n7. นักศึกษารายงานตัว และชําระเงินลงทะเบียน \n8. สาขาวิชาจัดปฐมนิเทศนักศึกษาให้กับนักศึกษาใหม่ พร้อมเชิญผู้ปกครอง โดยช่วงเช้าจะเป็นภาพรวมของมหาวิทยาลัยและคณะ ส่วนช่วงบ่ายเป็นของสาขาวิชา เพื่อแนะนํานักศึกษาเกี่ยวกับโครงสร้างหลักสูตร แนะนํา อาจารย์ การปฏิบัติตัวของนักศึกษา กฎระเบียบ และแจ้งกําหนดการการเข้าร่วมโครงการปรับพื้นฐานเพื่อเตรียม ความพร้อมของผู้เรียน \n9. สาขาวิชาพิจารณาผลการรับนักศึกษา ประเมินผล และวิเคราะห์สาเหตุในกระบวนการรับนักศึกษา เพื่อ ปรับปรุงกระบวนการ ",
    ผลการดำเนินงาน_การรับนักศึกษา : " เนื่องด้วยเกิดวิกฤติประชากรในวัยเรียนลดลงทาง สาขาได้จัดทำโครงการประชาสัมพันธ์เข้าศึกษาต่อสาขาวิศวกรรมคอมพิวเตอร์ ในช่วงเวลาในการรับสมัครรอบที่ 1-4 โดยประชาสัมพันธ์เชิงรุกผ่าน Social media โดยเฉพาะทาง Facebook \nการรับนักศึกษาในปี 2564 สาขาวิชามีขั้นตอนและกระบวนการในการรับนักศึกษา ที่ปรับปรุงจากการ ประเมินผลในปีที่ผ่านมาโดยยึดตามรูปแบบของมหาวิทยาลัยกําหนด และมีการดําเนินการบริหารจัดการภายใน สาขาวิชาเพื่อให้มีความสอดคล้องและเหมาะสม โดยมีกระบวนการดังนี้  \n1. สาขาวิชาประชุม วางแผน กําหนดเกณฑ์ คุณสมบัติ จํานวนรับ 40 คน เพื่อให้สอดคล้องกับสถานการณ์ และกระบวนการรับ นักศึกษา ที่สอดคล้องกับ มคอ.2 กับฝ่ายวิชาการของคณะ และมหาวิทยาลัย เพื่อดําเนินการประกาศรับสมัคร โดยมี ผลการดําเนินงาน ดังตาราง \n2. สาขาวิชาประชุมวางแผนร่วมกับฝ่ายประชาสัมพันธ์ของคณะ เพื่อกําหนดแนวทาง สถานที่ ระยะเวลา และรูปแบบการประชาสัมพันธ์การรับสมัครนักศึกษา  \n3. ประธานหลักสูตร และฝ่ายวิชาการคณะ พิจารณาคัดเลือกกรรมการสอบคัดเลือก ในการรับนักศึกษา ระบบ TCAS  \n4. ส่งรายชื่อกรรมการสอบไปยังฝ่ายวิชาการมหาวิทยาลัย เพื่อออกคําสั่งแต่งตั้งกรรมการสอบคัดเลือก ได้แก่ อาจารย์ ดร.เศรษฐกาล โปร่งนุช และผู้ช่วยศาสตราจารย์ขวัญเรือน รัศมี (สอบสัมภาษณ์) \n5. ดําเนินการจัดสอบ ตามข้อบังคับสภามหาวิทยาลัยราชภัฏสวนสุนันทา ได้มีการจัดสอบทั้ง 5 รอบของระบบ TCAS คือ  \nรอบที่  1 Portfolio การรับด้วยแฟ้มสะสมผลงาน (Portfolio) โดยไม่มีการสอบข้อเขียน โดยผู้สนใจเข้าศึกษาสามารถสมัครผ่านมหาวิทยาลัย เปิดรับสมัครผ่านทาง Internet ทางเว็บไซต์ที่ admission.ssru.ac.th \nรอบที่  2 โควตา การรับแบบโควตาที่มีการสอบปฏิบัติและข้อเขียน โดยผู้สนใจเข้าศึกษาสามารถสมัครผ่านมหาวิทยาลัย เปิดรับสมัครผ่านทาง Internet ทางเว็บไซต์ที่ admission.ssru.ac.th  \nรอบที่  3 Admission การรับตรงร่วมกัน โดยผู้สนใจเข้าศึกษาสามารถสมัครผ่าน  ทปอ. (ที่ประชุมอธิการบดีแห่งประเทศไทย) หลังจากนั้นจะส่งข้อมูลผู้สมัครไปให้มหาวิทยาลัยเป็นผู้ประมวลคัดเลือก \nเปิดรับสมัครผ่านทาง Internet ทางเว็บไซต์ที่ http://tcas.cupt.net  \nรอบที่  4 รับตรงอิสระ โดยผู้สนใจเข้าศึกษาสามารถสมัครผ่าน  ทปอ. (ที่ประชุมอธิการบดีแห่งประเทศไทย) เปิดรับสมัครผ่านทาง Internet ทางเว็บไซต์ที่ http://tcas.cupt.net  \nรอบที่  5 รับตรงอิสระ (เพิ่มเติม)  โดยผู้สนใจเข้าศึกษาสามารถสมัครสอบได้ตามความต้องการ โดยที่แต่ละมหาวิทยาลัยจะรับตรงด้วยวิธีการของมหาวิทยาลัยเอง \n6. สาขาวิชาประชุมร่วมกับอาจารย์ประจําหลักสูตรเพื่อประมวลผลการสอบ และส่งรายชื่อผู้ผ่านเกณฑ์ให้ ฝ่ายวิชาการของคณะ ได้ดำเนินการส่งรายชื่อเป็นจํานวน 40 คน ให้กับฝ่ายวิชาการมหาวิทยาลัย เพื่อประกาศรายชื่อผู้ผ่านเกณฑ์เข้าศึกษา ผ่านเว็บไซต์ของมหาวิทยาลัย \n7. นักศึกษารายงานตัว และชําระเงินลงทะเบียน มีจำนวน 40 คน  \n8. สาขาวิชาจัดปฐมนิเทศนักศึกษาให้กับนักศึกษาใหม่ ของมหาวิทยาลัยและคณะ ส่วนช่วงบ่ายเป็นของสาขาวิชา เพื่อแนะนํานักศึกษาเกี่ยวกับโครงสร้างหลักสูตร แนะนําอาจารย์ การปฏิบัติตัวของนักศึกษา กฎระเบียบ และแจ้งกําหนดการการเข้าร่วมโครงการปรับพื้นฐานเพื่อเตรียม ความพร้อมของผู้เรียน \n9. สาขาวิชาพิจารณาผลการรับนักศึกษา พบว่า จํานวนนักศึกษาที่มาสมัครในแต่ละรอบ พบว่าในการรับสมัครก็ยังมีรอบที่จำนวนผู้สมัครน้อยกว่าแผนที่ทำการรับเป็นจำนวนมาก เมื่อถึงขั้นตอนการยืนยันสิทธ์ จำนวนนักศึกษาที่ยืนยันสิทธก็มีจำนวนน้อยลงไป และเมื่อถึงขั้นตอนของการมอบตัวจำนวนนักศึกษาที่มอบตัวจริงๆ จำนวนนักศึกษายังน้อยลงไปอีก ทำให้จำนวนนักศึกษาที่สาขาวิชาได้ น้อยกว่าจำนวนที่วางแผนไว้เป็นจำนวนมาก จากประเมินผลและวิเคราะห์สาเหตุในกระบวนการรับนักศึกษา พบว่า  \n1. การวางแผนในการแนะแนว และการประชาสัมพันธ์ที่คลาดเคลื่อนกับระยะเวลาการรับสมัครที่มีการปรับเปลี่ยน จึงทําให้ไม่สามารถประชาสัมพันธ์ ไปถึงนักเรียนกลุ่มเป้าหมายได้ทัน \n2. ควรมีการเพิ่มช่องทางประชาสัมพันธ์ที่เหมาะและเข้าถึงนักศึกษาได้ดีขึ้น เช่น ช่องทางประชาสัมพันธ์ online  Social media ต่างๆ \n3. การประชาสัมพันธ์อาจต้องเพิ่มความสำคัญมุ่งเน้นไปที่ รอบ 1 2 และ 4 ซึ่งเป็นรอบที่ ทำการรับนักศึกษาที่สนใจตรงมายังสาขาโดยตรง โดยมีข้อสังเกตจากจำนวนของผู้ที่รายงานตัว มีจำนวนใกล้เคียงกับผู้ที่มารายงานตัวเข้าศึกษาจริงๆ",
    การประเมินกระบวนการ_การรับนักศึกษา : "สาขาวิชาพิจารณาผลการรับนักศึกษา ประเมินผล และวิเคราะห์สาเหตุในกระบวนการรับนักศึกษา เพื่อ ปรับปรุงกระบวนการ พบว่า ต้องมีการปรับปรุงแผนการแนะแนวและการประชาสัมพันธ์ ให้มีความสอดคล้องกับ ระบบการรับนักศึกษาที่ปรับเปลี่ยน และออกประชาสัมพันธ์ต่อสถานศึกษาให้มากขึ้น และจัดทําแผนการ ประชาสัมพันธ์ลงสู่สถาบันการศึกษาที่สอนทางสายวิชาชีพมากขึ้น เพื่อให้ได้นักศึกษาเป็นไปตามแผนที่วางไว้",
    การปรับปรุงกระบวนการ_การรับนักศึกษา : "ทางสาขาวิชาพิจารณาผลการรับนักศึกษา ประเมินผล และวิเคราะห์สาเหตุในกระบวนการรับนักศึกษา เพื่อ ปรับปรุงกระบวนการ  พบว่าการรับนักศึกษาในบางรอบจะมีระยะเวลาในการประชาสัมพันธ์ที่กระชั้นชิดมากเกินไป และอาจมีสาเหตุจากการที่ทางสาขาวิชายังไม่เป็นที่รูัจักแพร่หลายในสถานศึกษาระดับชั้นมัธยมศึกษาโดยทั่วไป จึงควรมีการปรับกระบวนการเพื่อให้ได้จำนวนนักศึกษาตรงกับเป้าหมาย ดังนี้ \n1 ต้องมีการปรับปรุงแผนการแนะแนวและการประชาสัมพันธ์ ให้มีความสอดคล้องกับ กำหนดเวลาของการรับสมัครในแต่ละรอบ และ ระบบการรับนักศึกษาที่ปรับเปลี่ยนไปให้ทัน  \n2 เพิ่มการประชาสัมพันธ์ให้เป็นที่รู้จักต่อสถานศึกษาทั้งระดับมัธยมปลายทั้งสายวิทย์และศิลป์  โดยเพิ่มความเข้าใจ และความมั่นใจในสายการเรียนที่ไม่ใช่สายวิทย์คณิตให้เข้าใจว่าสามรถเรียนต่อในสาขานี้ได้ \n3 ควรมีการจัดทําแผนการประชาสัมพันธ์ลงสู่สถาบันการศึกษาที่สอนทางสายวิชาชีพมากขึ้น  \n4 เพิ่มช่องทางในการประชาสัมพันธ์ผ่าน Social media ให้มากยิ่งขึ้น เนื่องจากก่อนหน้ามีการเน้นไปที่ Facebook ซึ่งเป็นสื่อสังคมออนไลน์ที่มีปริมาณผู้ใช้มาก แต่ปัจจุบันนักเรียน นักศึกษามีการใช้งาน Instagram Twitter กันมากขึ้น หรือกระทั่งอาจจะต้องมีการประชาสัมพันธ์ผ่าน Google ให้มีนักเรียน นักศึกษา รู้จักสาขาวิชามากยิ่งขึ้น  ",

    ระบบกลไก_การเตรียมความพร้อมก่อนเข้าศึกษา : "การเตรียมความพร้อมก่อนเข้าศึกษาของหลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ มีระบบกลไก ดังนี้  \n1. สาขาวิชาประชุมเพื่อวางแผนการเตรียมความพร้อมก่อนเข้าศึกษาให้กับนักศึกษา และกําหนดและแต่งตั้ง อาจารย์ที่ปรึกษา \n2. สาขาวิชากําหนดแผนโครงการในการเตรียมความพร้อมให้กับนักศึกษา เสนอต่อคณะ \n3. ดําเนินการตามแผนโครงการเพื่อเตรียมความพร้อมให้กับนักศึกษา \n4. สาขาวิชาประเมินผล และวิเคราะห์กระบวนการการเตรียมความพร้อมก่อนเข้าศึกษาของนักศึกษา เพื่อปรับปรุงแก้ไขกระบวนการ",
    ผลการดำเนินงาน_การเตรียมความพร้อมก่อนเข้าศึกษา : "1. สาขาวิชาประชุมเพื่อวางแผนการเตรียมความพร้อมก่อนเข้าศึกษาให้กับนักศึกษา พบว่านักศึกษาใหม่มีความหลากหลาย ซึ่งเกิดจากการรับนักศึกษาจากทั้งสายวิทย์และสายศิลป์ ทำให้นักศึกษามีพื้นความรู้ทางด้านเทคโนโลยีไม่เท่ากัน โดยเฉพาะทางด้านการเขียนโปรแกรมเบื้องต้น จึงได้มีการจัดให้มีการเรียนปรับพืนฐานในส่วนของการเขียนโปรแกรมเบื้องต้นให้กับผู้เรียนก่อนเปิดภาคเรียน โดยมี ผศ.ขวัญเรือน รัศมี เป็นผู้รับผิดชอบดําเนินโครงการปรับพื้นฐานการเขียนโปรแกรมเบื้องต้น  \n2. กําหนดอาจารย์ที่ปรึกษาตามหลักเกณฑ์ คือ เป็นอาจารย์ประจําหลักสูตร หรืออาจารย์ผู้สอนในหลักสูตรและปัจจุบันไม่ได้ทําหน้าที่เป็นที่อาจารย์ที่ปรึกษาของนักศึกษาชั้นปีที่ 2 – 4 คือ ผศ.ดร.รวิ อุตตมธนินทร์ เป็นอาจารย์ที่ปรึกษา  \n3. สาขาวิชากําหนดแผนโครงการในการเตรียมความพร้อมให้กับนักศึกษา 1 โครงการ ได้แก่ โครงการปฐมนิเทศนักศึกษา \n4. ดําเนินการตามแผนโครงการการจัดปฐมนิเทศนักศึกษาให้กับนักศึกษาใหม่ โดยช่วง เช้าจะเป็นภาพรวมของมหาวิทยาลัยและคณะ  ส่วนช่วงบ่ายเป็นของสาขาวิชา เพื่อแนะนํานักศึกษาเกี่ยวกับ โครงสร้างหลักสูตร แนะนําอาจารย์ การปฏิบัติตัวของนักศึกษา กฎระเบียบ และนักศึกษาเข้าร่วมโครงการปรับ พื้นฐานก่อนเปิดภาคเรียน และเนื่องจากอยู่ในภาวะการระบาดของโรคโควิด-19 ทำให้ต้องจัดการปฐมนิเทศในรูปแบบ online ด้วย",
		การประเมินกระบวนการ_การเตรียมความพร้อมก่อนเข้าศึกษา : "สาขาวิชาประเมินผล และวิเคราะห์กระบวนการการเตรียมความพร้อมก่อนเข้าศึกษาของนักศึกษา เพื่อ ปรับปรุงแก้ไขกระบวนการในปีการศึกษา 2564 พบว่า การกําหนดแผนโครงการเขียนโปรแกรมเบื้องต้นมีประโยชน์ต่อนักศึกษาในชั้นปีที่ 1",
		การปรับปรุงกระบวนการ_การเตรียมความพร้อมก่อนเข้าศึกษา : "ในปีการศึกษา 2564 คาดว่ายังคงจะเกิดสถานการโรคระบาดโควิด-19 ต่อไปทำให้ทางสาขาวิชามีการประชุมหารือ เพื่อกำหนดแนวทางแก้ไข และได้จัดเตรียมสำหรับการสอน online ทำให้ไม่สามารถใช้สถานที่ในมหาวิทยาลัยสำหรับจัดการเรียนการสอนได้ ทางสาขาวิชาจึงมีแนวทางร่วมกับทางคณะโดยเน้นไปที่การจัดการเรียนการสอนในแบบ online ซึ่งทางสาขาวิชามีการประชุมหารือ เพื่อกําหนดแนวทางแก้ไข และปรับปรุงกระบวนการเตรียมความพร้อม เพื่อให้บรรลุตามเป้าหมายที่หลักสูตรกําหนดในปีการศึกษาถัดไป (2564) โดยมีระบบ กลไกและกระบวนการในการ เตรียมความพร้อมก่อนเข้าศึกษา ใหม่ ดังนี้ \n1. สาขาวิชาตรวจสอบปฏิทินวิชาการ และกิจกรรมของมหาวิทยาลัย ก่อนการวางแผนเตรียมความพร้อมก่อนเข้าศึกษา  \n2. สาขาวิชาวางแผนการดําเนินโครงการการเตรียมความพร้อมก่อนเข้าศึกษาให้กับนักศึกษา และกําหนด และคัดเลือกอาจารย์ที่ปรึกษาตามหลักเกณฑ์ เพื่อเสนอต่อคณะ  \n3.ดําเนินการตามแผนการดําเนินโครงการการเตรียมความพร้อมก่อนเข้าศึกษาให้กับนักศึกษา และแต่งตั้ง อาจารย์ที่ปรึกษา \n4. ประเมินผลโครงการการเตรียมความพร้อมก่อนเข้าศึกษา และประเมินผลการทํางานของอาจารย์ที่ปรึกษา \n5. สาขาวิชาประเมินผล และวิเคราะห์กระบวนการการเตรียมความพร้อมก่อนเข้าศึกษาของนักศึกษา เพื่อปรับปรุงแก้ไขกระบวนการ ",

    เป้าหมาย_การประเมินตนเองจากผลการดำเนินงาน_การเตรียมความพร้อมก่อนเข้าศึกษา : "ระดับ 3",
    ผลการดำเนินงาน_การประเมินตนเองจากผลการดำเนินงาน_การเตรียมความพร้อมก่อนเข้าศึกษา : "3",
    คะแนนการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน_การเตรียมความพร้อมก่อนเข้าศึกษา : "3",
    การบรรลุเป้าหมาย_การประเมินตนเองจากผลการดำเนินงาน_การเตรียมความพร้อมก่อนเข้าศึกษา : "บรรลุ",
    
    รหัสเอกสาร_รายการหลักฐานอ้างอิง_การเตรียมความพร้อมก่อนเข้าศึกษา_1 : "B.ENG 3.1-2-01",
    รหัสเอกสาร_รายการเอกสารหลักฐาน_การเตรียมความพร้อมก่อนเข้าศึกษา_1 : "โครงการปรับพื้นฐาน",
    รหัสเอกสาร_รายการหลักฐานอ้างอิง_การเตรียมความพร้อมก่อนเข้าศึกษา_2 : "B.ENG 3.1-2-02",
    รหัสเอกสาร_รายการเอกสารหลักฐาน_การเตรียมความพร้อมก่อนเข้าศึกษา_2 : "คําสั่งแต่งตั้งอาจารย์ที่ปรึกษา",

    การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี_การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี : "หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ มีระบบกลไกในการ ส่งเสริมและพัฒนานักศึกษา ดังนี้  \n1. สาขาวิชา หรือคณะกรรมการบริหารหลักสูตรประชุม เพื่อพิจารณารายชื่ออาจารย์ที่ปรึกษาสําหรับนักศึกษา จากนั้นส่งรายชื่ออาจารย์ที่ปรึกษาไปยังฝ่ายวิชาการและงานทะเบียนของมหาวิทยาลัย เพื่อแจ้งในระบบ สารสนเทศของมหาวิทยาลัย  \n2. คณะดําเนินการแต่งตั้งอาจารย์ที่ปรึกษาวิชาการ และแนะแนวแก่นักศึกษาปริญญาตรี และแจกคู่มือ อาจารย์ที่ปรึกษาให้กับอาจารย์ทุกท่าน  \n3. สาขาวิชา และคณะ จัดเวลาให้อาจารย์ที่ปรึกษาพบนักศึกษา เพื่อแนะแนวนักศึกษาปริญญาตรี ทั้งด้านการ เรียน ทั้งด้านวิชาการและการใช้ชีวิตในมหาวิทยาลัย รวมถึงการเตรียมความพร้อมด้านอื่นๆ และการจัดอบรมวิธีการ ลงทะเบียนด้วยตนเอง (Free Enrollment) รวมทั้งวางแผนการดําเนินงานด้านการพัฒนาความรู้พื้นฐาน หรือการเตรียม ความพร้อมทางการเรียนให้แก่นักศึกษา ร่วมกัน  \n4. ติดตามสถานภาพนักศึกษาทุกภาคการศึกษา และประเมินความพึงพอใจของนักศึกษาในการควบคุมการ ดูแลการให้คําปรึกษาวิชาการและแนะแนว  \n5. สาขาวิชา ทบทวนแผนการดําเนินงานด้านการพัฒนาความรู้พื้นฐาน หรือการเตรียมความพร้อมทางการ เรียนให้แก่นักศึกษาทุกปีเพื่อประเมินการดําเนินงาน และวางแนวทางปรับปรุงแก้ไขในปีการศึกษาถัดไป \n6. ส่งเสริมกิจกรรมด้านกีฬา \n7. สาขาวิชาดำเนินกิจกรรมทางวิชาการในระดับสูง ด้วยการจดอนุสิทธิบัตรร่วมกันระหว่างอาจารย์ และนักศึกษา \n8. สาขาวิชาดำเนินกิจกรรมทางวิชาการในระดับสูง ด้วยการพัฒนาบทความทางวิชาการร่วมกันระหว่างอาจารย์ และนักศึกษา \n9. สาขาวิชาดำเนินกิจกรรมทางวิชาการในระดับสูง ด้วยการทำ workshop ระดับนานาชาติร่วมกับมหาวิทยาลัยชิบะ ประเทศญี่ปุ่น ",

    ผลดำเนินการ_การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี : "การควบคุมการดูแลการให้คําปรึกษาวิชาการ และแนะแนวแก่นักศึกษาในระดับปริญญาตรี สาขาวิชามีการ ประชุมและวางแผนการดําเนินงานในปีการศึกษา 2564 โดยมีการดําเนินงานดังนี้  \n 1. สาขาวิชา พิจารณารายชื่ออาจารย์ที่ปรึกษาสําหรับนักศึกษาชั้นปีที่ 1 ปีการศึกษา 2564 จากนั้นส่งรายชื่อ อาจารย์ที่ปรึกษาไปยังฝ่ายวิชาการและงานทะเบียนของมหาวิทยาลัย เพื่อแจ้งในระบบสารสนเทศของมหาวิทยาลัยโดย การกําหนดเป็นอาจารย์ประจําหลักสูตร หรืออาจารย์ผู้สอนในหลักสูตร และปัจจุบันไม่ได้ทําหน้าที่เป็นที่อาจารย์ที่ปรึกษาของนักศึกษาชั้นปีที่ 2 – 4 ซึ่งได้แก่ ผศ ดร รวิ อุตตมธนินทร์  B.ENG 3.1-2-01  \n 2. คณะดําเนินการแต่งตั้ง ผศ.ดร รวิ อุตตมธนินทร์ เป็นอาจารย์ที่ปรึกษาวิชาการ และแนะแนว แก่นักศึกษาปริญญาตรีชั้นปีที่ 1 ปีการศึกษา 2564 และแจกคู่มืออาจารย์ที่ปรึกษาให้กับอาจารย์ \n 3. สาขาวิชาดําเนินงาน ดังนี้ \n 3.1 สาขาวิชา และคณะจัดให้มีการจัดบริการให้คําปรึกษาแก่นักศึกษาทางวิชาการและวิชาชีพ  และแนะแนวการใช้ชีวิตแก่นักศึกษา  แบบ online เพื่อแนะนําการ ลงทะเบียนด้วยตนเอง (Free Enrollment)  และสถานที่พบอาจารย์ที่ปรึกษา เพื่อการแลกเปลี่ยนข้อมูล การแก้ไขปัญหา ทางด้านการเรียน หรือต้องการความช่วยเหลือด้านอื่นๆ เช่น การจัดปฐมนิเทศนักศึกษาใหม่ การจัดปัจฉิมนิเทศนักศึกษา ฝึกประสบการณ์วิชาชีพ เป็นต้น และอาจารย์ที่ปรึกษามีช่องทางในการสื่อสารกับนักศึกษาหลากหลาย เช่น Facebook Line และ Email นอกจากนี้ยังจัดให้มีเจ้าหน้าที่รับผิดชอบในการปฏิบัติหน้าที่ให้คําปรึกษาแก่นักศึกษา  \n 3.2 สาขาวิชาวางแผนและการดําเนินงานด้านการพัฒนาความรู้พื้นฐาน หรือการเตรียมความพร้อมทางการเรียนให้แก่นักศึกษา ร่วมกันกับคณะ \n 4. อาจารย์ประจําหลักสูตรติดตามสถานภาพนักศึกษาทุกชั้นปี และทุกภาคการศึกษา เพื่อประเมินความพึงพอใจของนักศึกษาในการควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนว  \n     ปี 2564 นี้ อ แต่ละท่านได้ผล อยู่ในช่วง ค่าเฉลี่ย 3.50 – 4.49 หมายความว่า มีระดับความพึงพอใจมาก \n 5. สาขาวิชาดำเนินกิจกรรมทางวิชาการในระดับสูง ด้วยการจดอนุสิทธิบัตรร่วมกันระหว่างอาจารย์ และนักศึกษา ในปี 2564 นี้ มีการดำเนินการจดอนุสิทธิบัตร จำนวน 4 เรื่อง \n     -เครื่องต้นแบบเพื่อการเรียนรู้อักษรเบลสำหรับผู้พิการทางสายตา \n     -เครื่องแจ้งเตือนการรับผู้สูงอายุ \n     -ระบบแจ้งเตือนอุบัติเหตุสำหรับผู้สูงอายุภายในบ้าน \n     -ตู้ต้นแบบขนาดเล็กสำหรับการดูแลต้นสตอเบอรี่ควบคุมผ่านเว็บแอปพลิเคชัน \n 6. สาขาวิชาดำเนินกิจกรรมทางวิชาการในระดับสูง ด้วยการพัฒนาบทความทางวิชาการร่วมกันระหว่างอาจารย์ และนักศึกษา 	จำนวน 6 เรื่อง",
    การประเมินกระบวนการ_การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี : "สาขาประชุมหารือ เพื่อประเมินผลการดําเนินงานทั้งหมดในปีการศึกษา 2564 พบว่า ไม่พบปัญหาในระบบกลไกการควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี ดังนั้นสาขาวิชาเสนอให้ใช้ระบบ กลไกการควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี รูปแบบเดิม ในปีการศึกษา 2564",
    การปรับปรุงกระบวนการ_การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี : "สาขาวิชาเสนอให้ใช้ระบบกลไกการควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรีรูปแบบเดิม ในปีการศึกษา 2564",

    ระบบกลไก_กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่21 : "หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ มีระบบกลไกด้านกิจกรรมการพัฒนาศักยภาพของนักศึกษาและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21 ดังนี้  \n1. สาขาวิชาประชุม วางแผนการดําเนินงานกิจกรรมพัฒนาศักยภาพของนักศึกษาทั้งหมดในปีการศึกษา  ทั้ง ทางด้านงบประมาณและกิจกรรม ร่วมกับคณะ  \n2. สาขาวิชาเสนอแผนการดําเนินงานกิจกรรมพัฒนาศักยภาพของนักศึกษาและการเสริมสร้างทักษะการ เรียนรู้ในศตวรรษที่ 21 ทั้งหมดในปีการศึกษา  ทั้งทางด้านงบประมาณและกิจกรรม แก่คณะ \n3. ดําเนินกิจกรรมการพัฒนาศักยภาพของนักศึกษาตามแผนงานตามไตรมาศ \n4. ประเมินโครงการกิจกรรมการพัฒนาศักยภาพของนักศึกษา ทุกโครงการ เพื่อสรุปผลรายงานต่อคณะ \n5. สาขาวิชาทบทวน และประเมินผลการดําเนินกิจกรรมการพัฒนาศักยภาพของนักศึกษาและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21 เพื่อนําไปปรับปรุงแก้ไข",
    ผลดำเนินการ_กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่21 : "กิจกรรมการพัฒนาศักยภาพของนักศึกษาและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21 ในปีการศึกษา 2564 มีผลการดําเนินงาน ดังนี้ \n1. สาขาวิชาประชุม วางแผนการดําเนินงานกิจกรรมพัฒนาศักยภาพของนักศึกษาทั้งหมดในปีการศึกษา  ทั้ง ทางด้านงบประมาณและกิจกรรม โดยแบ่งการดําเนินงานเป็นไปตามไตรมาศ \n2. สาขาวิชาเสนอแผนการดําเนินงานกิจกรรมพัฒนาศักยภาพของนักศึกษาและการเสริมสร้างทักษะการ เรียนรู้ในศตวรรษที่ 21 ในปีการศึกษา 2564  ทั้งทางด้านงบประมาณและกิจกรรม แก่คณะ เพื่อขออนุมัติงบประมาณ และโครงการ \n3. ในปีการศึกษานี้ เป็นการเรียนการสอนแบบ online ดังนั้น จึงได้ งด การจัดกิจกรรมของสาขา โดยใช้กิจกรรมที่ทางมหาวิทยาลัยจัดแบบ online ร่วมกันให้ นศ.",
    การประเมินกระบวนการ_กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่21 : "ในปีการศึกษา 2564 นี้ ทางสาขางดการจัดกิจกรรม เพราะ ยังคงเป็นการเรียนแบบ online ทําให้การดําเนินโครงการไม่บรรลุ แต่ก็มีกิจกรรมจากทางคณะและทางมหาวิทยาลัยจัดให้กับ นศ อยู่บ้าง ดังนั้นสาขาวิชาจึงขอปรับกระบวนการ และดูสถานการต่อไปก่อนสำหรับปีถัดไป",
    การปรับปรุงกระบวนการ_กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่21 : "สาขาวิชา เสนอให้มีการปรับปรุงระบบกลไกด้านกิจกรรมการพัฒนาศักยภาพของนักศึกษาและการ เสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21 ใหม่ ดังนี้ \n1. สาขาวิชาตรวจสอบกิจกรรมของคณะ และมหาวิทยาลัย ก่อนการวางแผนด้านกิจกรรมการพัฒนา ศักยภาพของนักศึกษาและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21 \n2. สาขาวิชาประชุม วางแผนการดําเนินงานกิจกรรมพัฒนาศักยภาพของนักศึกษาทั้งหมดในปีการศึกษา  ทั้ง ทางด้านงบประมาณและกิจกรรม และแผนงานการบริหารความเสี่ยง กรณีเกิดปัญหา ทั้งก่อนดําเนินกิจกรรม ระหว่างดําเนินกิจกรรม และหลังการดําเนินกิจกรรม \n3. สาขาวิชาเสนอแผนการดําเนินงานกิจกรรมพัฒนาศักยภาพของนักศึกษาและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21 ทั้งหมดในปีการศึกษา ทั้งทางด้านงบประมาณและกิจกรรม แก่คณะ เพื่อขออนุมัติ งบประมาณ\n4. ดําเนินกิจกรรมการพัฒนาศักยภาพของนักศึกษาตามแผนงานตามไตรมาสที่กําหนดไว้\n5. ประเมินโครงการกิจกรรมการพัฒนาศักยภาพของนักศึกษา ทุกโครงการ เพื่อสรุปผลรายงานต่อคณะ\n6. สาขาวิชาทบทวน และประเมินผลการดําเนินกิจกรรมการพัฒนาศักยภาพของนักศึกษาและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21 เพื่อนําไปปรับปรุงแก้ไข",
    
    เป้าหมาย_การประเมินตนเองจากผลการดำเนินงาน_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา : "ระดับ 2",
    ผลการดำเนินงาน_การประเมินตนเองจากผลการดำเนินงาน_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา : "2",
    คะแนนการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา : "2",
    การบรรลุเป้าหมาย_การประเมินตนเองจากผลการดำเนินงาน_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา : "บรรลุ",

    รหัสเอกสาร_รายการหลักฐานอ้างอิง_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา_1 : "B.ENG 3.1-2-01",
    รายการเอกสารหลักฐาน_รายการหลักฐานอ้างอิง_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา_1 : "คําสั่งแต่งตั้งอาจารย์ที่ปรึกษา",
    รหัสเอกสาร_รายการหลักฐานอ้างอิง_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา_2 : "B.ENG 3.2-2-01",
    รายการเอกสารหลักฐาน_รายการหลักฐานอ้างอิง_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา_2 : "ผลการประเมินอาจารย์ที่ปรึกษา",
    รหัสเอกสาร_รายการหลักฐานอ้างอิง_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา_3 : "B.ENG 3.2-2-02",
    รายการเอกสารหลักฐาน_รายการหลักฐานอ้างอิง_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา_3 : "ผลการประเมินโครงการ",


    ปีการศึกษาที่รับเข้า : "ปีการศึกษาที่รับเข้า",
    จำนวนรับเข้า : "จำนวนรับเข้า(1)",
    จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา : "จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา (3)",
    หัว1_1 : "2559",
    หัว1_2 : "2560",
    หัว1_3 : "2561",
    หัว1_4 : "2562",
    หัว1_5 : "2563",
    หัว1_6 : "2564",

    หัว1_1_1 : "2559",
    หัว1_2_1 : "2560",
    หัว1_3_1 : "2561",
    หัว1_4_1 : "2562",
    หัว1_5_1 : "2563",
    หัว1_6_1 : "2564",
    
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา1: "2559",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา2: "2560",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา3: "2561",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา4: "2562",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา5: "2563",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา6: "2564",

    จำนวนรับเข้า_เริ่มต้น_1 : "64",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_1 : "62",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_2 : "40",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_3 : "36",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_4 : "37",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_5 : "26",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_6 : "12",
    จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_1 : "14",

    จำนวนรับเข้า_เริ่มต้น_2 : "40",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_1 : "-",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_2 : "40",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_3 : "37",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_4 : "31",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_5 : "31",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_6 : "18",
    จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_2 : "13",

    จำนวนรับเข้า_เริ่มต้น_3 : "40",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_1 : "-",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_2 : "-",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_3 : "40",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_4 : "37",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_5 : "36",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_6 : "35",
    จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_3 : "1",

    จำนวนรับเข้า_เริ่มต้น_4 : "27",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_1 : "-",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_2 : "-",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_3 : "-",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_4 : "27",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_5 : "25",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_6 : "24",
    จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_4 : "1",
    
    จำนวนรับเข้า_เริ่มต้น_5 : "39",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_1 : "-",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_2 : "-",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_3 : "-",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_4 : "-",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_5 : "39",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_6 : "33",
    จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_5 : "6",

    จำนวนรับเข้า_เริ่มต้น_6 : "40",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_1 : "-",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_2 : "-",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_3 : "-",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_4 : "-",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_5 : "-",
    จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_6 : "37",
    จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_6 : "3",

    ปีการศึกษา : "ปีการศึกษา",
    จำนวนรับเข้า1 : "จำนวนรับเข้า(1)",
    ปีการศึกษา_1	: "2559",
    ปีการศึกษา_2	: "2560",
    ปีการศึกษา_3	: "2561",
    ปีการศึกษา_4	: "2562",
    ปีการศึกษา_5	: "2563",
    ปีการศึกษา_6  : "2564",

    จำนวนรับเข้า_1 : "60",
    จำนวนรับเข้า_2 : "64",
    จำนวนรับเข้า_3 : "62",
    จำนวนรับเข้า_4 : "40",
    จำนวนรับเข้า_5 : "40",

    ปีการศึกษา_1_1 : "2557",
    ปีการศึกษา_1_2 : "2558",
    ปีการศึกษา_1_3 : "2559",
    ปีการศึกษา_1_4 : "2560",
    ปีการศึกษา_1_5 : "2561",

    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_1 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_2 : "19 (31.66)",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_3 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_4 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_5 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_6 : "-",

    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_1 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_2 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_3 : "38 (59.37)",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_4 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_5 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_6 : "-",

    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_1 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_2 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_3 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_4 : "23 (37.09)",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_5 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_6 : "-",

    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_1 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_2 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_3 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_4 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_5 : "23 (57.50)",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_6 : "-",

    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_1 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_2 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_3 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_4 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_5 : "-",
    จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_6 : "26 (65.00)",


    ปัจจัย_1 : "1. ในปีนี้การจบของนักศึกษาจะเป็นส่วนที่เก็บตกจากปีก่อนๆ ที่สามารถเรียนในจบในส่วนของวิชาโครงงาน และ ในหมวดการศึกษาทั่วไปของทางมหาวิทยาลัยได้ ส่วนนักศึกษาที่ยังไม่จบตรงกับปีการศึกษานั้น ส่วนใหญ่จะติดในส่วนของวิชาโครงงาน ดังนั้นจึงเป็นผลกระทบกับการจบ การศึกษาของนักศึกษา ทําให้มีจํานวนนักศึกษาที่ไม่สําเร็จการศึกษาตามกําหนดเวลาตามที่หลักสูตรกําหนด  \n 2. ปัจจัยที่ส่งผลกระทบต่อจํานวนนักศึกษาที่สําเร็จการศึกษาตามระยะเวลาของหลักสูตร เนื่องจากหลักสูตรมี รายวิชาที่ให้นักศึกษาดําเนินงานเกี่ยวกับการทําปริญญานิพนธ์ เพื่อให้นักศึกษาเรียนรู้ขั้นตอนและกระบวนการทำโครงงานที่สามารถนําไปต่อยอดในการศึกษาในระดับที่สูงขึ้นได้ แต่นักศึกษาบางกลุ่มใช้เวลาในการค้นคว้าหาข้อมูลเพื่อประกอบการทําปริญญานิพนธ์ค่อนข้างนาน ส่งผลทําให้งานเกิดความล่าช้า  \n 3. เนื่องจากสภาพเศรษฐกิจ และปัญหาครอบครัวของนักศึกษาบางคน ทําให้นักศึกษาต้องทํางานไปด้วย และเรียนไปด้วย ส่งผลให้นักศึกษาต้องใช้เวลาในการเรียนเพิ่มมากขึ้น เพราะลงทะเบียนเรียนในแต่ละภาคการศึกษาน้อยลง เพื่อให้มีเวลาในการทํางานเพิ่มมากขึ้น",
    การประเมินความพึงพอใจของนักศึกษา : "ในปีการศึกษา 2564 เนื่องจากเป็นการเรียนแบบ online ในปีนี้จึงไม่ได้ทำการสำรวจประเมินความพึงพอใจของนักศึกษา ",

    ระบบกลไก_การจัดการข้อร้องเรียนของนักศึกษา : "	หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ มีระบบกลไกในการ จัดการข้อร้องเรียนของนักศึกษา ดังนี้ \n1. สาขาวิชา หรือคณะกรรมการบริหารหลักสูตรประชุม วางแผนการทํางานด้านการจัดการบริหารความ เสี่ยง ในกรณีเกิดเหตุร้องเรียนจากนักศึกษา \n2. สาขาวิชาแจ้งช่องทาง และแนวทางการส่งเรื่องร้องเรียนต่างๆ ผ่านทางสื่อสังคมออนไลน์  โทรศัพท์ และ ร้องเรียนโดยตรงกับอาจารย์ที่ปรึกษา โดยผู้เรียนสามารถร้องเรียนได้ตลอด 24 ชม. \n3. เมื่อสาขาวิชา พบข้อร้องเรียนจากนักศึกษา หลักสูตรจะดําเนินสืบหารายละเอียด ข้อเท็จจริง และประชุมกับผู้เกี่ยวข้อง เพื่อหาแนวทางการปรับปรุงแก้ไขตามเห็นสมควร ในกรณีเร่งด่วนทางหลักสูตรจะแก้ปัญหาให้ทันที \n4. ติดตามผลการแก้ไขปัญหาจากข้อร้องเรียนของนักศึกษา และประเมินความพึงพอใจของนักศึกษาในการ จัดการข้อร้องเรียนของนักศึกษา \n5. สาขาวิชา ทบทวนระบบกลไกและแผนการดําเนินงานการจัดการข้อร้องเรียนของนักศึกษาทุกปี เพื่อ ประเมินการดําเนินงาน และวางแนวทางปรับปรุงแก้ไขในปีการศึกษาถัดไป",
    ผลดำเนินการ_การจัดการข้อร้องเรียนของนักศึกษา : "ผลการดําเนินงานในปีการศึกษา 2564 ในการจัดการข้อร้องเรียนของนักศึกษามีดังนี้ \n1. สาขาวิชาประชุม เพื่อวางแผนการทํางานด้านการจัดการบริหารความเสี่ยง ในกรณีเกิดเหตุร้องเรียนจากนักศึกษาประจําภาคการศึกษา 2564\n2. สาขาแจ้งช่องทาง และแนวทางการส่งเรื่องร้องเรียนต่างๆ ผ่านทางสื่อสังคมออนไลน์ อาทิเช่น Facebook  โทรศัพท์ และร้องเรียน โดยตรงกับอาจารย์ที่ปรึกษา โดยผู้เรียนสามารถร้องเรียนได้ตลอด 24 ขม. โดยแจ้งในวันปฐมนิเทศนักศึกษา \n3. ในปีการศึกษา 2564 พบข้อร้องเรียน\n4. สาขาติดตามผลการแก้ไขปัญหาจากข้อร้องเรียนของนักศึกษาที่มีการร้องเรียนผ่านอาจารย์ที่ปรึกษาในปีนี้ทำด้วยการสอบถามความคิดเห็นของนักศึกษาในภาพรวม นักศึกษาก็มีความเข้าใจถึงสถานการและความจำเป็นที่ต้องเรียน online\n5. สาขาวิชา ทบทวนระบบกลไกและแผนการดําเนินงานการจัดการข้อร้องเรียนของนักศึกษาทุกปี เพื่อประเมิน การดําเนินงาน และวางแนวทางปรับปรุงแก้ไขในปีการศึกษาถัดไป",
    การประเมินกระบวนการ_การจัดการข้อร้องเรียนของนักศึกษา : "สาขาวิชาทบทวนระบบกลไกและแผนการดําเนินงานการจัดการข้อร้องเรียนของนักศึกษาทุกปี เพื่อประเมินการดําเนินงานและวางแนวทางปรับปรุงแก้ไขในปีการศึกษาถัดไปจากการดําเนินงานพบว่าในปีการศึกษา2564 พบปัญหาในการดําเนินการจัดการข้อร้องเรียนดังนั้นสาขาวิชาเสนอให้ใช้ระบบกลไกการจัดการข้อร้องเรียนของ นักศึกษารูปแบบเดิม ในปีการศึกษา 2565",
    การปรับปรุงกระบวนการ_การจัดการข้อร้องเรียนของนักศึกษา : "สาขาวิชาเสนอให้ใช้ระบบกลไกการจัดการข้อร้องเรียนของนักศึกษารูปแบบเดิมในปีการศึกษา 2565 เนื่องจากมีแนวทางการส่งเรื่องร้องเรียนต่างๆผ่านทางสื่อสังคมออนไลน์โทรศัพท์และร้องเรียนโดยตรงกับอาจารย์ ที่ปรึกษา โดยผู้เรียนสามารถร้องเรียนได้ตลอด 24 ชม.",

    การคงอยู่_การคงอยู่ : "นักศึกษาปีการศึกษา 2559 มีอัตราการคงอยู่คิดเป็นร้อยละ 78.125\nนักศึกษาปีการศึกษา 2560 มีอัตราการคงอยู่คิดเป็นร้อยละ 67.50\nนักศึกษาปีการศึกษา 2561 มีอัตราการคงอยู่คิดเป็นร้อยละ 97.50\nนักศึกษาปีการศึกษา 2562 มีอัตราการคงอยู่คิดเป็นร้อยละ 96.29\nนักศึกษาปีการศึกษา 2563 มีอัตราการคงอยู่คิดเป็นร้อยละ 84.61\nนักศึกษาปีการศึกษา 2564 มีอัตราการคงอยู่คิดเป็นร้อยละ 92.50",
    การสำเร็จการศึกษา_การสำเร็จการศึกษา : "การสําเร็จการศึกษาตามระยะเวลาของหลักสูตรเนื่องจากหลักสูตรมีรายวิชาที่ให้นักศึกษาดําเนินงานเกี่ยวกับการทําปริญญานิพนธ์เพื่อให้นักศึกษาเรียนรู้ขั้นตอนและกระบวนการทำโครงงานที่สามารถนําไปต่อยอดในการศึกษาในระดับที่สูงขึ้นได้แต่นักศึกษาบางกลุ่มใช้เวลาในการค้นคว้าหาข้อมูลเพื่อประกอบการทําปริญญานิพนธ์ค่อนข้างนานส่งผลทําให้งานเกิดความล่าช้าอีกทั้งนักศึกษาบางคนตกและยกเลิกรายววิชาในหมวดศึกษาทั่วไปจึงต้องดําเนินการเก็บรายวิชาดังกล่าวในปีการศึกษาถัดมาดังนั้นจึงมีผลกระทบกับการจบการศึกษาของนักศึกษาทําให้มีจํานวนนักศึกษาที่ไม่สําเร็จการศึกษาตามกําหนดเวลาตามที่หลักสูตรกําหนด",
    ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา_ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา : "สาขาวิชาประชุมวางแผนการทํางานด้านการจัดการบริหารความเสี่ยงในกรณีเกิดเหตุร้องเรียนจากนักศึกษาประจําภาคการศึกษา2563และแจ้งช่องทางและแนวทางการส่งเรื่องร้องเรียนต่างๆผ่านทางสื่อสังคม ออนไลน์  โทรศัพท์ และร้องเรียนโดยตรงกับอาจารย์ที่ปรึกษา โดยผู้เรียนสามารถร้องเรียนได้ตลอด 24 ขม. โดยแจ้ง ในวันปฐมนิเทศนักศึกษา ซึ่งในปีการศึกษา 2563 พบข้อร้องเรียนมายังหลักสูตร 2 ข้อ ได้แก่1)อยากให้อาจารย์ผู้สอนเข้าสอนตรงเวลา2)อยากได้ห้องทำโครงงานที่มีขนาดใหญ่หรือจำนวนเพิ่มขึ้น ซึ่งสาขาได้จัดประชุมสาขาและหัวหน้าสาขาชี้แจงข้อร้องเรียนให้อาจารย์ผู้สอนทราบพร้อมสอบถามและให้อาจารย์ผู้สอนชี้แจงและสุดท้ายหัวหน้าสาขานำผลการชี้แจงแจ้งนักศึกษาผ่านทางสื่อสังคมออนไลน์สำหรับข้อ 2) ได้จัดประชุมสาขาและหัวหน้าสาขาชี้แจงข้อร้องเรียน ให้อาจารย์ในสาขาทราบ พร้อมสอบถามข้อคิดเห็น ทำสรุปการประชุม และสุดท้ายหัวหน้าสาขานำรายงานการประชุมแจ้งให้กับคณะฯ ทราบ และนักศึกษามีความพึงพอใจต่อการจัดการข้อร้องเรียนอยู่ในระดับดีมาก",

    ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา_การประเมินตนเองจากผลการดำเนินงาน_เป้าหมาย : "ระดับ 2",
    ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา_การประเมินตนเองจากผลการดำเนินงาน_ผลการดำเนินงาน : "2",
    ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา_การประเมินตนเองจากผลการดำเนินงาน_คะแนนการประเมินตนเอง : "2",
    ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา_การประเมินตนเองจากผลการดำเนินงาน_การบรรลุเป้าหมาย : "บรรลุ",
    
    รายการหลักฐานอ้างอิง_รหัสเอกสาร : "B.ENG 3.3-3-01",
    รายการหลักฐานอ้างอิง_รายการเอกสารหลักฐาน : "ตารางรายงานจำนวนนักศึกษาที่จบในแต่ละปีจากส่วนกลาง",

    // คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_ผลการดำเนินงาน : "หลักสูตรวิศวกรรมศาสตรบัณฑิตสาขาวิชาวิศวกรรมคอมพิวเตอร์สำรวจคุณภาพของบัณฑิตที่จบการศึกษาในปีการศึกษา 2564 ที่ครอบคลุมตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ 5 ด้าน คือ (1) ด้านคุณธรรมจริยธรรม(2)ด้านความรู้(3)ด้านทักษะทางปัญญา(4)ด้านทักษะความสัมพันธ์ระหว่างบุคคล และ(5)ด้านทักษะการวิเคราะห์เชิงตัวเลขการสื่อสารและการใช้เทคโนโลยีสารสนเทศสำรวจโดยการแจกแบบสอบถามจากผู้ใช้บัณฑิต ดังนี้\nจำนวนบัณฑิตหลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ ที่สำเร็จการศึกษารวม 23 คน โดยได้รับแบบสำรวจกลับมาจากผู้ใช้บัณฑิต จำนวน 13  ฉบับ คิดเป็นร้อยละ 56.52 จากจำนวนบัณฑิตที่สำเร็จการศึกษาทั้งหมดโดยระดับความพึงพอใจของผู้ใช้บัณฑิตที่มีต่อบัณฑิตหลักสูตรมีค่าเฉลี่ยเท่ากับ 4.50",
    // คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_การประเมินตนเองจากผลการดำเนินงาน : "",

    คุณภาพของบัณฑิตปริญญาตรีโทเอกตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_รวม : "4.50",
    จำนวนผู้สำเร็จการศึกษาทั้งหมด_รวม : "23",
    จำนวนผู้สำเร็จการศึกษาที่ได้รับการประเมินคุณภาพตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_รวม : "13",
    ผลการประเมินจากความพึงพอใจของผู้ใช้บัณฑิต_ด้านคุณธรรมจริยธรรม_รวม : "4.60",
    ผลการประเมินจากความพึงพอใจของผู้ใช้บัณฑิต_ด้านความรู้_รวม : "4.45",
    ผลการประเมินจากความพึงพอใจของผู้ใช้บัณฑิต_ด้านทักษะทางปัญญา_รวม : "4.30",
    ผลการประเมินจากความพึงพอใจของผู้ใช้บัณฑิต_ด้านทักษะความสัมพันธ์ระหว่างบุคคล_รวม : "4.31",
    ผลการประเมินจากความพึงพอใจของผู้ใช้บัณฑิต_ด้านทักษะการวิเคราะห์เชิงตัวเลขการสื่อสารและการใช้_รวม : "4.29",
    อัตลักษณ์ของบัณฑิต_รวม : "4.08",
    ระดับความพึงพอใจในคุณลักษณะของบัณฑิตและผลการปฏิบัติงานของบัณฑิต_รวม : "4.50",
    ผู้ตอบแบบประเมินความพึงพอใจของผู้ใช้บัณฑิตที่มีต่อผู้สำเร็จการศึกษา_รวม : "56.52",

    คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_การประเมินตนเองจากผลการดำเนินงาน_เป้าหมาย : "4.50 คะแนน",
    คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_การประเมินตนเองจากผลการดำเนินงาน_ผลการดำเนินงาน : "4.50",
    คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_การประเมินตนเองจากผลการดำเนินงาน_คะแนนการประเมินตนเอง : "4.50",
    คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_การประเมินตนเองจากผลการดำเนินงาน_การบรรลุเป้าหมาย : "บรรลุ",

    คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_รายการหลักฐานอ้างอิง_รหัสเอกสาร : "B.ENG 2.2-1-01",
    คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_รายการหลักฐานอ้างอิง_รายการเอกสารหลักฐาน : "รายงานสรุปผลการสำรวจความคิดเห็นที่มีต่อคุณภาพของบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ จากสถานประกอบการผู้ใช้บัณฑิต หรือสถาบันที่รับบัณฑิตเข้าศึกษาต่อ ปีการศึกษา 2563",

    ร้อยละของบัณฑิตปริญญาตรีที่ได้งานทําหรือประกอบอาชีพอิสระภายใน1ปี_ผลดำเนินงาน : "หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์  สำรวจการมีงานทำของบัณฑิตที่สำเร็จการศึกษาในปีการศึกษา 2564 โดยใช้การสำรวจด้วยการให้บัณฑิตตอบแบบสอบถามด้วยตนเอง ผ่านระบบการลงทะเบียนรับปริญญาบัตรของมหาวิทยาลัย ซึ่งมีบัณฑิตสำเร็จการศึกษาหลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์  จำนวน 23 คน พบว่า มีบัณฑิตตอบแบบสอบถาม 22 คน คิดเป็นร้อยละ 95.65  ของบัณฑิตที่สำเร็จการศึกษาทั้งหมด โดยมีบัณฑิตที่ได้งานทำหรือประกอบอาชีพอิสระภายใน 1 ปี จำนวน 14 คน จากจำนวนบัณฑิตที่ตอบแบบสำรวจโดยไม่นับรวมบัณฑิตที่มีงานทำก่อนเข้าศึกษาหรือมีกิจการของตนเองที่มีรายได้ประจำอยู่แล้วที่ไม่ได้เปลี่ยนงานใหม่ ผู้ที่ศึกษาต่อในระดับบัณฑิตศึกษา ผู้อุปสมบทและผู้ที่เกณฑ์ทหาร ไม่มี",

    บัณฑิตปริญญาตรีที่ได้งานทำหรือประกอบอาชีพอิสระภายใน1ปี_ผลการดำเนินงาน : "66.67",
    จำนวนบัณฑิตระดับปริญญาตรีทั้งหมด_ผลการดำเนินงาน : "23",
    จำนวนบัณฑิตระดับปริญญาตรีที่ตอบแบบสำรวจเรื่องการมีงานทำ_ผลการดำเนินงาน : "22",
    จำนวนบัณฑิตระดับปริญญาตรีที่ได้งานทำหลังสำเร็จการศึกษาไม่นับรวมผู้ที่ประกอบอาชีพอิสระ_ผลการดำเนินงาน : "14",
    จำนวนบัณฑิตระดับปริญญาตรีที่ประกอบอาชีพอิสระ_ผลการดำเนินงาน : "0",
    จำนวนผู้สำเร็จการศึกษาระดับปริญญาตรีที่มีงานทำก่อนเข้าศึกษา_ผลการดำเนินงาน : "1",
    จำนวนบัณฑิตระดับปริญญาตรีที่มีกิจการของตนเองที่มีรายได้ประจำอยู่แล้ว_ผลการดำเนินงาน : "0",
    จำนวนบัณฑิตระดับปริญญาตรีที่ศึกษาต่อระดับบัณฑิตศึกษา_ผลการดำเนินงาน : "0",
    จำนวนบัณฑิตระดับปริญญาตรีที่อุปสมบท_ผลการดำเนินงาน : "0",
    จำนวนบัณฑิตระดับปริญญาตรีที่เกณฑ์ทหาร_ผลการดำเนินงาน : "0",
    เงินเดือนหรือรายได้ต่อเดือนของผู้สำเร็จการศึกษาระดับปริญญาตรีที่ได้งานทำหรือประกอบอาชีพอิสระ_ผลการดำเนินงาน : "22,286",
    ร้อยละของผู้ตอบแบบสำรวจเรื่องการมีงานทำอย่างน้อยร้อยละ70_ผลการดำเนินงาน : "95.65",

    บัณฑิต_ผลการประเมินตนเองตามองค์ประกอบ_คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_ผลการดำเนินงาน : "4.50",
    บัณฑิต_ผลการประเมินตนเองตามองค์ประกอบ_ร้อยละของบัณฑิตปริญญาตรีที่ได้งานทําหรือประกอบอาชีพอิสระภายใน1ปี_ผลการดำเนินงาน : "ร้อยละ 66.67",
    บัณฑิต_ผลการประเมินตนเองตามองค์ประกอบ_คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_คะแนนการประเมินตนเอง : "4.50 คะแนน",
    บัณฑิต_ผลการประเมินตนเองตามองค์ประกอบ_ร้อยละของบัณฑิตปริญญาตรีที่ได้งานทําหรือประกอบอาชีพอิสระภายใน1ปี_คะแนนการประเมินตนเอง : "5.00 คะแนน",
    บัณฑิต_ผลการประเมินตนเองตามองค์ประกอบ_คะแนนเฉลี่ยผลการดำเนินงานองค์ประกอบที่2 : "4.75 คะแนน",

    นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_การรับนักศึกษา_ผลการดำเนินงาน : "ระดับ 3",
    นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_การส่งเสริมและพัฒนานักศึกษา_ผลการดำเนินงาน : "ระดับ 2",
    นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_ผลที่เกิดกับนักศึกษา_ผลการดำเนินงาน : "ระดับ 2",
    นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_การรับนักศึกษา_คะแนนการประเมินตนเอง : "3 คะแนน",
    นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_การส่งเสริมและพัฒนานักศึกษา_คะแนนการประเมินตนเอง : "2 คะแนน",
    นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_ผลที่เกิดกับนักศึกษา_คะแนนการประเมินตนเอง : "2 คะแนน",
    นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_คะแนนเฉลี่ยผลการดำเนินงานองค์ประกอบที่3 : "2.33 คะแนน",
    
    สรุปผลการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน_เป้าหมาย : "ร้อยละ 70",
    สรุปผลการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน_ผลการดำเนินงาน : "ร้อยละ 100",
    สรุปผลการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน_คะแนนการประเมินตนเอง : "5.00",
    สรุปผลการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน_การบรรลุเป้าหมาย : "บรรลุ",

    สรุปผลการประเมินตนเอง_รายการหลักฐานอ้างอิง_รหัสเอกสาร : "B.ENG 2.2-1-02",
    สรุปผลการประเมินตนเอง_รายการหลักฐานอ้างอิง_รายการเอกสารหลักฐาน : "รายงานสรุปภาวะการมีงานทำ ประจำปีการศึกษา 2564",

    percentage1 : percentage1,
    percentage2 : percentage2,
    percentage3 : percentage3,
    percentage4 : percentage4,
    percentage5 : percentage5,
    percentage6 : percentage6,

  });

  // const YourComponent = () => {
  //   const handleChangeCSV = (event) => {
  //     // handle CSV file change
  //   };
  
  //   const handleChangeExcel = (event) => {
  //     // handle Excel file change
  //   };
  

  const handleChangeExcel = (e) => {
    const file = e.target.files[0];
    const reader = new FileReader();
    reader.onload = (e) => {
      const buffer = e.target.result;
      const workbook = XLSX.read(new Uint8Array(buffer), { type: 'array' });
      const sheetName = workbook.SheetNames[0];
      const sheet = workbook.Sheets[sheetName];
      const cellB2Value = sheet['B2'] ? sheet['B2'].v : '';
      const cellC3Value = sheet['C3'] ? sheet['C3'].v : '';
      const cellD3Value = sheet['D3'] ? sheet['D3'].v : '';
      const cellE3Value = sheet['E3'] ? sheet['E3'].v : '';
      const cellF3Value = sheet['F3'] ? sheet['F3'].v : '';
      const cellG3Value = sheet['G3'] ? sheet['G3'].v : '';
      const cellH3Value = sheet['H3'] ? sheet['H3'].v : '';
      const cellB4Value = sheet['B4'] ? sheet['B4'].v : '';
      const cellB5Value = sheet['B5'] ? sheet['B5'].v : '';
      const cellB6Value = sheet['B6'] ? sheet['B6'].v : '';
      const cellB7Value = sheet['B7'] ? sheet['B7'].v : '';
      const cellB8Value = sheet['B8'] ? sheet['B8'].v : '';
      const cellB9Value = sheet['B9'] ? sheet['B9'].v : '';

      const cellC4Value = sheet['C4'] ? sheet['C4'].v : '';
      const cellD4Value = sheet['D4'] ? sheet['D4'].v : '';
      const cellE4Value = sheet['E4'] ? sheet['E4'].v : '';
      const cellF4Value = sheet['F4'] ? sheet['F4'].v : '';
      const cellG4Value = sheet['G4'] ? sheet['G4'].v : '';
      const cellH4Value = sheet['H4'] ? sheet['H4'].v : '';

      const cellC5Value = sheet['C5'] ? sheet['C5'].v : '';
      const cellD5Value = sheet['D5'] ? sheet['D5'].v : '';
      const cellE5Value = sheet['E5'] ? sheet['E5'].v : '';
      const cellF5Value = sheet['F5'] ? sheet['F5'].v : '';
      const cellG5Value = sheet['G5'] ? sheet['G5'].v : '';
      const cellH5Value = sheet['H5'] ? sheet['H5'].v : '';

      const cellC6Value = sheet['C6'] ? sheet['C6'].v : '';
      const cellD6Value = sheet['D6'] ? sheet['D6'].v : '';
      const cellE6Value = sheet['E6'] ? sheet['E6'].v : '';
      const cellF6Value = sheet['F6'] ? sheet['F6'].v : '';
      const cellG6Value = sheet['G6'] ? sheet['G6'].v : '';
      const cellH6Value = sheet['H6'] ? sheet['H6'].v : '';

      const cellC7Value = sheet['C7'] ? sheet['C7'].v : '';
      const cellD7Value = sheet['D7'] ? sheet['D7'].v : '';
      const cellE7Value = sheet['E7'] ? sheet['E7'].v : '';
      const cellF7Value = sheet['F7'] ? sheet['F7'].v : '';
      const cellG7Value = sheet['G7'] ? sheet['G7'].v : '';
      const cellH7Value = sheet['H7'] ? sheet['H7'].v : '';

      const cellC8Value = sheet['C8'] ? sheet['C8'].v : '';
      const cellD8Value = sheet['D8'] ? sheet['D8'].v : '';
      const cellE8Value = sheet['E8'] ? sheet['E8'].v : '';
      const cellF8Value = sheet['F8'] ? sheet['F8'].v : '';
      const cellG8Value = sheet['G8'] ? sheet['G8'].v : '';
      const cellH8Value = sheet['H8'] ? sheet['H8'].v : '';

      const cellC9Value = sheet['C9'] ? sheet['C9'].v : '';
      const cellD9Value = sheet['D9'] ? sheet['D9'].v : '';
      const cellE9Value = sheet['E9'] ? sheet['E9'].v : '';
      const cellF9Value = sheet['F9'] ? sheet['F9'].v : '';
      const cellG9Value = sheet['G9'] ? sheet['G9'].v : '';
      const cellH9Value = sheet['H9'] ? sheet['H9'].v : '';
      setDateTqf7_3(prevData => ({
        ...prevData,

        หัวใหญ่: cellB2Value,

        หัว1:cellB4Value,
        หัว2:cellB5Value,
        หัว3:cellB6Value,
        หัว4:cellB7Value,
        หัว5:cellB8Value,
        หัว6:cellB9Value,

        ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_1:cellC3Value,
        ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_2:cellD3Value,
        ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_3:cellE3Value,
        ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_4:cellF3Value,
        ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_5:cellG3Value,
        ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_6:cellH3Value,

        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_1:cellC4Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_2:cellD4Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_3:cellE4Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_4:cellF4Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_5:cellG4Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_6:cellH4Value,

        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_1:cellC5Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_2:cellD5Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_3:cellE5Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_4:cellF5Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_5:cellG5Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_6:cellH5Value,

        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_1:cellC6Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_2:cellD6Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_3:cellE6Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_4:cellF6Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_5:cellG6Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_6:cellH6Value,

        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_1:cellC7Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_2:cellD7Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_3:cellE7Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_4:cellF7Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_5:cellG7Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_6:cellH7Value,

        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_1:cellC8Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_2:cellD8Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_3:cellE8Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_4:cellF8Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_5:cellG8Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_6:cellH8Value,

        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_1:cellC9Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_2:cellD9Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_3:cellE9Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_4:cellF9Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_5:cellG9Value,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_6:cellH9Value,
      }));
    };
    reader.readAsArrayBuffer(file);
  };

  const handleChangeCSV = (e) => {
    const file = e.target.files[0];
    const reader = new FileReader();
    reader.onload = (e) => {
      const text = e.target.result;
      const csvData = text.split('\n');
      const cellValues = csvData.map(row => row.split(',').map(cell => cell.trim()));
      const [row1, row2, row3, row4, row5, row6, row7] = cellValues;
  
      setDateTqf7_3(prevData => ({
        ...prevData,

        หัวใหญ่:row1[0],
        หัว1:row1[1],
        หัว2:row1[2],
        หัว3:row1[3],
        หัว4:row1[4],
        หัว5:row1[5],
        หัว6:row1[6],
        
        ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_1 : row2[0],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_1: row2[1],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_2: row2[2],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_3: row2[3],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_4: row2[4],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_5: row2[5],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_6: row2[6],

        ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_2 : row3[0],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_1: row3[1],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_2: row3[2],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_3: row3[3],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_4: row3[5],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_5: row3[6],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_6: row3[7],

        ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_3 : row4[0],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_1: row4[1],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_2: row4[2],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_3: row4[3],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_4: row4[4],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_5: row4[5],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_6: row4[6],

        ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_4 : row5[0],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_1: row5[1],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_2: row5[2],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_3: row5[3],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_4: row5[4],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_5: row5[5],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_6: row5[6],

        ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_5 : row6[0],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_1: row6[1],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_2: row6[2],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_3: row6[3],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_4: row6[4],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_5: row6[5],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_6: row6[6],

        ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_6 : row7[0],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_1: row7[1],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_2: row7[2],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_3: row7[3],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_4: row7[4],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_5: row7[5],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_6: row7[6],

      }));
    };
    const blob = file.slice(0, file.size);
    reader.readAsText(blob);
  };

  const handleChangeExcel2 = (e) => {
    const file = e.target.files[0];
    const reader = new FileReader();
    reader.onload = (e) => {
      const buffer = e.target.result;
      const workbook = XLSX.read(new Uint8Array(buffer), { type: 'array' });
      const sheetName = workbook.SheetNames[0];
      const sheet = workbook.Sheets[sheetName];

      const cellB2Value2 = sheet['B2'] ? sheet['B2'].v : '';
      const cellC2Value2 = sheet['C2'] ? sheet['C2'].v : '';

      const cellD3Value2 = sheet['D3'] ? sheet['D3'].v : '';
      const cellE3Value2 = sheet['E3'] ? sheet['E3'].v : '';
      const cellF3Value2 = sheet['F3'] ? sheet['F3'].v : '';
      const cellG3Value2 = sheet['G3'] ? sheet['G3'].v : '';
      const cellH3Value2 = sheet['H3'] ? sheet['H3'].v : '';
      const cellI3Value2 = sheet['I3'] ? sheet['I3'].v : '';
      const cellJ2Value2 = sheet['J2'] ? sheet['J2'].v : '';
      
      const cellB4Value2 = sheet['B4'] ? sheet['B4'].v : '';
      const cellC4Value2 = sheet['C4'] ? sheet['C4'].v : '';
      const cellD4Value2 = sheet['D4'] ? sheet['D4'].v : '';
      const cellE4Value2 = sheet['E4'] ? sheet['E4'].v : '';
      const cellF4Value2 = sheet['F4'] ? sheet['F4'].v : '';
      const cellG4Value2 = sheet['G4'] ? sheet['G4'].v : '';
      const cellH4Value2 = sheet['H4'] ? sheet['H4'].v : '';
      const cellI4Value2 = sheet['I4'] ? sheet['I4'].v : '';
      const cellJ4Value2 = sheet['J4'] ? sheet['J4'].v : '';

      const cellB5Value2 = sheet['B5'] ? sheet['B5'].v : '';
      const cellC5Value2 = sheet['C5'] ? sheet['C5'].v : '';
      const cellD5Value2 = sheet['D5'] ? sheet['D5'].v : '';
      const cellE5Value2 = sheet['E5'] ? sheet['E5'].v : '';
      const cellF5Value2 = sheet['F5'] ? sheet['F5'].v : '';
      const cellG5Value2 = sheet['G5'] ? sheet['G5'].v : '';
      const cellH5Value2 = sheet['H5'] ? sheet['H5'].v : '';
      const cellI5Value2 = sheet['I5'] ? sheet['I5'].v : '';
      const cellJ5Value2 = sheet['J5'] ? sheet['J5'].v : '';

      const cellB6Value2 = sheet['B6'] ? sheet['B6'].v : '';
      const cellC6Value2 = sheet['C6'] ? sheet['C6'].v : '';
      const cellD6Value2 = sheet['D6'] ? sheet['D6'].v : '';
      const cellE6Value2 = sheet['E6'] ? sheet['E6'].v : '';
      const cellF6Value2 = sheet['F6'] ? sheet['F6'].v : '';
      const cellG6Value2 = sheet['G6'] ? sheet['G6'].v : '';
      const cellH6Value2 = sheet['H6'] ? sheet['H6'].v : '';
      const cellI6Value2 = sheet['I6'] ? sheet['I6'].v : '';
      const cellJ6Value2 = sheet['J6'] ? sheet['J6'].v : '';

      const cellB7Value2 = sheet['B7'] ? sheet['B7'].v : '';
      const cellC7Value2 = sheet['C7'] ? sheet['C7'].v : '';
      const cellD7Value2 = sheet['D7'] ? sheet['D7'].v : '';
      const cellE7Value2 = sheet['E7'] ? sheet['E7'].v : '';
      const cellF7Value2 = sheet['F7'] ? sheet['F7'].v : '';
      const cellG7Value2 = sheet['G7'] ? sheet['G7'].v : '';
      const cellH7Value2 = sheet['H7'] ? sheet['H7'].v : '';
      const cellI7Value2 = sheet['I7'] ? sheet['I7'].v : '';
      const cellJ7Value2 = sheet['J7'] ? sheet['J7'].v : '';

      const cellB8Value2 = sheet['B8'] ? sheet['B8'].v : '';
      const cellC8Value2 = sheet['C8'] ? sheet['C8'].v : '';
      const cellD8Value2 = sheet['D8'] ? sheet['D8'].v : '';
      const cellE8Value2 = sheet['E8'] ? sheet['E8'].v : '';
      const cellF8Value2 = sheet['F8'] ? sheet['F8'].v : '';
      const cellG8Value2 = sheet['G8'] ? sheet['G8'].v : '';
      const cellH8Value2 = sheet['H8'] ? sheet['H8'].v : '';
      const cellI8Value2 = sheet['I8'] ? sheet['I8'].v : '';
      const cellJ8Value2 = sheet['J8'] ? sheet['J8'].v : '';

      const cellB9Value2 = sheet['B9'] ? sheet['B9'].v : '';
      const cellC9Value2 = sheet['C9'] ? sheet['C9'].v : '';
      const cellD9Value2 = sheet['D9'] ? sheet['D9'].v : '';
      const cellE9Value2 = sheet['E9'] ? sheet['E9'].v : '';
      const cellF9Value2 = sheet['F9'] ? sheet['F9'].v : '';
      const cellG9Value2 = sheet['G9'] ? sheet['G9'].v : '';
      const cellH9Value2 = sheet['H9'] ? sheet['H9'].v : '';
      const cellI9Value2 = sheet['I9'] ? sheet['I9'].v : '';
      const cellJ9Value2 = sheet['J9'] ? sheet['J9'].v : '';

      setDateTqf7_3(prevData => ({
        ...prevData,

        ปีการศึกษาที่รับเข้า : cellB2Value2,
        จำนวนรับเข้า : cellC2Value2,
        หัว1_1 : cellD3Value2,
        หัว1_2 : cellE3Value2,
        หัว1_3 : cellF3Value2,
        หัว1_4 : cellG3Value2,
        หัว1_5 : cellH3Value2,
        หัว1_6 : cellI3Value2,
        จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา : cellJ2Value2,

        หัว1_1_1 : cellB4Value2,
        หัว1_2_1 : cellB5Value2,
        หัว1_3_1 : cellB6Value2,
        หัว1_4_1 : cellB7Value2,
        หัว1_5_1 : cellB8Value2,
        หัว1_6_1 : cellB9Value2,

        จำนวนรับเข้า_เริ่มต้น_1 : cellC4Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_1 : cellD4Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_2 : cellE4Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_3 : cellF4Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_4 : cellG4Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_5 : cellH4Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_6 : cellI4Value2,
        จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_1 : cellJ4Value2,

        จำนวนรับเข้า_เริ่มต้น_2 : cellC5Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_1 : cellD5Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_2 : cellE5Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_3 : cellF5Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_4 : cellG5Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_5 : cellH5Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_6 : cellI5Value2,
        จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_2 : cellJ5Value2,

        จำนวนรับเข้า_เริ่มต้น_3 : cellC6Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_1 : cellD6Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_2 : cellE6Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_3 : cellF6Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_4 : cellG6Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_5 : cellH6Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_6 : cellI6Value2,
        จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_3 : cellJ6Value2,

        จำนวนรับเข้า_เริ่มต้น_4 : cellC7Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_1 : cellD7Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_2 : cellE7Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_3 : cellF7Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_4 : cellG7Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_5 : cellH7Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_6 : cellI7Value2,
        จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_4 : cellJ7Value2,

        จำนวนรับเข้า_เริ่มต้น_5 : cellC8Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_1 : cellD8Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_2 : cellE8Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_3 : cellF8Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_4 : cellG8Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_5 : cellH8Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_6 : cellI8Value2,
        จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_5 : cellJ8Value2,

        จำนวนรับเข้า_เริ่มต้น_6 : cellC9Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_1 : cellD9Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_2 : cellE9Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_3 : cellF9Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_4 : cellG9Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_5 : cellH9Value2,
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_6 : cellI9Value2,
        จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_6 : cellJ9Value2,
      }));
    };
    reader.readAsArrayBuffer(file);
  };

  const handleChangeCSV2 = (e) => {
    const file = e.target.files[0];
    const reader = new FileReader();
    reader.onload = (e) => {
      const text = e.target.result;
      const csvData = text.split('\n');
      const cellValues2 = csvData.map(row => row.split(',').map(cell => cell.trim()));
      const [row1, row2, row3, row4, row5, row6, row7] = cellValues2;
  
      setDateTqf7_3(prevData => ({
        ...prevData,
        ปีการศึกษาที่รับเข้า : row1[0],
        จำนวนรับเข้า : row1[1],
        หัว1_1 : row1[2],
        หัว1_2 : row1[3],
        หัว1_3 : row1[4],
        หัว1_4 : row1[5],
        หัว1_5 : row1[6],
        หัว1_6 : row1[7],
        จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา : row1[8],
        
        หัว1_1_1 : row2[0],
        ำนวนรับเข้า_เริ่มต้น_1 : row2[1],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_1 : row2[2],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_2 : row2[3],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_3 : row2[4],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_4 : row2[5],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_5 : row2[6],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_6 : row2[7],
        จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_1 : row2[8],

        หัว1_2_1 : row2[0],
        จำนวนรับเข้า_เริ่มต้น_2 : row3[1],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_1 : row3[2],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_2 : row3[3],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_3 : row3[4],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_4 : row3[5],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_5 : row3[6],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_6 : row3[7],
        จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_2 : row3[8],

        หัว1_3_1 : row4[0],
        จำนวนรับเข้า_เริ่มต้น_3 : row4[1],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_1 : row4[2],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_2 : row4[3],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_3 : row4[4],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_4 : row4[5],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_5 : row4[6],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_6 : row4[7],
        จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_3 : row4[8],

        หัว1_4_1 : row5[0],
        จำนวนรับเข้า_เริ่มต้น_4 : row5[1],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_1 : row5[2],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_2 : row5[3],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_3 : row5[4],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_4 : row5[5],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_5 : row5[6],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_6 : row5[7],
        จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_4 : row5[8],

        หัว1_5_1 : row6[0],
        จำนวนรับเข้า_เริ่มต้น_5 : row6[1],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_1 : row6[2],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_2 : row6[3],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_3 : row6[4],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_4 : row6[5],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_5 : row6[6],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_6 : row6[7],
        จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_5 : row6[8],

        หัว1_6_1 : row7[0],
        จำนวนรับเข้า_เริ่มต้น_6 : row7[1],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_1 : row7[2],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_2 : row7[3],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_3 : row7[4],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_4 : row7[5],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_5 : row7[6],
        จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_6 : row7[7],
        จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_6 : row7[8],
      }));
    };
    const blob = file.slice(0, file.size);
    reader.readAsText(blob);
  };

  const handleChangeCSV3 = (e) => {
    const file = e.target.files[0];
    const reader = new FileReader();
    reader.onload = (e) => {
      const text = e.target.result;
      const csvData = text.split('\n');
      const cellValues = csvData.map(row => row.split(',').map(cell => cell.trim()));
      const [row1, row2, row3, row4, row5, row6] = cellValues;
  
      setDateTqf7_3(prevData => ({
        ...prevData,
        ปีการศึกษา:row1[0],
        จำนวนรับเข้า1:row1[1],
        ปีการศึกษา_1:row1[2],
        การศึกษา_2:row1[3],
        การศึกษา_3:row1[4],
        การศึกษา_4:row1[5],
        การศึกษา_5:row1[6],
        การศึกษา_6:row1[7],

        ปีการศึกษา_1_1 : row2[0],
        จำนวนรับเข้า_1 : row2[1],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_1 : row2[2],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_2 : row2[3],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_3 : row2[4],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_4 : row2[5],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_5 : row2[6],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_6 : row2[7],

        ปีการศึกษา_1_2 : row3[0],
        จำนวนรับเข้า_2 : row3[1],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_1 : row3[2],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_2 : row3[3],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_3 : row3[4],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_4 : row3[5],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_5 : row3[6],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_6 : row3[7],

        ปีการศึกษา_1_3 : row4[0],
        จำนวนรับเข้า_3 : row4[1],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_1 : row4[2],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_2 : row4[3],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_3 : row4[4],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_4 : row4[5],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_5 : row4[6],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_6 : row4[7],

        ปีการศึกษา_1_4 : row5[0],
        จำนวนรับเข้า_4 : row5[1],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_1 : row5[2],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_2 : row5[3],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_3 : row5[4],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_4 : row5[5],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_5 : row5[6],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_6 : row5[7],

        ปีการศึกษา_1_5 : row6[0],
        จำนวนรับเข้า_5 : row6[1],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_1 : row6[2],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_2 : row6[3],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_3 : row6[4],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_4 : row6[5],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_5 : row6[6],
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_6 : row6[7],

      }));
    };
    const blob = file.slice(0, file.size);
    reader.readAsText(blob);
  };

  const handleChangeExcel3 = (e) => {
    const file = e.target.files[0];
    const reader = new FileReader();
    reader.onload = (e) => {
      const buffer = e.target.result;
      const workbook = XLSX.read(new Uint8Array(buffer), { type: 'array' });
      const sheetName = workbook.SheetNames[0];
      const sheet = workbook.Sheets[sheetName];

      const cellB2Value3 = sheet['B2'] ? sheet['B2'].v : '';
      const cellC2Value3 = sheet['C2'] ? sheet['C2'].v : '';

      const cellD3Value3 = sheet['D3'] ? sheet['D3'].v : '';
      const cellE3Value3 = sheet['E3'] ? sheet['E3'].v : '';
      const cellF3Value3 = sheet['F3'] ? sheet['F3'].v : '';
      const cellG3Value3 = sheet['G3'] ? sheet['G3'].v : '';
      const cellH3Value3 = sheet['H3'] ? sheet['H3'].v : '';
      const cellI3Value3 = sheet['I3'] ? sheet['I3'].v : '';

      const cellB4Value3 = sheet['B4'] ? sheet['B4'].v : '';
      const cellC4Value3 = sheet['C4'] ? sheet['C4'].v : '';
      const cellD4Value3 = sheet['D4'] ? sheet['D4'].v : '';
      const cellE4Value3 = sheet['E4'] ? sheet['E4'].v : '';
      const cellF4Value3 = sheet['F4'] ? sheet['F4'].v : '';
      const cellG4Value3 = sheet['G4'] ? sheet['G4'].v : '';
      const cellH4Value3 = sheet['H4'] ? sheet['H4'].v : '';
      const cellI4Value3 = sheet['I4'] ? sheet['I4'].v : '';

      const cellB5Value3 = sheet['B5'] ? sheet['B5'].v : '';
      const cellC5Value3 = sheet['C5'] ? sheet['C5'].v : '';
      const cellD5Value3 = sheet['D5'] ? sheet['D5'].v : '';
      const cellE5Value3 = sheet['E5'] ? sheet['E5'].v : '';
      const cellF5Value3 = sheet['F5'] ? sheet['F5'].v : '';
      const cellG5Value3 = sheet['G5'] ? sheet['G5'].v : '';
      const cellH5Value3 = sheet['H5'] ? sheet['H5'].v : '';
      const cellI5Value3 = sheet['I5'] ? sheet['I5'].v : '';

      const cellB6Value3 = sheet['B6'] ? sheet['B6'].v : '';
      const cellC6Value3 = sheet['C6'] ? sheet['C6'].v : '';
      const cellD6Value3 = sheet['D6'] ? sheet['D6'].v : '';
      const cellE6Value3 = sheet['E6'] ? sheet['E6'].v : '';
      const cellF6Value3 = sheet['F6'] ? sheet['F6'].v : '';
      const cellG6Value3 = sheet['G6'] ? sheet['G6'].v : '';
      const cellH6Value3 = sheet['H6'] ? sheet['H6'].v : '';
      const cellI6Value3 = sheet['I6'] ? sheet['I6'].v : '';

      const cellB7Value3 = sheet['B7'] ? sheet['B7'].v : '';
      const cellC7Value3 = sheet['C7'] ? sheet['C7'].v : '';
      const cellD7Value3 = sheet['D7'] ? sheet['D7'].v : '';
      const cellE7Value3 = sheet['E7'] ? sheet['E7'].v : '';
      const cellF7Value3 = sheet['F7'] ? sheet['F7'].v : '';
      const cellG7Value3 = sheet['G7'] ? sheet['G7'].v : '';
      const cellH7Value3 = sheet['H7'] ? sheet['H7'].v : '';
      const cellI7Value3 = sheet['I7'] ? sheet['I7'].v : '';

      const cellB8Value3 = sheet['B8'] ? sheet['B8'].v : '';
      const cellC8Value3 = sheet['C8'] ? sheet['C8'].v : '';
      const cellD8Value3 = sheet['D8'] ? sheet['D8'].v : '';
      const cellE8Value3 = sheet['E8'] ? sheet['E8'].v : '';
      const cellF8Value3 = sheet['F8'] ? sheet['F8'].v : '';
      const cellG8Value3 = sheet['G8'] ? sheet['G8'].v : '';
      const cellH8Value3 = sheet['H8'] ? sheet['H8'].v : '';
      const cellI8Value3 = sheet['I8'] ? sheet['I8'].v : '';



      setDateTqf7_3(prevData => ({
        ...prevData,
        ปีการศึกษา : cellB2Value3,
        จำนวนรับเข้า1 : cellC2Value3,
        
        ปีการศึกษา_1 : cellD3Value3,
        ปีการศึกษา_2 : cellE3Value3,
        ปีการศึกษา_3 : cellF3Value3,
        ปีการศึกษา_4 : cellG3Value3,
        ปีการศึกษา_5 : cellH3Value3,
        ปีการศึกษา_6 : cellI3Value3,

        ปีการศึกษา_1_1 : cellB4Value3,
        จำนวนรับเข้า_1 : cellC4Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_1 : cellD4Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_2 : cellE4Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_3 : cellF4Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_4 : cellG4Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_5 : cellH4Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_6 : cellI4Value3,

        ปีการศึกษา_1_2 : cellB5Value3,
        จำนวนรับเข้า_2 : cellC5Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_1 : cellD5Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_2 : cellE5Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_3 : cellF5Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_4 : cellG5Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_5 : cellH5Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_6 : cellI5Value3,

        ปีการศึกษา_1_3 : cellB6Value3,
        จำนวนรับเข้า_3 : cellC6Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_1 : cellD6Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_2 : cellE6Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_3 : cellF6Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_4 : cellG6Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_5 : cellH6Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_6 : cellI6Value3,

        ปีการศึกษา_1_4 : cellB7Value3,
        จำนวนรับเข้า_4 : cellC7Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_1 : cellD7Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_2 : cellE7Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_3 : cellF7Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_4 : cellG7Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_5 : cellH7Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_6 : cellI7Value3,

        ปีการศึกษา_1_5 : cellB8Value3,
        จำนวนรับเข้า_5 : cellC8Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_1 : cellD8Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_2 : cellE8Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_3 : cellF8Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_4 : cellG8Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_5 : cellH8Value3,
        จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_6 : cellI8Value3,
      }));
    };
    reader.readAsArrayBuffer(file);
  };
  
  useEffect(() => {
    const numerator = dataTqf7_3.จำนวนรับเข้า_เริ่มต้น_1 - dataTqf7_3.จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_1;
    const denominator = dataTqf7_3.จำนวนรับเข้า_เริ่มต้น_1;
    const calculatedPercentage = (numerator / denominator) * 100;
    setPercentage1(calculatedPercentage.toFixed(3)); // ปัดเศษทศนิยมเป็น 3 ตำแหน่ง
  }, [dataTqf7_3]);
  useEffect(() => {
    const numerator = dataTqf7_3.จำนวนรับเข้า_เริ่มต้น_2 - dataTqf7_3.จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_2;
    const denominator = dataTqf7_3.จำนวนรับเข้า_เริ่มต้น_2;
    const calculatedPercentage = (numerator / denominator) * 100;
    setPercentage2(calculatedPercentage.toFixed(3)); // ปัดเศษทศนิยมเป็น 3 ตำแหน่ง
  }, [dataTqf7_3]);
  useEffect(() => {
    const numerator = dataTqf7_3.จำนวนรับเข้า_เริ่มต้น_3 - dataTqf7_3.จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_3;
    const denominator = dataTqf7_3.จำนวนรับเข้า_เริ่มต้น_3;
    const calculatedPercentage = (numerator / denominator) * 100;
    setPercentage3(calculatedPercentage.toFixed(3)); // ปัดเศษทศนิยมเป็น 3 ตำแหน่ง
  }, [dataTqf7_3]);
  useEffect(() => {
    const numerator = dataTqf7_3.จำนวนรับเข้า_เริ่มต้น_4 - dataTqf7_3.จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_4;
    const denominator = dataTqf7_3.จำนวนรับเข้า_เริ่มต้น_4;
    const calculatedPercentage = (numerator / denominator) * 100;
    setPercentage4(calculatedPercentage.toFixed(3)); // ปัดเศษทศนิยมเป็น 3 ตำแหน่ง
  }, [dataTqf7_3]);
  useEffect(() => {
    const numerator = dataTqf7_3.จำนวนรับเข้า_เริ่มต้น_5 - dataTqf7_3.จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_5;
    const denominator = dataTqf7_3.จำนวนรับเข้า_เริ่มต้น_5;
    const calculatedPercentage = (numerator / denominator) * 100;
    setPercentage5(calculatedPercentage.toFixed(3)); // ปัดเศษทศนิยมเป็น 3 ตำแหน่ง
  }, [dataTqf7_3]);
  
  useEffect(() => {
    const numerator = dataTqf7_3.จำนวนรับเข้า_เริ่มต้น_6 - dataTqf7_3.จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_6;
    const denominator = dataTqf7_3.จำนวนรับเข้า_เริ่มต้น_6;
    const calculatedPercentage = (numerator / denominator) * 100;
    setPercentage6(calculatedPercentage.toFixed(3)); // ปัดเศษทศนิยมเป็น 3 ตำแหน่ง
  }, [dataTqf7_3]);


  useEffect(() => {
    setDateTqf7_3(prevState => ({
      ...prevState,
      percentage1: percentage1,
      percentage2: percentage2,
      percentage3: percentage3,
      percentage4: percentage4,
      percentage5: percentage5,
      percentage6: percentage6
    }));
  }, [percentage1, percentage2, percentage3, percentage4, percentage5, percentage6]);


  const PizZip = require('pizzip');
  const Docxtemplater = require('docxtemplater');
  const handleGenerateDocx = async (e) => {
    e.preventDefault();
    try {
      // เรียก API เพื่อดึงข้อมูลเทมเพลต DOCX
      const response = await axios.get('https://project-in-back.vercel.app/api/gettqf7', {
        params: { id: '4' },
        responseType: 'arraybuffer',
      });
      const userFormData = dataTqf7_3;  // ใช้ dataTqf7_0 ที่ได้จาก state แทน doc.getData()
  
      const zip = new PizZip(response.data);
      doc = new Docxtemplater();
      doc.loadZip(zip);
      doc.setOptions({ linebreaks: true });
  
      doc.setData(userFormData);
  
      doc.render();
  
      const content = doc.getZip().generate({ type: 'blob' });
      const url = URL.createObjectURL(content);
      const link = document.createElement('a');
      link.href = url;
      link.download = `มคอ.7 หมวดที่ 3.docx`;
      link.click();
    } catch (error) {
      console.error('Error generating document:', error);
    }
  };
  let doc;
  const handleChange = (event, property) => {
    setDateTqf7_3((prevData) => ({
      ...prevData,
      [property]: event.target.value,
    }));
  
    if (doc) {
      doc.setData(dataTqf7_3);
    }
  };

  return (
    <form onSubmit={handleGenerateDocx}  >
    <div style={{ width: '100%',marginLeft: '10px'}}>
      <ScrollPanel style={{ width: '100%', height: '950px' }}>
      <Panel style={{ fontFamily: 'Kanit, sans-serif' }} header="ข้อมูลนนักศึกษา">
        {/***********************************************/}
        <div>
          <span>ตารางข้อมูลนนักศึกษา</span><br/><br/>
          <input
        style={{ display: 'none' }}
        id="csv-upload"
        type="file"
        onChange={handleChangeCSV}
      />
      <label htmlFor="csv-upload">
        <IconButton component="span">
          <CloudUploadIcon />   Upload CSV
        </IconButton>
      </label>
      <br/><br/>
      <input
        style={{ display: 'none' }}
        id="excel-upload"
        type="file"
        onChange={handleChangeExcel}
      />
      <label htmlFor="excel-upload">
        <IconButton component="span">
          <CloudUploadIcon />   Upload XLSX
        </IconButton>
      </label>
      <br/><br/>
          <table className='TA'>
            <thead>
              <tr>
                <th className='TH' rowspan="2"><span>{dataTqf7_3.หัวใหญ่}</span></th>
                <th className='TH' colspan="6">จำนวนนักศึกษาคงอยู่ (จำนวนจริง)ในแต่ละปีการศึกษา</th>
              </tr>
              <tr>
                <th className='TH'><span>{dataTqf7_3.ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_1}</span></th>
                <th className='TH'><span>{dataTqf7_3.ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_2}</span></th>
                <th className='TH'><span>{dataTqf7_3.ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_3}</span></th>
                <th className='TH'><span>{dataTqf7_3.ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_4}</span></th>
                <th className='TH'><span>{dataTqf7_3.ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_5}</span></th>
                <th className='TH'><span>{dataTqf7_3.ปีการศึกษาที่รับเข้า_ข้อมูลนักศึกษา_6}</span></th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'><span>{dataTqf7_3.หัว1}</span></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_1} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_1')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_2} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_2')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_3} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_3')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_4} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_4')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_5} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_5')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_6} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_1_6')}></InputText></td>
              </tr>
              <tr>
                <td className='TD'><span>{dataTqf7_3.หัว2}</span></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_1} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_1')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_2} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_2')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_3} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_3')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_4} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_4')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_5} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_5')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_6} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_2_6')}></InputText></td>
              </tr>
              <tr>
                <td className='TD'><span>{dataTqf7_3.หัว3}</span></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_1} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_1')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_2} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_2')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_3} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_3')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_4} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_4')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_5} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_5')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_6} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_3_6')}></InputText></td>
              </tr>
              <tr>
                <td className='TD'><span>{dataTqf7_3.หัว4}</span></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_1} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_1')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_2} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_2')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_3} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_3')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_4} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_4')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_5} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_5')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_6} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_4_6')}></InputText></td>
              </tr>
              <tr>
                <td className='TD'><span>{dataTqf7_3.หัว5}</span></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_1} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_1')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_2} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_2')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_3} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_3')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_4} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_4')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_5} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_5')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_6} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_5_6')}></InputText></td>
              </tr>
              <tr>
                <td className='TD'><span>{dataTqf7_3.หัว6}</span></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_1} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_1')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_2} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_2')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_3} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_3')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_4} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_4')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_5} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_5')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',marginTop:'10px',marginBottom:'10px',textAlign:'center',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_6} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_ข้อมูลนักศึกษา_6_6')}></InputText></td>
              </tr>
            </tbody>
          </table><br/><br/>
          <span>ปัจจัยที่มีผลกระทบต่อจำนวนนักศึกษา</span><br/><br/>
        <InputTextarea autoResize style={{ width: '100%' ,height: "200px",fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.ปัจจัยที่มีผลกระทบต่อจำนวนนักศึกษา_นักศึกษาและบัณฑิต} onChange={(e) => handleChange(e, 'ปัจจัยที่มีผลกระทบต่อจำนวนนักศึกษา_นักศึกษาและบัณฑิต')} /><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel style={{ fontFamily: 'Kanit, sans-serif' }} header="3.1.1 การรับนักศึกษา">
        {/***********************************************/}
        <div>
            <span>การรับนักศึกษา</span><br/><br/>
            <InputTextarea autoResize style={{ width: '100%',height: "120px",fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.การรับนักศึกษา_การรับนักศึกษา} onChange={(e) => handleChange(e, 'การรับนักศึกษา_การรับนักศึกษา')} /><br/><br/>
            <span>ระบบกลไก</span>
            <InputTextarea autoResize style={{ width: '100%',height: "450px",fontFamily: 'Kanit, sans-serif' }} value={dataTqf7_3.ระบบกลไก_การรับนักศึกษา} onChange={(e) => handleChange(e, 'ระบบกลไก_การรับนักศึกษา')} /><br/><br/>
            <span>ผลการดำเนินงาน</span>
            <InputTextarea autoResize style={{ width: '100%',height: "700px",fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.ผลการดำเนินงาน_การรับนักศึกษา} onChange={(e) => handleChange(e, 'ผลการดำเนินงาน_การรับนักศึกษา')}/><br/><br/>
            <span>การประเมินกระบวนการ</span>
            <InputTextarea autoResize style={{ width: '100%' ,height: "100px",fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.การประเมินกระบวนการ_การรับนักศึกษา} onChange={(e) => handleChange(e, 'การประเมินกระบวนการ_การรับนักศึกษา')}/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span>
            <InputTextarea autoResize style={{ width: '100%' ,height: "200px",fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.การปรับปรุงกระบวนการ_การรับนักศึกษา} onChange={(e) => handleChange(e, 'การปรับปรุงกระบวนการ_การรับนักศึกษา')}/><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel style={{ fontFamily: 'Kanit, sans-serif' }} header="3.1.2 การเตรียมความพร้อมก่อนเข้าศึกษา">
        {/***********************************************/}
        <div>
            <span>ระบบกลไก</span>
            <InputTextarea autoResize style={{ width: '100%' ,height: "150px",fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.ระบบกลไก_การเตรียมความพร้อมก่อนเข้าศึกษา}  onChange={(e) => handleChange(e, 'ระบบกลไก_การเตรียมความพร้อมก่อนเข้าศึกษา')}/><br/><br/>
            <span>ผลการดำเนินงาน</span>
            <InputTextarea autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.ผลการดำเนินงาน_การเตรียมความพร้อมก่อนเข้าศึกษา} onChange={(e) => handleChange(e, 'ผลการดำเนินงาน_การเตรียมความพร้อมก่อนเข้าศึกษา')}/><br/><br/>
            <span>การประเมินกระบวนการ</span>
            <InputTextarea autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.การประเมินกระบวนการ_การเตรียมความพร้อมก่อนเข้าศึกษา} onChange={(e) => handleChange(e, 'การประเมินกระบวนการ_การเตรียมความพร้อมก่อนเข้าศึกษา')}/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span>
            <InputTextarea autoResize style={{ width: '100%' ,height: "220px",fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.การปรับปรุงกระบวนการ_การเตรียมความพร้อมก่อนเข้าศึกษา} onChange={(e) => handleChange(e, 'การปรับปรุงกระบวนการ_การเตรียมความพร้อมก่อนเข้าศึกษา')}/><br/><br/>
            <span>การประเมินตนเองจากผลการดำเนินงาน</span>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>เป้าหมาย</th>
                <th className='TH'>ผลการดำเนินงาน</th>
                <th className='TH'>คะแนนการประเมินตนเอง</th>
                <th className='TH'>การบรรลุเป้าหมาย</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'><InputText  style={{width: '100%' ,marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.เป้าหมาย_การประเมินตนเองจากผลการดำเนินงาน_การเตรียมความพร้อมก่อนเข้าศึกษา} onChange={(e) => handleChange(e, 'เป้าหมาย_การประเมินตนเองจากผลการดำเนินงาน_การเตรียมความพร้อมก่อนเข้าศึกษา')}></InputText></td>
                <td className='TD'><InputText  style={{width: '100%' ,marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.ผลการดำเนินงาน_การประเมินตนเองจากผลการดำเนินงาน_การเตรียมความพร้อมก่อนเข้าศึกษา} onChange={(e) => handleChange(e, 'ผลการดำเนินงาน_การประเมินตนเองจากผลการดำเนินงาน_การเตรียมความพร้อมก่อนเข้าศึกษา')}></InputText></td>
                <td className='TD'><InputText  style={{width: '100%' ,marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.คะแนนการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน_การเตรียมความพร้อมก่อนเข้าศึกษา} onChange={(e) => handleChange(e, 'คะแนนการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน_การเตรียมความพร้อมก่อนเข้าศึกษา')}></InputText></td>
                <td className='TD'><InputText  style={{width: '100%' ,marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.การบรรลุเป้าหมาย_การประเมินตนเองจากผลการดำเนินงาน_การเตรียมความพร้อมก่อนเข้าศึกษา} onChange={(e) => handleChange(e, 'การบรรลุเป้าหมาย_การประเมินตนเองจากผลการดำเนินงาน_การเตรียมความพร้อมก่อนเข้าศึกษา')}></InputText></td>
              </tr>
            </tbody>
          </table><br/><br/>
            <span>รายการหลักฐานอ้างอิง</span>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>รหัสเอกสาร</th>
                <th className='TH'>รายการเอกสารหลักฐาน</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'><InputText  style={{width: '100%' ,marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.รหัสเอกสาร_รายการหลักฐานอ้างอิง_การเตรียมความพร้อมก่อนเข้าศึกษา_1} onChange={(e) => handleChange(e, 'รหัสเอกสาร_รายการหลักฐานอ้างอิง_การเตรียมความพร้อมก่อนเข้าศึกษา_1')}></InputText></td>
                <td className='TD'><InputText  style={{width: '100%' ,marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.รหัสเอกสาร_รายการเอกสารหลักฐาน_การเตรียมความพร้อมก่อนเข้าศึกษา_1} onChange={(e) => handleChange(e, 'รหัสเอกสาร_รายการเอกสารหลักฐาน_การเตรียมความพร้อมก่อนเข้าศึกษา_1')}></InputText></td>
              </tr>
              <tr>
                <td className='TD'><InputText  style={{width: '100%' ,marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.รหัสเอกสาร_รายการหลักฐานอ้างอิง_การเตรียมความพร้อมก่อนเข้าศึกษา_2} onChange={(e) => handleChange(e, 'รหัสเอกสาร_รายการหลักฐานอ้างอิง_การเตรียมความพร้อมก่อนเข้าศึกษา_2')}></InputText></td>
                <td className='TD'><InputText  style={{width: '100%' ,marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.รหัสเอกสาร_รายการเอกสารหลักฐาน_การเตรียมความพร้อมก่อนเข้าศึกษา_2} onChange={(e) => handleChange(e, 'รหัสเอกสาร_รายการเอกสารหลักฐาน_การเตรียมความพร้อมก่อนเข้าศึกษา_2')}></InputText></td>
              </tr>
            </tbody>
          </table><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel style={{ fontFamily: 'Kanit, sans-serif' }} header="3.2.1 การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี">
        {/***********************************************/}
        <div>
            <span>การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี</span>
            <InputTextarea autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี_การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี} onChange={(e) => handleChange(e, 'การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี_การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี')}/><br/><br/>
            <span>ผลการดำเนินงาน</span>
            <InputTextarea autoResize style={{ width: '100%' ,height: "500px",fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.ผลดำเนินการ_การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี} onChange={(e) => handleChange(e, 'ผลดำเนินการ_การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี')}/><br/><br/>
            <span>การประเมินกระบวนการ</span>
            <InputTextarea autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.การประเมินกระบวนการ_การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี} onChange={(e) => handleChange(e, 'การประเมินกระบวนการ_การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี')}/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span>
            <InputTextarea autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.การปรับปรุงกระบวนการ_การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี} onChange={(e) => handleChange(e, 'การปรับปรุงกระบวนการ_การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี')}/><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel style={{ fontFamily: 'Kanit, sans-serif' }} header="3.2.2 กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21">
        {/***********************************************/}
        <div>
            <span>ระบบกลไก</span>
            <InputTextarea autoResize style={{ width: '100%',height: "200px" ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.ระบบกลไก_กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่21} onChange={(e) => handleChange(e, 'ระบบกลไก_กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่21')} /><br/><br/>
            <span>ผลการดําเนินงาน</span>
            <InputTextarea autoResize style={{ width: '100%',height: "150px" ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.ผลดำเนินการ_กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่21} onChange={(e) => handleChange(e, 'ผลดำเนินการ_กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่21')} /><br/><br/>
            <span>การประเมินกระบวนการ</span>
            <InputTextarea autoResize style={{ width: '100%',height: "100px" ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.การประเมินกระบวนการ_กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่21} onChange={(e) => handleChange(e, 'การประเมินกระบวนการ_กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่21')} /><br/><br/>
            <span>การปรับปรุงกระบวนการ</span>
            <InputTextarea autoResize style={{ width: '100%',height: "220px" ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.การปรับปรุงกระบวนการ_กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่21} onChange={(e) => handleChange(e, 'การปรับปรุงกระบวนการ_กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่21')} /><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel style={{ fontFamily: 'Kanit, sans-serif' }} header="3.2.3 การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์ แก่บัณฑิตศึกษา">
        {/***********************************************/}
        <div>
            <span>การประเมินตนเองจากผลการดำเนินงาน</span>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>เป้าหมาย</th>
                <th className='TH'>ผลการดำเนินงาน</th>
                <th className='TH'>คะแนนการประเมินตนเอง</th>
                <th className='TH'>การบรรลุเป้าหมาย</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.เป้าหมาย_การประเมินตนเองจากผลการดำเนินงาน_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา} onChange={(e) => handleChange(e, 'เป้าหมาย_การประเมินตนเองจากผลการดำเนินงาน_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.ผลการดำเนินงาน_การประเมินตนเองจากผลการดำเนินงาน_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา} onChange={(e) => handleChange(e, 'ผลการดำเนินงาน_การประเมินตนเองจากผลการดำเนินงาน_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.คะแนนการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา} onChange={(e) => handleChange(e, 'คะแนนการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.การบรรลุเป้าหมาย_การประเมินตนเองจากผลการดำเนินงาน_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา} onChange={(e) => handleChange(e, 'การบรรลุเป้าหมาย_การประเมินตนเองจากผลการดำเนินงาน_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา')}></InputText></td>
              </tr>
            </tbody>
          </table><br/><br/>
            <span>รายการหลักฐานอ้างอิง</span>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>รหัสเอกสาร</th>
                <th className='TH'>รายการเอกสารหลักฐาน</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.รหัสเอกสาร_รายการหลักฐานอ้างอิง_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา_1} onChange={(e) => handleChange(e, 'รหัสเอกสาร_รายการหลักฐานอ้างอิง_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา_1')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.รายการเอกสารหลักฐาน_รายการหลักฐานอ้างอิง_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา_1} onChange={(e) => handleChange(e, 'รายการเอกสารหลักฐาน_รายการหลักฐานอ้างอิง_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา_1')}></InputText></td>
              </tr>
              <tr>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.รหัสเอกสาร_รายการหลักฐานอ้างอิง_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา_2} onChange={(e) => handleChange(e, 'รหัสเอกสาร_รายการหลักฐานอ้างอิง_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา_2')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.รายการเอกสารหลักฐาน_รายการหลักฐานอ้างอิง_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา_2} onChange={(e) => handleChange(e, 'รายการเอกสารหลักฐาน_รายการหลักฐานอ้างอิง_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา_2')}></InputText></td>
              </tr>
              <tr>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.รหัสเอกสาร_รายการหลักฐานอ้างอิง_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา_3} onChange={(e) => handleChange(e, 'รหัสเอกสาร_รายการหลักฐานอ้างอิง_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา_3')}></InputText></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.รายการเอกสารหลักฐาน_รายการหลักฐานอ้างอิง_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา_3} onChange={(e) => handleChange(e, 'รายการเอกสารหลักฐาน_รายการหลักฐานอ้างอิง_การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์แก่บัณฑิตศึกษา_3')}></InputText></td>
              </tr>
            </tbody>
          </table><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel style={{ fontFamily: 'Kanit, sans-serif' }} header="ผลที่เกิดกับนักศึกษา">
        {/***********************************************/}
        <div>
            <span>ข้อมูลนักศึกษา และจำนวนผู้สำเร็จการศึกษาตามแผนการศึกษาและจำนวนผู้สำเร็จการศึกษา</span><br/><br/>
            <span>นักศึกษาคงอยู่ และ สรุปจำนวนผู้สมัคร</span><br/><br/>
            <input
        style={{ display: 'none' }}
        id="csv-upload2"
        type="file"
        onChange={handleChangeCSV2}
      />
      <label htmlFor="csv-upload2">
        <IconButton component="span">
          <CloudUploadIcon />   Upload CSV2
        </IconButton>
      </label>
      <br/><br/>
      <input
        style={{ display: 'none' }}
        id="excel-upload2"
        type="file"
        onChange={handleChangeExcel2}
      />
      <label htmlFor="excel-upload2">
        <IconButton component="span">
          <CloudUploadIcon />   Upload XLSX2
        </IconButton>
      </label>
            <table>
              <thead>
                <tr>
                  <th rowSpan="2"><span>{dataTqf7_3.ปีการศึกษาที่รับเข้า}</span></th>
                  <th rowSpan="2"><span>{dataTqf7_3.จำนวนรับเข้า}</span></th>
                  <th colSpan="6">จำนวนนักศึกษาคงอยู่ ในแต่ละปีการศึกษา (2)</th>
                  <th rowSpan="2"><span>{dataTqf7_3.จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา}</span></th>
                </tr>
                <tr>
                  <th><span>{dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา1}</span></th>
                  <th><span>{dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา2}</span></th>
                  <th><span>{dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา3}</span></th>
                  <th><span>{dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา4}</span></th>
                  <th><span>{dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา5}</span></th>
                  <th><span>{dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา6}</span></th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <th><span>{dataTqf7_3.หัว1_1_1}</span></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนรับเข้า_เริ่มต้น_1} onChange={(e) => handleChange(e, 'จำนวนรับเข้า_เริ่มต้น_1')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_1} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_1')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_2} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_2')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_3} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_3')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_4} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_4')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_5} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_5')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_6} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_1_6')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_1} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_1')}></InputText></th>
                </tr>
                <tr>
                <th><span>{dataTqf7_3.หัว1_2_1}</span></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนรับเข้า_เริ่มต้น_2} onChange={(e) => handleChange(e, 'จำนวนรับเข้า_เริ่มต้น_2')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_1} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_1')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_2} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_2')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_3} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_3')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_4} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_4')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_5} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_5')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_6} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_2_6')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_2} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_2')}></InputText></th>
                </tr>
                <tr>
                <th><span>{dataTqf7_3.หัว1_3_1}</span></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนรับเข้า_เริ่มต้น_3} onChange={(e) => handleChange(e, 'จำนวนรับเข้า_เริ่มต้น_3')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_1} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_1')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_2} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_2')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_3} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_3')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_4} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_4')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_5} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_5')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_6} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_3_6')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_3} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_3')}></InputText></th>
                </tr>
                <tr>
                <th><span>{dataTqf7_3.หัว1_4_1}</span></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนรับเข้า_เริ่มต้น_4} onChange={(e) => handleChange(e, 'จำนวนรับเข้า_เริ่มต้น_4')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_1} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_1')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_2} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_2')}></InputText></th>
                  <th><InputText  style={{width:"100%",width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_3} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_3')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_4} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_4')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_5} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_5')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_6} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_4_6')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_4} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_4')}></InputText></th>
                </tr>
                <tr>
                <th><span>{dataTqf7_3.หัว1_5_1}</span></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนรับเข้า_เริ่มต้น_5} onChange={(e) => handleChange(e, 'จำนวนรับเข้า_เริ่มต้น_5')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_1} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_1')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_2} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_2')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_3} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_3')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_4} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_4')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_5} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_5')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_6} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_5_6')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_5} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_5')}></InputText></th>
                </tr>
                <tr>
                <th><span>{dataTqf7_3.หัว1_6_1}</span></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนรับเข้า_เริ่มต้น_6} onChange={(e) => handleChange(e, 'จำนวนรับเข้า_เริ่มต้น_6')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_1} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_1')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_2} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_2')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_3} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_3')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_4} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_4')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_5} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_5')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_6} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาคงอยู่ในแต่ละปีการศึกษา_6_6')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_6} onChange={(e) => handleChange(e, 'จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_6')}></InputText></th>
                </tr>
              </tbody>
            </table><br/><br/>

            <table>
              <thead>
                <tr>
                  <th rowSpan="2">อัตราการคงอยู่</th>
                  <th >= จำนวนรับเข้า (1) – จำนวน นศ.ที่ลาออกและคัดชื่อออกฯ (3)</th>
                  <th rowSpan="2">*100</th>
                </tr>
                <tr>
                  <th >จำนวนนักศึกษารับเข้า (1)</th>
                </tr>
              </thead>
            </table><br/><br/>

            <table>
              <thead>
              </thead>
              <tbody>
                <tr>
                  <th rowSpan="2">อัตราการคงอยู่ปีการศึกษา 2559 =</th>
                  <th >({dataTqf7_3.จำนวนรับเข้า_เริ่มต้น_1} – {dataTqf7_3.จำนวนนักศึกษาที่ลาออกและคัดชื่อออกสะสมจนถึงสิ้นปีการศึกษา_1})*100</th>
                  <th rowSpan="2">ร้อบละ {percentage1}</th> 
                </tr>
                <tr>
                  <th >{dataTqf7_3.จำนวนรับเข้า_เริ่มต้น_1}</th>
                </tr>
              </tbody>
            </table><br/><br/>

            <table>
              <thead>
              </thead>
              <tbody>
                <tr>
                  <th rowSpan="2">อัตราการคงอยู่ปีการศึกษา 2560 =</th>
                  <th >(40 – 13)*100</th>
                  <th rowSpan="2">= ร้อยละ {percentage2}</th>
                </tr>
                <tr>
                  <th >40</th>
                </tr>
              </tbody>
            </table><br/><br/>

            <table>
              <thead>
              </thead>
              <tbody>
                <tr>
                  <th rowSpan="2">อัตราการคงอยู่ปีการศึกษา 2561 =</th>
                  <th >(40 – 1)*100</th>
                  <th rowSpan="2">= ร้อยละ {percentage3}</th>
                </tr>
                <tr>
                  <th >40</th>
                </tr>
              </tbody>
            </table><br/><br/>

            <table>
              <thead>
              </thead>
              <tbody>
                <tr>
                  <th rowSpan="2">อัตราการคงอยู่ปีการศึกษา 2562 =</th>
                  <th >(27 – 1)*100</th>
                  <th rowSpan="2">= ร้อยละ {percentage4}</th>
                </tr>
                <tr>
                  <th >27</th>
                </tr>
              </tbody>
            </table><br/><br/>

            <table>
              <thead>
              </thead>
              <tbody>
                <tr>
                  <th rowSpan="2">อัตราการคงอยู่ปีการศึกษา 2563 =</th>
                  <th >(39 – 6)*100</th>
                  <th rowSpan="2">= ร้อยละ {percentage5}</th>
                </tr>
                <tr>
                  <th >39</th>
                </tr>
              </tbody>
            </table><br/><br/>

            <table>
              <thead>
              </thead>
              <tbody>
                <tr>
                  <th rowSpan="2">อัตราการคงอยู่ปีการศึกษา 2564 =</th>
                  <th >(40 – 3)*100</th>
                  <th rowSpan="2">= ร้อยละ {percentage6}</th>
                </tr>
                <tr>
                  <th >40</th>
                </tr>
              </tbody>
            </table><br/><br/>
            <input
        style={{ display: 'none' }}
        id="csv-upload3"
        type="file"
        onChange={handleChangeCSV3}
      />
      <label htmlFor="csv-upload3">
        <IconButton component="span">
          <CloudUploadIcon />   Upload CSV3
        </IconButton>
      </label>
      <br/><br/>
      <input
        style={{ display: 'none' }}
        id="excel-upload3"
        type="file"
        onChange={handleChangeExcel3}
      />
      <label htmlFor="excel-upload3">
        <IconButton component="span">
          <CloudUploadIcon />   Upload XLSX3
        </IconButton>
      </label>

            <table>
              <thead>
                <tr>
                  <th rowSpan="2"><span>{dataTqf7_3.ปีการศึกษา}</span></th>
                  <th rowSpan="2"><span>{dataTqf7_3.จำนวนรับเข้า1}</span></th>
                  <th colSpan="6">จำนวนผู้สำเร็จการศึกษาตามหลักสูตร (2)</th>
                </tr>
                <tr>
                  <th><span>{dataTqf7_3.ปีการศึกษา_1}</span></th>
                  <th><span>{dataTqf7_3.ปีการศึกษา_2}</span></th>
                  <th><span>{dataTqf7_3.ปีการศึกษา_3}</span></th>
                  <th><span>{dataTqf7_3.ปีการศึกษา_4}</span></th>
                  <th><span>{dataTqf7_3.ปีการศึกษา_5}</span></th>
                  <th><span>{dataTqf7_3.ปีการศึกษา_6}</span></th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <th><span>{dataTqf7_3.ปีการศึกษา_1_1}</span></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนรับเข้า_1} onChange={(e) => handleChange(e, 'จำนวนรับเข้า_1')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_1} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_1')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_2} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_2')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_3} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_3')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_4} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_4')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_5} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_5')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_6} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_1_6')}></InputText></th>
                </tr>
                <tr>
                <th><span>{dataTqf7_3.ปีการศึกษา_1_2}</span></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนรับเข้า_2} onChange={(e) => handleChange(e, 'จำนวนรับเข้า_2')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_1} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_1')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_2} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_2')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_3} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_3')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_4} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_4')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_5} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_5')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_6} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_2_6')}></InputText></th>
                </tr>
                <tr>
                <th><span>{dataTqf7_3.ปีการศึกษา_1_3}</span></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนรับเข้า_3} onChange={(e) => handleChange(e, 'จำนวนรับเข้า_3')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_1} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_1')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_2} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_2')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_3} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_3')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_4} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_4')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_5} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_5')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_6} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_3_6')}></InputText></th>
                </tr>
                <tr>
                <th><span>{dataTqf7_3.ปีการศึกษา_1_4}</span></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนรับเข้า_4} onChange={(e) => handleChange(e, 'จำนวนรับเข้า_4')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_1} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_1')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_2} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_2')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_3} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_3')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_4} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_4')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_5} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_5')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_6} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_4_6')}></InputText></th>
                </tr>
                <tr>
                <th><span>{dataTqf7_3.ปีการศึกษา_1_5}</span></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนรับเข้า_5} onChange={(e) => handleChange(e, 'จำนวนรับเข้า_5')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_1} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_1')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_2} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_2')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_3} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_3')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_4} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_4')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_5} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_5')}></InputText></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_6} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาตามหลักสูตร_5_6')}></InputText></th>
                </tr>
              </tbody>
            </table>

            <span>ปัจจัยที่ส่งผลกระทบต่อจำนวนนักศึกษา</span>
            <InputTextarea autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.ปัจจัย_1}/><br/><br/>
            <span>การประเมินความพึงพอใจของนักศึกษา</span>
            <InputTextarea autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.การประเมินความพึงพอใจของนักศึกษา}/><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel style={{ fontFamily: 'Kanit, sans-serif' }} header="การจัดการข้อร้องเรียนของนักศึกษา">
        {/***********************************************/}
        <div>
            <span>ระบบกลไก</span>
            <InputTextarea autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.ระบบกลไก_การจัดการข้อร้องเรียนของนักศึกษา} onChange={(e) => handleChange(e, 'ระบบกลไก_การจัดการข้อร้องเรียนของนักศึกษา')}/><br/><br/>
            <span>ผลการดําเนินงาน</span>
            <InputTextarea autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.ผลดำเนินการ_การจัดการข้อร้องเรียนของนักศึกษา} onChange={(e) => handleChange(e, 'ผลดำเนินการ_การจัดการข้อร้องเรียนของนักศึกษา')}/><br/><br/>
            <span>การประเมินกระบวนการ</span>
            <InputTextarea autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.การประเมินกระบวนการ_การจัดการข้อร้องเรียนของนักศึกษา} onChange={(e) => handleChange(e, 'การประเมินกระบวนการ_การจัดการข้อร้องเรียนของนักศึกษา')}/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span>
            <InputTextarea autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.การปรับปรุงกระบวนการ_การจัดการข้อร้องเรียนของนักศึกษา} onChange={(e) => handleChange(e, 'การปรับปรุงกระบวนการ_การจัดการข้อร้องเรียนของนักศึกษา')}/><br/><br/>

        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel style={{ fontFamily: 'Kanit, sans-serif' }} header="3.3.1 การคงอยู่">
            <span>การคงอยู่</span>
            <InputTextarea autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.การคงอยู่_การคงอยู่} onChange={(e) => handleChange(e, 'การคงอยู่_การคงอยู่')}/>
      </Panel><br/><br/>
      <Panel style={{ fontFamily: 'Kanit, sans-serif' }} header="3.3.2 การสำเร็จการศึกษา">
            <span>การสำเร็จการศึกษา</span><br/><br/>
            <InputTextarea autoResize style={{ width: '100%',fontFamily: 'Kanit, sans-serif' }} value={dataTqf7_3.การสำเร็จการศึกษา_การสำเร็จการศึกษา} onChange={(e) => handleChange(e, 'การสำเร็จการศึกษา_การสำเร็จการศึกษา')}/><br/><br/>
      </Panel><br/><br/>
      <Panel style={{ fontFamily: 'Kanit, sans-serif' }} header="3.3.3 ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา">
            <span>ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา</span><br/><br/>
            <InputTextarea autoResize style={{ width: '100%',fontFamily: 'Kanit, sans-serif' }}value={dataTqf7_3.ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา_ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา} onChange={(e) => handleChange(e, 'ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา_ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา')}/><br/><br/>
            <span>การประเมินตนเองจากผลการดำเนินงาน</span><br/><br/>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>เป้าหมาย</th>
                <th className='TH'>ผลการดำเนินงาน</th>
                <th className='TH'>คะแนนการประเมินตนเอง</th>
                <th className='TH'>การบรรลุเป้าหมาย</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}}value={dataTqf7_3.ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา_การประเมินตนเองจากผลการดำเนินงาน_เป้าหมาย} onChange={(e) => handleChange(e, 'ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา_การประเมินตนเองจากผลการดำเนินงาน_เป้าหมาย')}/><br/><br/></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}}value={dataTqf7_3.ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา_การประเมินตนเองจากผลการดำเนินงาน_ผลการดำเนินงาน} onChange={(e) => handleChange(e, 'ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา_การประเมินตนเองจากผลการดำเนินงาน_ผลการดำเนินงาน')}/></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}}value={dataTqf7_3.ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา_การประเมินตนเองจากผลการดำเนินงาน_คะแนนการประเมินตนเอง} onChange={(e) => handleChange(e, 'ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา_การประเมินตนเองจากผลการดำเนินงาน_คะแนนการประเมินตนเอง')}/></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}}value={dataTqf7_3.ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา_การประเมินตนเองจากผลการดำเนินงาน_การบรรลุเป้าหมาย} onChange={(e) => handleChange(e, 'ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา_การประเมินตนเองจากผลการดำเนินงาน_การบรรลุเป้าหมาย')}/></td>
              </tr>
            </tbody>
          </table><br/><br/>

            <span>รายการหลักฐานอ้างอิง</span><br/><br/>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>รหัสเอกสาร</th>
                <th className='TH'>รายการเอกสารหลักฐาน</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}}value={dataTqf7_3.รายการหลักฐานอ้างอิง_รหัสเอกสาร} onChange={(e) => handleChange(e, 'รายการหลักฐานอ้างอิง_รหัสเอกสาร')}/></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}}value={dataTqf7_3.รายการหลักฐานอ้างอิง_รายการเอกสารหลักฐาน} onChange={(e) => handleChange(e, 'รายการหลักฐานอ้างอิง_รายการเอกสารหลักฐาน')}/></td>
              </tr>
            </tbody>
          </table><br/><br/>
      </Panel><br/><br/>
        
      <Panel style={{ fontFamily: 'Kanit, sans-serif' }} header="ตัวบ่งชี้ที่ 2.1 คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ">
        {/***********************************************/}
        <div>
            <span>ผลการดำเนินงาน</span>
            <InputTextarea autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา_ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา} onChange={(e) => handleChange(e, 'ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา_ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา')}/><br/><br/>
            <span>ข้อมูลประกอบการคำนวณคุณภาพของบัณฑิตหลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์</span><br/><br/>
            <table>
              <thead>
                <tr>
                  <th>ลำดับที่</th>
                  <th>ข้อมูลพื้นฐานประกอบตัวบ่งชี้</th>
                  <th>หน่วยวัด</th>
                  <th>รวม</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <th colSpan="2">คุณภาพของบัณฑิตปริญญาตรี/โท/เอก ตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ </th>
                  <th>เฉลี่ย</th>
                  <th><InputText autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.คุณภาพของบัณฑิตปริญญาตรีโทเอกตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_รวม} onChange={(e) => handleChange(e, 'คุณภาพของบัณฑิตปริญญาตรีโทเอกตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_รวม')}/></th>
                </tr>
                <tr>
                  <th>1</th>
                  <th>จำนวนผู้สำเร็จการศึกษาทั้งหมด</th>
                  <th>คน</th>
                  <th><InputText autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.จำนวนผู้สำเร็จการศึกษาทั้งหมด_รวม} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาทั้งหมด_รวม')}/></th>
                </tr>
                <tr>
                  <th>2</th>
                  <th>จำนวนผู้สำเร็จการศึกษาที่ได้รับการประเมินคุณภาพตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ </th>
                  <th>คน</th>
                  <th><InputText autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.จำนวนผู้สำเร็จการศึกษาที่ได้รับการประเมินคุณภาพตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_รวม} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาที่ได้รับการประเมินคุณภาพตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_รวม')}/></th>
                </tr>
                <tr>
                  <th>3</th>
                  <th>ผลการประเมินจากความพึงพอใจของผู้ใช้บัณฑิต</th>
                  <th>คะแนน</th>
                  <th></th>
                </tr>
                <tr>
                  <th></th>
                  <th>(1) ด้านคุณธรรมจริยธรรม</th>
                  <th>คะแนน</th>
                  <th><InputText autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.ผลการประเมินจากความพึงพอใจของผู้ใช้บัณฑิต_ด้านคุณธรรมจริยธรรม_รวม} onChange={(e) => handleChange(e, 'ผลการประเมินจากความพึงพอใจของผู้ใช้บัณฑิต_ด้านคุณธรรมจริยธรรม_รวม')}/></th>
                </tr>
                <tr>
                  <th></th>
                  <th>(2) ด้านความรู้</th>
                  <th>คะแนน</th>
                  <th><InputText autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.ผลการประเมินจากความพึงพอใจของผู้ใช้บัณฑิต_ด้านความรู้_รวม} onChange={(e) => handleChange(e, 'ผลการประเมินจากความพึงพอใจของผู้ใช้บัณฑิต_ด้านความรู้_รวม')}/></th>
                </tr>
                <tr>
                  <th></th>
                  <th>(3) ด้านทักษะทางปัญญา</th>
                  <th>คะแนน</th>
                  <th><InputText autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.ผลการประเมินจากความพึงพอใจของผู้ใช้บัณฑิต_ด้านทักษะทางปัญญา_รวม} onChange={(e) => handleChange(e, 'ผลการประเมินจากความพึงพอใจของผู้ใช้บัณฑิต_ด้านทักษะทางปัญญา_รวม')}/></th>
                </tr>
                <tr>
                  <th></th>
                  <th>(4) ด้านทักษะความสัมพันธ์ระหว่างบุคคล</th>
                  <th>คะแนน</th>
                  <th><InputText autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.ผลการประเมินจากความพึงพอใจของผู้ใช้บัณฑิต_ด้านทักษะความสัมพันธ์ระหว่างบุคคล_รวม} onChange={(e) => handleChange(e, 'ผลการประเมินจากความพึงพอใจของผู้ใช้บัณฑิต_ด้านทักษะความสัมพันธ์ระหว่างบุคคล_รวม')}/></th>
                </tr>
                <tr>
                  <th></th>
                  <th>(5) ด้านทักษะการวิเคราะห์เชิงตัวเลข การสื่อสารและการใช้</th>
                  <th>คะแนน</th>
                  <th><InputText autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.ผลการประเมินจากความพึงพอใจของผู้ใช้บัณฑิต_ด้านทักษะการวิเคราะห์เชิงตัวเลขการสื่อสารและการใช้_รวม} onChange={(e) => handleChange(e, 'ผลการประเมินจากความพึงพอใจของผู้ใช้บัณฑิต_ด้านทักษะการวิเคราะห์เชิงตัวเลขการสื่อสารและการใช้_รวม')}/></th>
                </tr>
                <tr>
                  <th>4</th>
                  <th>อัตลักษณ์ของบัณฑิต</th>
                  <th>คน</th>
                  <th><InputText autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.อัตลักษณ์ของบัณฑิต_รวม} onChange={(e) => handleChange(e, 'อัตลักษณ์ของบัณฑิต_รวม')}/></th>
                </tr>
                <tr>
                  <th>5</th>
                  <th>ระดับความพึงพอใจในคุณลักษณะของบัณฑิตและผลการปฏิบัติงานของบัณฑิต</th>
                  <th>คน</th>
                  <th><InputText autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.ระดับความพึงพอใจในคุณลักษณะของบัณฑิตและผลการปฏิบัติงานของบัณฑิต_รวม} onChange={(e) => handleChange(e, 'ระดับความพึงพอใจในคุณลักษณะของบัณฑิตและผลการปฏิบัติงานของบัณฑิต_รวม')}/></th>
                </tr>
                <tr>
                  <th>6</th>
                  <th>ผู้ตอบแบบประเมินความพึงพอใจของผู้ใช้บัณฑิตที่มีต่อผู้สำเร็จการศึกษา</th>
                  <th>ร้อยละ</th>
                  <th><InputText autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.ผู้ตอบแบบประเมินความพึงพอใจของผู้ใช้บัณฑิตที่มีต่อผู้สำเร็จการศึกษา_รวม} onChange={(e) => handleChange(e, 'ผู้ตอบแบบประเมินความพึงพอใจของผู้ใช้บัณฑิตที่มีต่อผู้สำเร็จการศึกษา_รวม')}/></th>
                </tr>
              </tbody>
            </table><br/><br/>

            <span>การประเมินตนเองจากผลการดำเนินงาน</span><br/><br/>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>เป้าหมาย</th>
                <th className='TH'>ผลการดำเนินงาน</th>
                <th className='TH'>คะแนนการประเมินตนเอง</th>
                <th className='TH'>การบรรลุเป้าหมาย</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'><InputText autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_การประเมินตนเองจากผลการดำเนินงาน_เป้าหมาย} onChange={(e) => handleChange(e, 'คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_การประเมินตนเองจากผลการดำเนินงาน_เป้าหมาย')}/></td>
                <td className='TD'><InputText autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_การประเมินตนเองจากผลการดำเนินงาน_ผลการดำเนินงาน} onChange={(e) => handleChange(e, 'คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_การประเมินตนเองจากผลการดำเนินงาน_ผลการดำเนินงาน')}/></td>
                <td className='TD'><InputText autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_การประเมินตนเองจากผลการดำเนินงาน_คะแนนการประเมินตนเอง} onChange={(e) => handleChange(e, 'คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_การประเมินตนเองจากผลการดำเนินงาน_คะแนนการประเมินตนเอง')}/></td>
                <td className='TD'><InputText autoResize style={{ width: '100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_การประเมินตนเองจากผลการดำเนินงาน_การบรรลุเป้าหมาย} onChange={(e) => handleChange(e, 'คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_การประเมินตนเองจากผลการดำเนินงาน_การบรรลุเป้าหมาย')}/></td>
              </tr>
            </tbody>
          </table><br/><br/>

            <span>รายการหลักฐานอ้างอิง</span><br/><br/>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>รหัสเอกสาร</th>
                <th className='TH'>รายการเอกสารหลักฐาน</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'><InputText autoResize style={{ width: '100%',fontFamily: 'Kanit, sans-serif' }} value={dataTqf7_3.คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_รายการหลักฐานอ้างอิง_รหัสเอกสาร} onChange={(e) => handleChange(e, 'คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_รายการหลักฐานอ้างอิง_รหัสเอกสาร')}/></td>
                <td className='TD'><InputTextarea autoResize style={{ marginLeft:'10px',width: '1000px',height:'100%' ,fontFamily: 'Kanit, sans-serif'}} value={dataTqf7_3.คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_รายการหลักฐานอ้างอิง_รายการเอกสารหลักฐาน} onChange={(e) => handleChange(e, 'คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_รายการหลักฐานอ้างอิง_รายการเอกสารหลักฐาน')}/></td>
              </tr>
            </tbody>
          </table><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel style={{ fontFamily: 'Kanit, sans-serif' }} header="ตัวบ่งชี้ที่ 2.2 ร้อยละของบัณฑิตปริญญาตรีที่ได้งานทําหรือประกอบอาชีพอิสระภายใน 1 ปี">
        {/***********************************************/}
        <div>
            <span>ผลการดำเนินงาน</span>
            <InputTextarea autoResize style={{ width: '100%',fontFamily: 'Kanit, sans-serif' }} value={dataTqf7_3.ร้อยละของบัณฑิตปริญญาตรีที่ได้งานทําหรือประกอบอาชีพอิสระภายใน1ปี_ผลดำเนินงาน} onChange={(e) => handleChange(e, 'ร้อยละของบัณฑิตปริญญาตรีที่ได้งานทําหรือประกอบอาชีพอิสระภายใน1ปี_ผลดำเนินงาน')}/><br/><br/>

            <span>ข้อมูลประกอบการคำนวณภาวะการมีงานทำหรือประกอบอาชีพอิสระของบัณฑิตที่สำเร็จการศึกษา</span>
            <table>
              <thead>
                <tr>
                  <th>ลำดับที่</th>
                  <th>ข้อมูลพื้นฐานประกอบตัวบ่งชี้</th>
                  <th>หน่วยวัด</th>
                  <th>ผลการดำเนินงาน</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <th colSpan="2">บัณฑิตปริญญาตรีที่ได้งานทำหรือประกอบอาชีพอิสระภายใน 1 ปี</th>
                  <th>ร้อยละ</th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.บัณฑิตปริญญาตรีที่ได้งานทำหรือประกอบอาชีพอิสระภายใน1ปี_ผลการดำเนินงาน} onChange={(e) => handleChange(e, 'บัณฑิตปริญญาตรีที่ได้งานทำหรือประกอบอาชีพอิสระภายใน1ปี_ผลการดำเนินงาน')}></InputText></th>
                </tr>
                <tr>
                  <th>1</th>
                  <th>จำนวนบัณฑิตระดับปริญญาตรีทั้งหมด</th>
                  <th>คน</th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนบัณฑิตระดับปริญญาตรีทั้งหมด_ผลการดำเนินงาน} onChange={(e) => handleChange(e, 'จำนวนบัณฑิตระดับปริญญาตรีทั้งหมด_ผลการดำเนินงาน')}/></th>
                </tr>
                <tr>
                  <th>2</th>
                  <th>จำนวนบัณฑิตระดับปริญญาตรีที่ตอบแบบสำรวจเรื่องการมีงานทำ</th>
                  <th>คน</th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนบัณฑิตระดับปริญญาตรีที่ตอบแบบสำรวจเรื่องการมีงานทำ_ผลการดำเนินงาน} onChange={(e) => handleChange(e, 'จำนวนบัณฑิตระดับปริญญาตรีที่ตอบแบบสำรวจเรื่องการมีงานทำ_ผลการดำเนินงาน')}/></th>
                </tr>
                <tr>
                  <th>3</th>
                  <th>จำนวนบัณฑิตระดับปริญญาตรีที่ได้งานทำหลังสำเร็จการศึกษา (ไม่นับรวมผู้ที่ประกอบอาชีพอิสระ)</th>
                  <th>คน</th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนบัณฑิตระดับปริญญาตรีที่ได้งานทำหลังสำเร็จการศึกษาไม่นับรวมผู้ที่ประกอบอาชีพอิสระ_ผลการดำเนินงาน} onChange={(e) => handleChange(e, 'จำนวนบัณฑิตระดับปริญญาตรีที่ได้งานทำหลังสำเร็จการศึกษาไม่นับรวมผู้ที่ประกอบอาชีพอิสระ_ผลการดำเนินงาน')}/></th>
                </tr>
                <tr>
                  <th>4</th>
                  <th>จำนวนบัณฑิตระดับปริญญาตรีที่ประกอบอาชีพอิสระ</th>
                  <th>คน</th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนบัณฑิตระดับปริญญาตรีที่ประกอบอาชีพอิสระ_ผลการดำเนินงาน} onChange={(e) => handleChange(e, 'จำนวนบัณฑิตระดับปริญญาตรีที่ประกอบอาชีพอิสระ_ผลการดำเนินงาน')}/></th>
                </tr>
                <tr>
                  <th>5</th>
                  <th>จำนวนผู้สำเร็จการศึกษาระดับปริญญาตรีที่มีงานทำก่อนเข้าศึกษา</th>
                  <th>คน</th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนผู้สำเร็จการศึกษาระดับปริญญาตรีที่มีงานทำก่อนเข้าศึกษา_ผลการดำเนินงาน} onChange={(e) => handleChange(e, 'จำนวนผู้สำเร็จการศึกษาระดับปริญญาตรีที่มีงานทำก่อนเข้าศึกษา_ผลการดำเนินงาน')}/></th>
                </tr>
                <tr>
                  <th>6</th>
                  <th>จำนวนบัณฑิตระดับปริญญาตรีที่มีกิจการของตนเองที่มีรายได้ประจำอยู่แล้ว</th>
                  <th>คน</th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนบัณฑิตระดับปริญญาตรีที่มีกิจการของตนเองที่มีรายได้ประจำอยู่แล้ว_ผลการดำเนินงาน} onChange={(e) => handleChange(e, 'จำนวนบัณฑิตระดับปริญญาตรีที่มีกิจการของตนเองที่มีรายได้ประจำอยู่แล้ว_ผลการดำเนินงาน')}/></th>
                </tr>
                <tr>
                  <th>7</th>
                  <th>จำนวนบัณฑิตระดับปริญญาตรีที่ศึกษาต่อระดับบัณฑิตศึกษา</th>
                  <th>คน</th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนบัณฑิตระดับปริญญาตรีที่ศึกษาต่อระดับบัณฑิตศึกษา_ผลการดำเนินงาน} onChange={(e) => handleChange(e, 'จำนวนบัณฑิตระดับปริญญาตรีที่ศึกษาต่อระดับบัณฑิตศึกษา_ผลการดำเนินงาน')}/></th>
                </tr>
                <tr>
                  <th>8</th>
                  <th>จำนวนบัณฑิตระดับปริญญาตรีที่อุปสมบท</th>
                  <th>คน</th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนบัณฑิตระดับปริญญาตรีที่อุปสมบท_ผลการดำเนินงาน} onChange={(e) => handleChange(e, 'จำนวนบัณฑิตระดับปริญญาตรีที่อุปสมบท_ผลการดำเนินงาน')}/></th>
                </tr>
                <tr>
                  <th>9</th>
                  <th>จำนวนบัณฑิตระดับปริญญาตรีที่เกณฑ์ทหาร</th>
                  <th>คน</th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.จำนวนบัณฑิตระดับปริญญาตรีที่เกณฑ์ทหาร_ผลการดำเนินงาน} onChange={(e) => handleChange(e, 'จำนวนบัณฑิตระดับปริญญาตรีที่เกณฑ์ทหาร_ผลการดำเนินงาน')}/></th>
                </tr>
                <tr>
                  <th>10</th>
                  <th>ระดับความพึงพอใจในคุณลักษณะของบัณฑิตและผลการปฏิบัติงานของบัณฑิต</th>
                  <th>ค่าเฉลี่ย</th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.เงินเดือนหรือรายได้ต่อเดือนของผู้สำเร็จการศึกษาระดับปริญญาตรีที่ได้งานทำหรือประกอบอาชีพอิสระ_ผลการดำเนินงาน} onChange={(e) => handleChange(e, 'เงินเดือนหรือรายได้ต่อเดือนของผู้สำเร็จการศึกษาระดับปริญญาตรีที่ได้งานทำหรือประกอบอาชีพอิสระ_ผลการดำเนินงาน')}/></th>
                </tr>
                <tr>
                  <th>11</th>
                  <th>ร้อยละของผู้ตอบแบบสำรวจเรื่องการมีงานทำ (อย่างน้อยร้อยละ 70)</th>
                  <th>ร้อยละ</th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.ร้อยละของผู้ตอบแบบสำรวจเรื่องการมีงานทำอย่างน้อยร้อยละ70_ผลการดำเนินงาน} onChange={(e) => handleChange(e, 'ร้อยละของผู้ตอบแบบสำรวจเรื่องการมีงานทำอย่างน้อยร้อยละ70_ผลการดำเนินงาน')}/></th>
                </tr>
              </tbody>
            </table>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel style={{ fontFamily: 'Kanit, sans-serif' }} header="สรุปผลการประเมินตนเององค์ประกอบที่ 2 บัณฑิต และองค์ประกอบที่ 3 นักศึกษา">
        {/***********************************************/}
        <div>
            <span>องค์ประกอบที่ 2 บัณฑิต</span><br/><br/>
            <span>ผลการประเมินตนเองตามองค์ประกอบ</span><br/><br/>

            <table>
              <thead>
                <tr>
                  <th>ตัวบ่งชี้ที่</th>
                  <th>ผลการดำเนินงาน</th>
                  <th>คะแนนการประเมินตนเอง</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <th>ตัวบ่งชี้ที่  2.1  คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ</th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.บัณฑิต_ผลการประเมินตนเองตามองค์ประกอบ_คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_ผลการดำเนินงาน} onChange={(e) => handleChange(e, 'บัณฑิต_ผลการประเมินตนเองตามองค์ประกอบ_คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_ผลการดำเนินงาน')}/></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.บัณฑิต_ผลการประเมินตนเองตามองค์ประกอบ_คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_คะแนนการประเมินตนเอง} onChange={(e) => handleChange(e, 'บัณฑิต_ผลการประเมินตนเองตามองค์ประกอบ_คุณภาพบัณฑิตตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ_คะแนนการประเมินตนเอง')}/></th>
                </tr>
                <tr>
                  <th>ตัวบ่งชี้ที่  2.2  ร้อยละของบัณฑิตปริญญาตรีที่ได้งานทําหรือประกอบอาชีพอิสระภายใน 1 ปี</th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.บัณฑิต_ผลการประเมินตนเองตามองค์ประกอบ_ร้อยละของบัณฑิตปริญญาตรีที่ได้งานทําหรือประกอบอาชีพอิสระภายใน1ปี_ผลการดำเนินงาน} onChange={(e) => handleChange(e, 'บัณฑิต_ผลการประเมินตนเองตามองค์ประกอบ_ร้อยละของบัณฑิตปริญญาตรีที่ได้งานทําหรือประกอบอาชีพอิสระภายใน1ปี_ผลการดำเนินงาน')}/></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.บัณฑิต_ผลการประเมินตนเองตามองค์ประกอบ_ร้อยละของบัณฑิตปริญญาตรีที่ได้งานทําหรือประกอบอาชีพอิสระภายใน1ปี_คะแนนการประเมินตนเอง} onChange={(e) => handleChange(e, 'บัณฑิต_ผลการประเมินตนเองตามองค์ประกอบ_ร้อยละของบัณฑิตปริญญาตรีที่ได้งานทําหรือประกอบอาชีพอิสระภายใน1ปี_คะแนนการประเมินตนเอง')}/></th>
                </tr>
                <tr>
                  <th>คะแนนเฉลี่ยผลการดำเนินงานองค์ประกอบที่ 2</th>
                  <th colSpan="2"><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.บัณฑิต_ผลการประเมินตนเองตามองค์ประกอบ_คะแนนเฉลี่ยผลการดำเนินงานองค์ประกอบที่2} onChange={(e) => handleChange(e, 'บัณฑิต_ผลการประเมินตนเองตามองค์ประกอบ_คะแนนเฉลี่ยผลการดำเนินงานองค์ประกอบที่2')}/></th>
                </tr>
              </tbody>
            </table><br/><br/>

            <span>องค์ประกอบที่ 3  นักศึกษา</span><br/><br/>
            <span>ผลการประเมินตนเองตามองค์ประกอบ</span><br/><br/>

            <table>
              <thead>
                <tr>
                  <th>ตัวบ่งชี้ที่</th>
                  <th>ผลการดำเนินงาน</th>
                  <th>คะแนนการประเมินตนเอง</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <th>ตัวบ่งชี้ที่  3.1  การรับนักศึกษา</th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_การรับนักศึกษา_ผลการดำเนินงาน} onChange={(e) => handleChange(e, 'นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_การรับนักศึกษา_ผลการดำเนินงาน')}/></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_การรับนักศึกษา_คะแนนการประเมินตนเอง} onChange={(e) => handleChange(e, 'นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_การรับนักศึกษา_คะแนนการประเมินตนเอง')}/></th>
                </tr>
                <tr>
                  <th>ตัวบ่งชี้ที่  3.2  การส่งเสริมและพัฒนานักศึกษา</th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_การส่งเสริมและพัฒนานักศึกษา_ผลการดำเนินงาน} onChange={(e) => handleChange(e, 'นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_การส่งเสริมและพัฒนานักศึกษา_ผลการดำเนินงาน')}/></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_การส่งเสริมและพัฒนานักศึกษา_คะแนนการประเมินตนเอง} onChange={(e) => handleChange(e, 'นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_การส่งเสริมและพัฒนานักศึกษา_คะแนนการประเมินตนเอง')}/></th>
                </tr>
                <tr>
                  <th>ตัวบ่งชี้ที่  3.3  ผลที่เกิดกับนักศึกษา</th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_ผลที่เกิดกับนักศึกษา_ผลการดำเนินงาน} onChange={(e) => handleChange(e, 'นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_ผลที่เกิดกับนักศึกษา_ผลการดำเนินงาน')}/></th>
                  <th><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_ผลที่เกิดกับนักศึกษา_คะแนนการประเมินตนเอง} onChange={(e) => handleChange(e, 'นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_ผลที่เกิดกับนักศึกษา_คะแนนการประเมินตนเอง')}/></th>
                </tr>
                <tr>
                  <th>คะแนนเฉลี่ยผลการดำเนินงานองค์ประกอบที่ 3</th>
                  <th colSpan="2"><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_คะแนนเฉลี่ยผลการดำเนินงานองค์ประกอบที่3} onChange={(e) => handleChange(e, 'นักศึกษา_ผลการประเมินตนเองตามองค์ประกอบ_คะแนนเฉลี่ยผลการดำเนินงานองค์ประกอบที่3')}/></th>
                </tr>
              </tbody>
            </table><br/><br/>
            
            <span>การประเมินตนเองจากผลการดำเนินงาน</span><br/><br/>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>เป้าหมาย</th>
                <th className='TH'>ผลการดำเนินงาน</th>
                <th className='TH'>คะแนนการประเมินตนเอง</th>
                <th className='TH'>การบรรลุเป้าหมาย</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.สรุปผลการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน_เป้าหมาย} onChange={(e) => handleChange(e, 'สรุปผลการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน_เป้าหมาย')}/></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.สรุปผลการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน_ผลการดำเนินงาน} onChange={(e) => handleChange(e, 'สรุปผลการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน_ผลการดำเนินงาน')}/></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.สรุปผลการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน_คะแนนการประเมินตนเอง} onChange={(e) => handleChange(e, 'สรุปผลการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน_คะแนนการประเมินตนเอง')}/></td>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.สรุปผลการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน_การบรรลุเป้าหมาย} onChange={(e) => handleChange(e, 'สรุปผลการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน_การบรรลุเป้าหมาย')}/></td>
              </tr>
            </tbody>
          </table><br/><br/>

            <span>รายการหลักฐานอ้างอิง</span><br/><br/>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>รหัสเอกสาร</th>
                <th className='TH'>รายการเอกสารหลักฐาน</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'><InputText  style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.สรุปผลการประเมินตนเอง_รายการหลักฐานอ้างอิง_รหัสเอกสาร} onChange={(e) => handleChange(e, 'สรุปผลการประเมินตนเอง_รายการหลักฐานอ้างอิง_รหัสเอกสาร')}/></td>
                <td className='TD'><InputTextarea style={{width:"100%",marginLeft:'10px',fontFamily: 'Kanit, sans-serif'}} value = {dataTqf7_3.สรุปผลการประเมินตนเอง_รายการหลักฐานอ้างอิง_รายการเอกสารหลักฐาน} onChange={(e) => handleChange(e, 'สรุปผลการประเมินตนเอง_รายการหลักฐานอ้างอิง_รายการเอกสารหลักฐาน')}/></td>
              </tr>
            </tbody>
          </table><br/><br/>
          <Button type="submit" style={{ marginLeft: '40%',fontFamily: 'Kanit, sans-serif' }} label="ยืนยัน"/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      </ScrollPanel>
    </div>
    </form>
  )
}

export default TQF7_3
