import React from 'react'

import { Panel } from 'primereact/panel'
import { InputTextarea } from 'primereact/inputtextarea'
import { ScrollPanel } from 'primereact/scrollpanel';

function TQF7_3() {
  return (
    <div style={{ width: '100%',marginLeft: '10px' }}>
      <ScrollPanel style={{ width: '100%', height: '950px' }}>
      <Panel header="การรับนักศึกษา">
        {/***********************************************/}
        <div>
            <span>การรับนักศึกษา</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{การรับนักศึกษา}'/><br/><br/>
            <span>ระบบกลไก</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }}value='{ระบบกลไก.การรับนักศึกษา}'/><br/><br/>
            <span>ผลการดำเนินงาน</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{ผลการดำเนินงาน.การรับนักศึกษา}'/><br/><br/>
            <span>การประเมินกระบวนการ</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{การประเมินกระบวนการ.การรับนักศึกษา}'/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{การปรับปรุงกระบวนการ.การรับนักศึกษา}'/><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="การเตรียมความพร้อมก่อนเข้าศึกษา">
        {/***********************************************/}
        <div>
            <span>ระบบกลไก</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{ระบบกลไก.การเตรียมความพร้อมก่อนเข้าศึกษา}'/><br/><br/>
            <span>ผลการดำเนินงาน</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{ผลการดำเนินงาน.การเตรียมความพร้อมก่อนเข้าศึกษา}'/><br/><br/>
            <span>การประเมินกระบวนการ</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{การประเมินกระบวนการ.การเตรียมความพร้อมก่อนเข้าศึกษา}'/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{การปรับปรุงกระบวนการ.การเตรียมความพร้อมก่อนเข้าศึกษา}'/><br/><br/>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.การประเมินตนเองจากผลการดำเนินงาน</span><br/><br/>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.รายการหลักฐานอ้างอิง</span><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="การส่งเสริมและพัฒนานักศึกษา">
        {/***********************************************/}
        <div>
            <span>การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี}'/><br/><br/>
            <span>ผลการดำเนินงาน</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{ผลการดำเนินงาน.การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี}'/><br/><br/>
            <span>การประเมินกระบวนการ</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{การประเมินกระบวนการ.การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี}'/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{การปรับปรุงกระบวนการ.การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี}'/><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21">
        {/***********************************************/}
        <div>
            <span>ระบบกลไก</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{ระบบกลไก.กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21}'/><br/><br/>
            <span>ผลการดําเนินงาน</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{ผลการดําเนินงาน.กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21}'/><br/><br/>
            <span>การประเมินกระบวนการ</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{การประเมินกระบวนการ.กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21}'/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{การปรับปรุงกระบวนการ.กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21}'/><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์ แก่บัณฑิตศึกษา">
        {/***********************************************/}
        <div>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.การประเมินตนเองจากผลการดำเนินงาน</span><br/><br/>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.รายการหลักฐานอ้างอิง</span><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="ผลที่เกิดกับนักศึกษา">
        {/***********************************************/}
        <div>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.ข้อมูลนักศึกษา และจำนวนผู้สำเร็จการศึกษาตามแผน การศึกษาและจำนวนผู้สำเร็จการศึกษา</span><br/><br/>
            <span>ปัจจัยที่ส่งผลกระทบต่อจำนวนนักศึกษา</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{ปัจจัยที่ส่งผลกระทบต่อจำนวนนักศึกษา}'/><br/><br/>
            <span>การประเมินความพึงพอใจของนักศึกษา</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{การประเมินความพึงพอใจของนักศึกษา}'/><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="การจัดการข้อร้องเรียนของนักศึกษา">
        {/***********************************************/}
        <div>
            <span>ระบบกลไก</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{ระบบกลไก.การจัดการข้อร้องเรียนของนักศึกษา}'/><br/><br/>
            <span>ผลการดําเนินงาน</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{ผลการดําเนินงาน.การจัดการข้อร้องเรียนของนักศึกษา}'/><br/><br/>
            <span>การประเมินกระบวนการ</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{การประเมินกระบวนการ.การจัดการข้อร้องเรียนของนักศึกษา}'/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{การปรับปรุงกระบวนการ.การจัดการข้อร้องเรียนของนักศึกษา}'/><br/><br/>
            <span>การคงอยู่</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{การคงอยู่}'/><br/><br/>
            <span>การสำเร็จการศึกษา</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{การสำเร็จการศึกษา}'/><br/><br/>
            <span>ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา}'/><br/><br/>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.การประเมินตนเองจากผลการดำเนินงาน</span><br/><br/>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.รายการหลักฐานอ้างอิง</span><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="บัณฑิต">
        {/***********************************************/}
        <div>
            <span>ผลการดำเนินงาน</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{ผลการดำเนินงาน.บัณฑิต}'/><br/><br/>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.ข้อมูลประกอบการคำนวณคุณภาพของบัณฑิตหลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์</span><br/><br/>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.การประเมินตนเองจากผลการดำเนินงาน</span><br/><br/>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.รายการหลักฐานอ้างอิง</span><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="ร้อยละของบัณฑิตปริญญาตรีที่ได้งานทําหรือประกอบอาชีพอิสระภายใน 1 ปี">
        {/***********************************************/}
        <div>
            <span>ผลการดำเนินงาน</span><br/><br/>
            <InputTextarea style={{ width: '500px',height:'100px' }} value='{ผลการดำเนินงาน.ร้อยละของบัณฑิตปริญญาตรีที่ได้งานทําหรือประกอบอาชีพอิสระภายใน 1 ปี}'/><br/><br/>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.ข้อมูลประกอบการคำนวณภาวะการมีงานทำหรือประกอบอาชีพอิสระของบัณฑิตที่สำเร็จการศึกษา</span><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="สรุปผลการประเมินตนเององค์ประกอบที่ 2 บัณฑิต และองค์ประกอบที่ 3 นักศึกษา">
        {/***********************************************/}
        <div>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.บัณฑิต.ผลการประเมินตนเองตามองค์ประกอบ</span><br/><br/>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.นักศึกษา.ผลการประเมินตนเองตามองค์ประกอบ</span><br/><br/>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.การประเมินตนเองจากผลการดำเนินงาน</span><br/><br/>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.รายการหลักฐานอ้างอิง</span><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      </ScrollPanel>
    </div>
  )
}

export default TQF7_3
