import React, { useState } from 'react'

import { Panel } from 'primereact/panel'
import { InputTextarea } from 'primereact/inputtextarea' 
import { InputText } from 'primereact/inputtext'

function TQF7_2() {
  const [dataTqf7_2, setDateTqf7_2] = useState({
    //4.1.1 การรับและแต่งตั้งอาจารย์ประจําหลักสูตร
    เรื่องย่อ_การรับและแต่งตั้งอาจารย์ประจําหลักสูตร : "สาขาวิชามีระบบการรับอาจารย์ประจําหลักสูตร โดยการวางแผนด้านกรอบอัตรากําลังอาจารย์ร่วมกับคณะ เพื่อให้เป็นไปตามเกณฑ์มาตรฐานหลักสูตร โดยกําหนดคุณสมบัติอาจารย์ประจําหลักสูตรที่มีคุณวุฒิไม่ต่ำกว่าระดับปริญญาโทในสาขาวิศวกรรมคอมพิวเตอร์ หรือสาขาอื่นที่เกี่ยวข้องกับสาขาวิศวกรรมคอมพิวเตอร์ นอกเหนือจากนี้ให้เป็นไปตามกลุ่มสาขาวิชาที่กำหนดใน ISCED (International Standard Classification of Education)",
    ระบบกลไก_การรับและแต่งตั้งอาจารย์ประจําหลักสูตร : "ระบบกลไกในการรับและแต่งตั้งอาจารย์ประจําหลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ มีดังนี้ 1. สาขาวิชาดําเนินการประชุมเพื่อกําหนดคุณสมบัติทางด้านคุณวุฒิการศึกษาประสบการณ์ทํางานทั้งทางวิชาการและวิชาชีพ ความรู้ความสามารถที่สอดคล้องกับความต้องการของหลักสูตร ในสาขาวิชาวิศวกรรมคอมพิวเตอร์ หรือสาขาที่เกี่ยวข้อง ร่วมกับคณะ และเสนอขออนุมัติแผนการรับและแต่งตั้งอาจารย์ ประจําหลักสูตร ไปยังคณะและมหาวิทยาลัย 2. สาขาวิชาขออนุมัติการรับอาจารย์ ผ่านคณะไปยังมหาวิทยาลัยเพื่อดําเนินการเปิดรับสมัครโดย กําหนดระยะเวลาในการรับสมัคร วันสอบสัมภาษ วันประกาศผลการคัดเลือก โดยกําหนดระยะเวลาในการรับสมัคร อาจารย์ให้มีระยะเวลาที่มากกว่า 2 สัปดาห์ขึ้นไป 3. สาขาวิชาและคณะประชาสัมพันธ์การรับสมัครผ่านเว็บไซต์ของคณะ มหาวิทยาลัย และสื่ออื่นๆ 4. สาขาวิชาและคณะแต่งตั้งตัวแทน 3 คนเพื่อแต่งตั้งเป็นคณะกรรมการคัดเลือกอาจารย์ใหม่ ซึ่งได้แก่ คณบดี รองคณบดีฝ่ายวิชาการ และหัวหน้าสาขาวิ จากนั้นทําคําสั่งแต่งตั้งคณะกรรมการคัดเลือกอาจารย์ ใหม่ที่มีคณบดีเป็นประธานกรรมการ รองคณบดีฝ่ายวิชาการ และหัวหน้าสาขาวิชา เป็นกรรมก และหัวหน้าสํานักงานเป็นเลขานุการที่ประชุม 5. การพิจารณาคัดเลือกอาจารย์ใหม่จะเป็นวิธีการสอบสัมภาษณ์ หลังจากเสร็จสิ้นการสอบสัมภาษณ์ คณะกรรมการการสอบประชุมเพื่อสรุปผลการคัดเลื เลขานุการนําผลการพิจารณาไปทําประกาศผลการคัดเลือก อาจารย์ใหม่ โดยหลังจากประกาศผลการส คณะดําเนินการแจ้งวันรายงานตัวเพื่อเข้าปฏิบัติงานแก่อาจารย์ใหม่ 6. ฝ่ายวิชาการคณะเสนอรายชื่ออาจารย์ใหม่เพื่อแต่งตั้งเป็นอาจารย์ประจําหลักสูตรต่อสภาวิชาการ มหาวิทยาลัย และสภามหาวิทยาลัย เพื่ออนุมัติและจัดท สมอ.08 เสนอต่อ สกอ. รับทราบ 7. สาขาวิชาประชุมเพื่อประเมิน และวิเคราะห์กระบวนการรับและแต่งตั้งอาจารย์ประจําหลักสูตร เพื่อให้การรับสมัครสําเร็จลุล่วง ",
    ผลการดําเนินงาน_การรับและแต่งตั้งอาจารย์ประจําหลักสูตร : "การดําเนินงาน ในปีการศึกษา 2564 หลักสูตรมีการดําเนินงานตามระบบกลไก การรับและการแต่งตั้งอาจารย์ โดยได้รับอาจารย์เข้ามาใหม่ 2 ท่าน และได้กําหนดคุณสมบัติทางด้านคุณวุฒิการศึกษาประสบการณ์ทํางานทั้งทางวิชาการและวิชาชีพ ความรู้ความสามารถที่สอดคล้องกับความต้องการของหลักสูตร ในสาขาวิชาวิศวกรรมคอมพิวเตอร์ หรือสาขาที่เกี่ยวข้อง ร่วมกับคณะ เพื่อให้หลักสูตรได้มีอาจารย์ประจำครบตามจำนวน (รายงานการประชุม สาขาวิชาวิศวกรรมคอมพิวเตอร์ ภาคเรียนที่ 1/2563 ครั้งที่ 1 แบบ online วันที่ 15 กันยายน 2564)  B.ENG 4.1-1-01",
    การประเมินกระบวนการ_การรับและแต่งตั้งอาจารย์ประจําหลักสูตร : "ได้มีการรับและแต่งตั้งอาจารย์ประจำหลักสูตรใหม่ในปีการศึกษา 2564 เป็นจำนวน 2 ท่าน พบปัญหาเรื่องระยะเวลาในการคัดเลือกอาจารย์ประจำหลักสูตร ซึ่งในการรับอาจารย์ใหม่จากภายนอกเมื่อทำการประกาศรับและคัดเลือกจะไม่ทันระยะเวลาที่ทาง สกอ. ให้มาคือ 90   วัน ดังนั้น จึงต้องปรับกระบวนการ โดยคัดเลือกอาจารย์ประจำหลักสูตร จาก อาจารย์ที่มีอยู่ในมหาวิทยาลัยที่คุณสมบัติครบถ้วนย้ายสาขาเข้ามาทดแทนอาจารย์ประจำหลักสูตรที่ขาดหายไปก่อนเพื่อให้หลักสูตรดำเนินต่อไปได้ตามระเบียบของ สกอ. และทำการประกาศรับและคัดเลือก อาจารย์ใหม่จากภายนอกไปด้วยพร้อมๆกัน ",
    การปรับปรุงกระบวนการ_การรับและแต่งตั้งอาจารย์ประจําหลักสูตร : "จากการประเมินผลการดำเนินงานตามกระบวนการดังกล่าว หลักสูตรฯ จะต้องปรับปรุงกระบวนการในส่วนของออกประกาศ และ คัดเลือก อ ใหม่ โดยจะต้องเพิ่มกรอบเวลา 90 วัน เข้ามาด้วย และถ้าไม่สามารถหาอาจารย์ใหม่จากภายนอกได้ภายใน 90 วัน จะต้องเพิ่มการคัดเลือกอาจารย์จากภายในมหาวิทยาลัยเข้ามาทดแทนตามระเบียบของทาง สกอ. เพื่อให้หลักสูตรสามารถดำเนินต่อไปได้ โดยการรับและแต่งตั้งอาจารย์ประจำหลักสูตรใหม่ จะพิจารณาถึงคุณสมบัติของอาจารย์ที่จะมาเป็นอาจารย์ประจำหลักสูตร ได้แก่ คุณวุฒิที่สำเร็จการศึกษา งานวิจัย ตำแหน่งผลงานวิชาการ",
    //4.1.2 การบริหารอาจารย์ประจำหลักสูตร
    ระบบกลไก_การบริหารอาจารย์ประจำหลักสูตร : "การบริหารอาจารย์ประจำหลักสูตรมีวัตถุประสงค์ คือ 1)เพื่อให้อาจารย์ประจำหลักสูตรมีจำนวนและคุณภาพตลอดระยะเวลาของการเปิดหลักสูตร  2)เพื่อให้มีความพร้อมที่จะพัฒนายกระดับคุณภาพหลักสูตร และมีการวางแผนอาจารย์ประจำหลักสูตรเพื่อทดแทนอาจารย์ประจำหลักสูตรได้ทันกำหนดเวลาเกษียณอายุ การลาศึกษาต่อ หรือการลาออกกระบวนการในการบริหารหลักสูตรครอบคลุมกิจกรรม 4 ประการคือ การสรรหา การพัฒนา การดำรงรักษาไว้ และการใช้ประโยชน์ ดังนี้ 1)การสรรหาหลักสูตรฯดำเนินการตามกระบวนการรับและแต่งตั้งอาจารย์ประจำหลักสูตร ดังที่กล่าวมาแล้ว 2)การพัฒนาหลักสูตรฯดำเนินการตามกระบวนการส่งเสริมและพัฒนาอาจารย์ประจำหลักสูตร ดังที่จะกล่าวในหัวข้อต่อไป 3)การดำรงรักษาไว้ เนื่องจากแนวทางการดำรงรักษาอาจารย์ประจำหลักสูตรมีความเกี่ยวข้องกับความพอใจความสุข และความต้องการของบุคคลทางด้านค่าจ้างเงินเดือนหรือผลตอบแทนการทำงานสวัสดิการและสิ่งอำนวยความสะดวกในการทำงาน ความสมดุลระหว่างการทำงานและชีวิตส่วนตัว ความสามารถในการพัฒนาตนและผลงานให้ดีขึ้น รวมทั้งโอกาสในการพัฒนาตนเอง และก้าวหน้าในงาน ซึ่งหลักสูตรฯ มีกระบวนการดำเนินงานที่สอดรับกับแนวปฏิบัติหลักของมหาวิทยาลัยและคณะ ได้แก่ (1) มีการจัดประชุมอาจารย์ประจำหลักสูตรไม่น้อยกว่า 2 ครั้งในแต่ละปีการศึกษา เพื่อเปิดโอกาสในการรับฟังข้อเสนอแนะและมีส่วนร่วมในการดำเนินงานของหลักสูตรฯ (2) มีการบริหารงานหลักสูตรอย่างโปร่งใส ยุติธรรม ตรวจสอบได้ แสดงแผนและผล ต่ออาจารย์ประจำหลักสูตรที่นำสู่การปรับเปลี่ยนตามข้อเสนอแนะและความต้องการที่เหมาะสมของอาจารย์ประจำหลักสูตร (3) มีการประเมินผลเพื่อค้นหาความพอใจต่อการบริหารหลักสูตรทุกปีการศึกษา (4) เปิดช่องทางการติดต่อสื่อสารให้สามารถติดต่อสื่อสาร และตอบข้อซักถาม แสดงความคิดเห็นได้อย่างทันท่วงที ไม่ต้องรอการประชุม 4) การใช้ประโยชน์ หลักสูตรฯ ดำเนินการโดยพิจารณาศักยภาพและความรู้ความสามารถของอาจารย์ประจำหลักสูตรและอาจารย์บริหารหลักสูตร เพื่อการดำเนินงานให้ครบถ้วนตามภารกิจของหลักสูตร มีการมอบหมายภาระงานสอน งานที่ปรึกษา และงานอื่นๆ ตามที่ได้รับมอบหมายมาอย่างครบถ้วนตามความสามารถและความพร้อมของอาจารย์ประจำหลักสูตร เนื่องจากอาจารย์ประจำหลักสูตรเป็นกลไกที่สำคัญในการบริหารหลักสูตรและจัดการเรียนการสอน และเป็นปัจจัยที่ส่งผลโดยตรงต่อคุณภาพนักศึกษา ดังนั้น หลักสูตรฯ จึงกำหนดให้อาจารย์ประจำหลักสูตรทุกคนมีส่วนร่วมในการบริหารหลักสูตรด้านต่าง ๆ ดังนี้ 1)	ด้านการพัฒนาหลักสูตร ปรับปรุงรายวิชา การจัดการเรียนการสอน และการพัฒนานักศึกษา 2)	ด้านการพัฒนาตนเองของอาจารย์ประจำหลักสูตรทุกท่าน ทั้งทางด้านวิชาการและวิชาชีพ 3)	ด้านการดำเนินงานตามพันธกิจอย่างครบถ้วนทั้งด้านการสอน การวิจัย การบริการวิชาการ และการทำนุบำรุงศิลปะและวัฒนธรรม โดยเน้นการบูรณาการพันธกิจต่าง ๆ สู่การเรียนการสอน การพัฒนานักศึกษา และการพัฒนาอาจารย์ ",
    ผลการดําเนินงาน_การบริหารอาจารย์ประจำหลักสูตร : "ยาวไป",
    การประเมินกระบวนการ_การบริหารอาจารย์ประจำหลักสูตร : "การประเมินผลการดำเนินงานตามกระบวนการบริหารอาจารย์โดยยึดวัตถุประสงค์ของการดำเนินงาน พบว่า หลักสูตรปรับปรุง พ.ศ.2563 1) มีจำนวนอาจารย์ประจำหลักสูตรครบถ้วน 2) อาจารย์ประจำหลักสูตรทุกคนมีส่วนร่วมในการกำกับดูแลหลักสูตรและการพัฒนาตนเอง โดยในปีการศึกษา 2563 มีข้อค้นพบดังนี้ 2.1)	ด้านการพัฒนาหลักสูตร  ได้คงใช้หลักสูตรปรับปรุง พ.ศ. 2563 เป็นปีที่ 2 2.2)	ด้านการจัดการเรียนการสอน ให้อาจารย์ที่ไม่ได้เป็นอาจารย์ประจำหลักสูตร หรือเป็นอาจารย์ประจำหลักสูตรอื่น 3 ท่าน คือ อาจารย์ณรงค์ ณรงค์รัตน์ อาจารย์กฤษกร อินต๊ะวิชัย อาจารย์ทศพร นาคย้อย มาช่วยสอนวิชาในสาขาที่เกี่ยวข้องกับไฟฟ้า และวิศวกรรม เช่น วิชาการวิเคราะห์วงจรไฟฟ้าและอิเล็กทรอนิกส์ เครือข่ายคอมพิวเตอร์ การเขียนแบบวิศวกรรม มาช่วยแบ่งเบาภาระงานสอน 2.3)	ด้านการพัฒนานักศึกษา หลักสูตรฯ โดยเน้นในเรื่องการเขียนบทความร่วมกับอาจารย์ที่ปรึกษา ลงตีพิมพ์ลงวารสารวิชาการระดับชาติ การนำเสนอผลงานวิชาการระดับนานาชาติ และระดับชาติ   และมีการจดอนุสิทธิบัตรด้วย โดยตลอดปีการศึกษา 2564  มีการนำเสนอผลงานวิชาการร่วมระหว่างนศ และ อาจารย์ จำนวน 6 บทความ มีการจดอนุสิทธิบัตร ร่วมกันระหว่าง นศ และ อาจารย์ จำนวน 4 เรื่อง 2.4)	ด้านการพัฒนาตนเองของอาจารย์ประจำหลักสูตรทุกท่าน พบว่า ในปีการศึกษา 2564 อาจารย์ประจำหลักสูตรได้รับงบประมาณพัฒนาบุคลากรที่ได้รับคนละ 10,000 บาทต่อปี เพื่อให้เข้าร่วมอบรม การเข้าร่วมประชุมวิชาการ หรือโครงการอื่นเพื่อเพิ่มศักยภาพของอาจารย์ 2.5)	ด้านการดำเนินงานตามพันธกิจอย่างครบถ้วนทั้งด้านการสอน การวิจัย การบริการวิชาการ และการทำนุบำรุงศิลปะและวัฒนธรรม โดยเน้นการบูรณาการพันธกิจต่าง ๆ สู่การเรียนการสอน การพัฒนานักศึกษา และการพัฒนาอาจารย์ พบว่าในปีการศึกษา 2564 อาจารย์ประจำหลักสูตรทุกคนได้ปฏิบัติงานตามพันธกิจอย่างครบถ้วนทั้งการสอน ทำวิจัย การบริการวิชาการ และการทำนุบำรุงศิลปะและวัฒนธรรม โดยมีการบูรณาการพันธกิจสู่การเรียนการสอนและให้นักศึกษามีส่วนร่วมเพื่อการพัฒนาตามความเหมาะสม ",
    การปรับปรุงกระบวนการ_การบริหารอาจารย์ประจำหลักสูตร : "กระบวนการเดิมยังดำเนินการได้โดยไม่มีปัญหา",
    //4.1.3 การส่งเสริมและพัฒนาอาจารย์ประจำหลักสูตร
    ระบบกลไก_การส่งเสริมและพัฒนาอาจารย์ประจำหลักสูตร : "แผนต้นปี สาขาวิชาและคณะมีระบบกลไกการส่งเสริมและพัฒนาอาจารย์ โดยการวางแผนการดําเนินงานให้อาจารย์ เพิ่มพูนความรู้ ทั้งจากการอบรม สัมมนา การศึกษาต่อ การทํางานวิจัย และงานบริการวิชาการ โดยจัดตั้งแผนงบประมาณในปี 2563 เพื่อช่วยสนับสนุนทั้งด้านการพัฒนาตนเองและการศึกษาต่อ โดยปีการศึกษา 2564 มีระบบ กลไกการส่งเสริมและพัฒนาอาจารย์ ดังนี้ 1.	สาขาวิชาและคณะ ร่วมประชุมและวางแผนส่งเสริมและพัฒนาอาจารย์ประจําหลักสูตร 2.	สาขาวิชา จัดทําแผนการส่งเสริมและพัฒนาอาจารย์ประจําหลักสูตรให้มีวุฒระดับปริญญาเอกให้ครบทั้งสาขา และพัฒนาตำแหน่งทางวิชาการ 2.1 มีแผนสนับสนุนให้อาจารย์ประจําหลักสูตร ให้ศึกษาต่อระดับปริญญาเอกให้ครบทั้งสาขา โดยมีอาจารย์ประจําหลักสูตร จํานวน 1 ท่าน ให้หาที่ศึกษาต่อในระดับปริญญาเอก ได้แก่ อาจารย์วรณัน วรมงคล  ในหลักสูตรปรัชญาดุษฎีบัณฑิต 2.2 มีแผนสนับสนุนให้อาจารย์ประจำหลักสูตร พัฒนาผลงานทางวิชาการเพื่อขอตำแหน่งทางวิชาการให้ครบทั้งสาขา 3.	ดําเนินงานตามแผนการส่งเสริมและพัฒนาอาจารย์ประจําหลักสูตร โดยสาขาวิชา คณะ และมหาวิทยาลัย จัดปฐมนิเทศแนะแนวอาจารย์ใหม่ และชี้แจงการทํางานด้านต่างๆ รวมถึงการสนับสนุนการพัฒนา ตนเองของอาจารย์ประจําหลักสูตร เน้นส่งเสริมและพัฒนาอาจารย์ประจําหลักสูตรในประเด็นเรื่องการเผยแพร่ผลงานทางวิชาการให้มากขึ้น 4.	สาขาวิชาติดตามผลการเพิ่มพูนความรู้ และการพัฒนาตนเองของอาจารย์ประจําหลักสูตร 5.	สาขาวิชาทบทวน และประเมินผลการส่งเสริมและพัฒนาอาจารย์ประจําหลักสูตร 6.	สาขาวิชาประเมินและวิเคราะห์กระบวนการการส่งเสริมและพัฒนาอาจารย์ประจําหลักสูตรเพื่อนําไปปรับปรุงกระบวนการ ",
    ผลการดําเนินงาน_การส่งเสริมและพัฒนาอาจารย์ประจำหลักสูตร : "สาขาวิชามีผลการดําเนินงานด้านการส่งเสริมและพัฒนาอาจารย์ในปีการศึกษา 2564 ดังนี้ 1 ทางสาขา มี อาจารย์ ที่ได้รับตำแหน่งทางวิชาการเพิ่มขึ้น ได้แก่ ผู้ช่วยศาสตราจารย์ ดร.รวิ อุตตมธนินทร์ 2 ทางสาขา สนับสนุนให้ อาจารย์วรณัน วรมงคล ศึกษาต่อในระดับปริญญาเอก ในหลักสูตรปรัชญาดุษฎีบัณฑิต และ  พัฒนาผลงานทางวิชาการเพื่อขอตำแหน่งทางวิชาการ ด้วยการให้สอนในรายวิชาที่จะทำตำรา และเอกสารการสอนเพื่อพัฒนาผลงานทางวิชาการสนับสนุนอาจารย์ประจําหลักสูตรศึกษาต่อระดับปริญญาเอก โดยมีอาจารย์ประจําหลักสูตร จํานวน 1 ท่าน กําลังศึกษาต่อในระดับปริญญาเอก ได้แก่ ผศ.ขวัญเรือน รัศมี ศึกษาต่อ ในหลักสูตรปรัชญาดุษฎีบัณฑิต สาขาการจัดการเทคโนโลยีอุตสาหกรรม คณะเทคโนโลยีอุตสาหกรรม มหาวิทยาลัยราชภัฏหมู่บ้านจอมบึง 3 ส่วนของงานวิจัย ได้ปรับให้เป็นการทำงานในลักษณะของกลุ่มงานวิจัย เพื่อให้มีส่วนร่วมในการทำงานร่วมกัน นอกจากนั้น สาขาวิชาส่งเสริมอาจารย์ให้มีการเพิ่มพูนความรู้ สร้างเสริม ประสบการณ์ เพื่อส่งเสริมการสอนและการวิจัยอย่างต่อเนื่อง โดยผ่านการทําวิจัยสายตรงในสาขาวิชาเป็นอันดับแรก จากการรับทุนอุดหนุนงานวิจัยประจําปี 2564 จากสถาบันวิจัยและพัฒนา (B.ENG 4.1-3-01) เพื่อนําผลการวิจัยมาใช้บูรณาการการเรียนการสอนของอาจารย์ ดังนี้ 6 ในส่วนของงานบริการวิชาการ สาขาวิชาได้ดำเนินการดังนี้ 6.1 การมีส่วนร่วมในกิจกรรมบริการวิชาการแก่ชุมชน ได้แก่  โครงการสร้างประโยชน์จากขยะเหลือใช้เพื่อสร้างรายได้แก่ครัวเรือนหรือชุมชน (โครงการต่อเนื่อง) โดยร่วมกันกับอาจารย์สังกัดคณะเทคโนโลยีอุตสาหกรรมทั้งหมด 7 สาขาวิชาประเมินผลกระบวนการส่งเสริมและพัฒนาอาจารย์จากความพึงพอใจ โดยพบว่า อาจารย์พึงพอใจด้านการสนับสนุนงบประมาณการพัฒนาตนเอง และจํานวนอาจารย์ในสาขาวิชาที่มีการพัฒนาตนเอง คิดเป็นร้อยละ 100 และจากสรุปผลการเข้าร่วมกิจกรรมพัฒนาตนเอง 8 สาขาวิชา และคณะสนับสนุนให้อาจารย์ส่งผลงานวิชาการเพื่อเผยแพร่ ในปี 2564 โดยอาจารย์ประจําหลักสูตรได้มีการเผยแพร่ผลงานทางวิชาการจํานวน 6 ผลงาน ตารางการเผยแพร่ผลงานทางวิชาการในปี 2564 ของอาจารย์ประจําหลักสูตร ค่าถ่วงน้ำหนัก นานาชาติ ได้ 1.0 ระดับชาติ 0.4 ",
    การประเมินกระบวนการ_การส่งเสริมและพัฒนาอาจารย์ประจำหลักสูตร : "1. สาขาวิชาติดตามผลการเพิ่มพูนความรู้ และการพัฒนาตนเอง ดําเนินการสรุปผลการพัฒนาตนเองของ อาจารย์ประจําหลักสูตรทั้ง 5 คน 2. สาขาวิชาประชุมทบทวน และประเมินผลการส่งเสริมการพัฒนาอาจารย์ เพื่อหาข้อเสนอแนะ ในการ พัฒนาอาจารย์ในปีการศึกษาถัดไป 3. สาขาวิชาประเมิน และวิเคราะห์กระบวนการการส่งเสริมและพัฒนาอาจารย์ประจําหลักสูตร เพื่อนําไป ปรับปรุงกระบวนการเพื่อนําไปใช้พัฒนาระบบกลไก และกระบวนการสนับสนุน ส่งเสริมการพัฒนาอาจารย์ในปี การศึกษา 2564 (รายงานการประชุม สาขาวิชาวิศวกรรมคอมพิวเตอร์ ภาคเรียนที่ 2/2562 ครั้งที่ 3 แบบ online วันที่ 15 พฤษภาคม 2564)  B.ENG 4.1-1-03 จากการดําเนินงานในปีการศึกษา 2564 ที่ผ่านมา สาขาวิชาได้มีการทบทวนระบบการส่งเสริมและพัฒนา อาจารย์ เพื่อปรับปรุงและวางแนวทางในปีการศึกษา 2564 พบว่า มีการดําเนินการส่งเสริมและพัฒนาอาจารย์ประจํา หลักสูตรในปีนี้ได้ตามแผน ได้แก่ มีผู้ได้ปริญาเอกและ มีผู้ได้รับตำแหน่งทางวิชาการเพิ่มขึ้น และยังมีอาจารย์ที่รอผลการพิจารณาตำแหน่งทางวิชาการ และได้ปรับแผนพัฒนาให้เรียน ปริญญาเอกให้ครบทั้งสาขา อาจเนื่องจากอาจารย์ท่านมีภาระงานค่อนข้างมากทําให้บางครั้งการบริหาร จัดการต้องมีการปรับเปลี่ยน ดังนั้นที่ประชุมหลักสูตรเสนอให้มีการปรับปรุงระบบการส่งเสริมและพัฒนาอาจารย์ เพิ่มเติม ",
    การปรับปรุงกระบวนการ_การส่งเสริมและพัฒนาอาจารย์ประจำหลักสูตร : "สำหรับการศึกษาต่อในระดับปริญญาเอก เนื่องจากในปีการศึกษา 2564 นี้อาจารย์ในสาขายังเหลืออีก 2 ท่าน ที่สาขาจะต้องช่วยสนับสนุนให้ศึกษาต่อ โดยสาขาจะวางแผนให้ช่วยแบ่งเบาภาระงานด้านงานจัดทำเอกสารภายในสาขา งานวิจัย และงานด้านบริการวิชาการ โดยเริ่มตั้งแต่ปีการศึกษา 2564 เป็นต้นไป เพื่อให้อาจารย์ได้มีเวลาในการศึกษาต่อมากยิ่งขึ้น เรื่องการพัฒนาอาจารย์ให้ได้ตำแหน่งทางวิชาให้ครบทุกคน ได้จัดอาจารย์ในสาขาที่ได้รับตำแหน่งทางวิชาแล้ว คอยช่วยผลักดัน และให้คำแนะนำ ปรึกษาหารือเรื่องรายละเอียด และแผนการทำงาน ในการส่งผลงานทางวิจัยขอรับตำแหน่ง หลักสูตรเสนอแนะให้สาขาวิชาติดตามผลการเพิ่มพูนความรู้ และการพัฒนาตนเองของอาจารย์ประจํา หลักสูตร ปีละ 2 ครั้ง เพื่อเป็นการประเมินผลการพัฒนาอาจารย์ประจําหลักสูตรให้มีประสิทธิภาพมากขึ้น และให้ เป็นไปตามเกณฑ์มาตราฐานหลักสูตร และตามประกาศ ข้อบังคับของมหาวิทยาลัย โดยมีระบบกลไกการส่งเสริมและ พัฒนาอาจารย์ เพิ่มเติม ดังนี้ 1.	สาขาวิชาและคณะ ประชุมและวางแผนส่งเสริมและพัฒนาอาจารย์ประจําหลักสูตร 2.	สาขาวิชา จัดทําแผนการส่งเสริมและพัฒนาอาจารย์ประจําหลักสูตร 3.ดําเนินงานตามแผนการส่งเสริมและพัฒนาอาจารย์ประจําหลักสูตร โดยสาขาวิชาคณะ และมหาวิทยาลัย จัดปฐมนิเทศแนะแนวอาจารย์ใหม่ และชี้แจงการทํางานด้านต่างๆ รวมถึงการสนับสนุนการพัฒนาตนเองของอาจารย์ประจําหลักสูตร เน้นส่งเสริมและพัฒนาอาจารย์ประจําหลักสูตรในประเด็นเรื่องการพัฒนาตำแหน่งทางวิชาการให้มากขึ้น 4. สาขาวิชาติดตามผลการเพิ่มพูนความรู้ และการพัฒนาตนเองของอาจารย์ประจําหลักสูตร ปีละ 2 ครั้ง 5.สาขาวิชาทบทวน และประเมินผลการส่งเสริมและพัฒนาอาจารย์ประจําหลักสูตร 6.สาขาวิชาประเมินและวิเคราะห์กระบวนการการส่งเสริมและพัฒนาอาจารย์ประจําหลักสูตร เพื่อนําไปปรับปรุงกระบวนการ ",
    เป้าหมาย_อาจารย์ : "ระดับ 3",
    ผลการดำเนินงาน_อาจารย์ : "3",
    คะแนนการประเมินตนเอง_อาจารย์ : "3",
    การบรรลุเป้าหมาย_อาจารย์ : "บรรลุ",
    รหัสเอกสาร1 : "B.ENG 4.1-1-01",
    รหัสเอกสาร2 : "B.ENG 4.1-1-02",
    รหัสเอกสาร3 : "B.ENG 4.1-1-03",
    รหัสเอกสาร4 : "B.ENG 4.1-1-03",
    รหัสเอกสาร5 : "B.ENG 4.1-3-01",
    รหัสเอกสาร6 : "B.ENG 4.1-3-02",
    รหัสเอกสาร7 : "B.ENG 4.1-3-03",
    รหัสเอกสาร8 : "B.ENG 4.1-3-04",
    รายการเอกสารหลักฐาน1 : "รายงานการประชุม สาขาวิชาวิศวกรรมคอมพิวเตอร์ ภาคเรียนที่ 1/2564 แบบ online ครั้งที่ 1 วันที่ 15 กันยายน 2564",
    รายการเอกสารหลักฐาน2 : "รายงานการประชุม สาขาวิชาวิศวกรรมคอมพิวเตอร์ ภาคเรียนที่ 1/2564 แบบ online ครั้งที่ 2 วันที่ 11 พฤศจิกายน 2564",
    รายการเอกสารหลักฐาน3 : "รายงานการประชุม สาขาวิชาวิศวกรรมคอมพิวเตอร์ ภาคเรียนที่ 2/2564 แบบ online ครั้งที่ 3 วันที่ 3 มีนาคม 2565",
    รายการเอกสารหลักฐาน4 : "รายงานการประชุม สาขาวิชาวิศวกรรมคอมพิวเตอร์ ภาคเรียนที่ 2/2564 แบบ online ครั้งที่ 4 วันที่ 26 เมษายน 2564 ",
    รายการเอกสารหลักฐาน5 : "รายชื่องานวิจัยประจําปี 2563 จากสถาบันวิจัยและพัฒนา",
    รายการเอกสารหลักฐาน6 : "รายชื่อโครงการบริการวิชาการประจําปี 2564 จากสถาบันวิจัยและพัฒนา",
    รายการเอกสารหลักฐาน7 : "รายการการฝึกอบรม สัมมนาทางวิชาการและวิชาชีพในองค์กรต่างๆ การประชุม ทางวิชาการในประเทศ และต่างประเทศ ของอาจารย์ประจําหลักสูตร",
    รายการเอกสารหลักฐาน8 : "รายงานผลการพัฒนาตนเองของอาจารย์ประจําหลักสูตร",
    // รายการข้อมูลพื้นฐาน_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก1 : "จำนวนอาจารย์ประจำหลักสูตรที่มีวุฒิปริญญาเอก",
    // รายการข้อมูลพื้นฐาน_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก2 : "จำนวนอาจารย์ประจำหลักสูตรทั้งหมด",
    // รายการข้อมูลพื้นฐาน_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก3 : "ร้อยละของอาจารย์ประจำที่มีวุฒิปริญญาเอก",
    // รายการข้อมูลพื้นฐาน_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก4 : "เทียบคะแนนเต็ม 5 = ร้อยละ 40 ขึ้นไป",
    ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก1 : "3 คน",
    ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก2 : "5 คน",
    ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก3 : "ร้อยละ 60",
    ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก4 : "5 คะแนน",
    รหัสเอกสาร_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก : "B.ENG 1.1-2-01",
    รายการเอกสารหลักฐาน_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก : "สคอ 08",
    ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ1 : "4 คน",
    ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ2 : "5 คน",
    ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ3 : "ร้อยละ 80",
    ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ4 : "5 คะแนน",
    รหัสเอกสาร_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ : "B.ENG 1.1-2-01",
    รายการเอกสารหลักฐาน_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ : "สคอ 08",
    ค่าน้ำหนัก1 : "(คน)",
    ค่าน้ำหนัก2 : "(ชิ้นงาน)",
    ค่าน้ำหนัก3 : "0.20",
    ค่าน้ำหนัก4 : "0.20",
    ค่าน้ำหนัก5 : "0.40",
    ค่าน้ำหนัก6 : "0.40",
    ค่าน้ำหนัก7 : "0.40",
    ค่าน้ำหนัก8 : "",
    ค่าน้ำหนัก9 : "0.60",
    ค่าน้ำหนัก10 : "0.60",
    ค่าน้ำหนัก11 : "0.80",
    ค่าน้ำหนัก12 : "0.80",
    ค่าน้ำหนัก13 : "0.80",
    ค่าน้ำหนัก14 : "0.80",
    ค่าน้ำหนัก15 : "1.00",
    ค่าน้ำหนัก16 : "1.00",
    ค่าน้ำหนัก17 : "1.00",
    ค่าน้ำหนัก18 : "1.00",
    ค่าน้ำหนัก19 : "1.00",
    ค่าน้ำหนัก20 : "1.00",
    ค่าน้ำหนัก21 : "1.00",
    ค่าน้ำหนัก22 : "1.00",
    ค่าน้ำหนัก23 : "1.00",
    ค่าน้ำหนัก24 : "1.00",
    ค่าน้ำหนัก25 : "1.00",
    ค่าน้ำหนัก26 : "1.00",
    จำนวนชิ้นงาน1 : "",
    จำนวนชิ้นงาน2 : "",
    จำนวนชิ้นงาน3 : "4",
    จำนวนชิ้นงาน4 : "",
    จำนวนชิ้นงาน5 : "2",
    จำนวนชิ้นงาน6 : "",
    จำนวนชิ้นงาน7 : "",
    จำนวนชิ้นงาน8 : "4",
    จำนวนชิ้นงาน9 : "",
    จำนวนชิ้นงาน10 : "",
    จำนวนชิ้นงาน11 : "",
    จำนวนชิ้นงาน12 : "",
    จำนวนชิ้นงาน13 : "",
    จำนวนชิ้นงาน14 : "",
    จำนวนชิ้นงาน15 : "4",
    จำนวนชิ้นงาน16 : "2",
    จำนวนชิ้นงาน17 : "",
    จำนวนชิ้นงาน18 : "",
    จำนวนชิ้นงาน19 : "",
    จำนวนชิ้นงาน20 : "",
    จำนวนชิ้นงาน21 : "",
    จำนวนชิ้นงาน22 : "",
    จำนวนชิ้นงาน23 : "",
    จำนวนชิ้นงาน24 : "",
    จำนวนชิ้นงาน25 : "",
    จำนวนชิ้นงาน26 : "",
    ผลรวมถ่วงน้ำหนัก1 : "",
    ผลรวมถ่วงน้ำหนัก2 : "",
    ผลรวมถ่วงน้ำหนัก3 : "0.80",
    ผลรวมถ่วงน้ำหนัก4 : "",
    ผลรวมถ่วงน้ำหนัก5 : "0.80",
    ผลรวมถ่วงน้ำหนัก6 : "",
    ผลรวมถ่วงน้ำหนัก7 : "",
    ผลรวมถ่วงน้ำหนัก8 : "",
    ผลรวมถ่วงน้ำหนัก9 : "",
    ผลรวมถ่วงน้ำหนัก10 : "",
    ผลรวมถ่วงน้ำหนัก11 : "",
    ผลรวมถ่วงน้ำหนัก12 : "",
    ผลรวมถ่วงน้ำหนัก13 : "",
    ผลรวมถ่วงน้ำหนัก14 : "",
    ผลรวมถ่วงน้ำหนัก15 : "4",
    ผลรวมถ่วงน้ำหนัก16 : "2",
    ผลรวมถ่วงน้ำหนัก17 : "",
    ผลรวมถ่วงน้ำหนัก18 : "",
    ผลรวมถ่วงน้ำหนัก19 : "",
    ผลรวมถ่วงน้ำหนัก20 : "",
    ผลรวมถ่วงน้ำหนัก21 : "",
    ผลรวมถ่วงน้ำหนัก22 : "",
    ผลรวมถ่วงน้ำหนัก23 : "",
    ผลรวมถ่วงน้ำหนัก24 : "",
    ผลรวมถ่วงน้ำหนัก25 : "",
    ผลรวมถ่วงน้ำหนัก26 : "",
    ผลรวม : "7.6",
    ผลการดำเนินงาน_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร1 : "6",
    ผลการดำเนินงาน_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร2 : "5 คน",
    ผลการดำเนินงาน_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร3 : "ร้อยละ 120",
    ผลการดำเนินงาน_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร4 : "5 คะแนน",
    รหัสเอกสาร9 : "B.ENG 4.2-1-01", 
    รหัสเอกสาร10 : "B.ENG 4.2-1-02", 
    รหัสเอกสาร11 : "B.ENG 4.2-1-03", 
    รหัสเอกสาร12 : "B.ENG 4.2-1-04", 
    รหัสเอกสาร13 : "B.ENG 4.2-1-05", 
    รหัสเอกสาร14 : "B.ENG 4.2-1-06",
    ชื่อบทความวิจัยฉบับสมบูรณ์1 : "การเร่งความเร็วการตรวจจับใบหน้าและรู้จำใบหน้ามนุษย์บนเว็ปแอปพลิเคชัน โดยใช้หน่วยประมวลผลกราฟิก",
    ชื่อบทความวิจัยฉบับสมบูรณ์2 : "เครื่องเตือนการรับประทานยาของผู้สูงอายุ",
    ชื่อบทความวิจัยฉบับสมบูรณ์3 : "การประชุมสวนสุนันทาวิชาการระดับชาติ ครั้งที่ 10 การวิจัยเพื่อความยั่งยืนภายใต้ชีวิตวิธีใหม่ หลังโควิด-19 ม.วิทยาลัยราชภัฏสวนสุนันทา ตู้ต้นแบบขนาดเล็กสำหรับการดูแลต้นสตรอว์เบอร์รีควบคุมผ่านเว็บแอปพลิเคชัน ",
    ชื่อบทความวิจัยฉบับสมบูรณ์4 : "แอปพลิเคชันซ่อมบำรุงรักษาเครื่องปรับอากาศ",
    ชื่อบทความวิจัยฉบับสมบูรณ์5 : "ระบบช่วยการจอดรถส่วนบุคคล",
    ชื่อบทความวิจัยฉบับสมบูรณ์6 : "ระบบจดบันทึกหนังสืออิเล็กทรอนิกส์การศึกษาทั่วไป สำนักงานวิชาการศึกษาทั่วไปและนวัตกรรม",
    ชื่อเจ้าของผลงานและผู้ร่วม1 : "อภิสิทธิ์ รัตนาตรานุรักษ์, รวิ อุตตมธนินทร์",
    ชื่อเจ้าของผลงานและผู้ร่วม2 : "รวิ อุตตมธนินทร์",
    ชื่อเจ้าของผลงานและผู้ร่วม3 : "รวิ อุตตมธนินทร์",
    ชื่อเจ้าของผลงานและผู้ร่วม4 : "ขวัญเรือน รัศมี, กัลยณัฏฐ์ กุหลาบเพ็ชรทอง และวรณัน วรมงคล",
    ชื่อเจ้าของผลงานและผู้ร่วม5 : "รวิ อุตตมธนินทร์,  ขวัญเรือน รัศมี, พรภวิษย์ บุญศรีเมือง, วรณัน วรมงคล, เศรษฐกาล โปร่งนุช, สุนิสา เสนปาน และกัลยณัฏฐ์ กุหลาบเพ็ชรทอง ",
    ชื่อเจ้าของผลงานและผู้ร่วม6 : "รวิ อุตตมธนินทร์,  ขวัญเรือน รัศมี, พรภวิษย์ บุญศรีเมือง, วรณัน วรมงคล, เศรษฐกาล โปร่งนุช, สุนิสา เสนปาน และกัลยณัฏฐ์ กุหลาบเพ็ชรทอง ",
    ชื่อการประชุมวิชาการ1 : "การประชุมวิชาการระดับชาติและนานาชาติ มหาวิทยาลัยศรีปทุม ครั้งที่ 16 ประจำปี 2564",
    ชื่อการประชุมวิชาการ2 : "การประชุมวิชาการทางวิศวกรรมไฟฟ้า ครั้งที่  44 The 44th Electrical Engineering Conference (EECON-44) ",
    ชื่อการประชุมวิชาการ3 : "การประชุมสวนสุนันทาวิชาการระดับชาติ ครั้งที่ 10 การวิจัยเพื่อความยั่งยืนภายใต้ชีวิตวิธีใหม่ หลังโควิด-19 ม.วิทยาลัยราชภัฏสวนสุนันทา ",
    ชื่อการประชุมวิชาการ4 : "การประชุมวิชาการระดับชาติ มอ. ตรัง วิจัย ครั้งที่ 11 ประจำปี 2565",
    ชื่อการประชุมวิชาการ5 : "การประชุมวิชาการระดับชาติ 8 ครั้งที่ 4 คณะเทคโนโลยีอุตสาหกรรม ม.ราชภัฏสวนสุนันทา",
    ชื่อการประชุมวิชาการ6 : "การประชุมวิชาการระดับชาติ 8 ครั้งที่ 4 คณะเทคโนโลยีอุตสาหกรรม ม.ราชภัฏสวนสุนันทา",
    ตัวตั้ง_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก : "3",
    ตัวหาร_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก : "5",
    ผลลัพธ์_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก : "ร้อยละ 40",
    คะแนนการประเมินตนเอง_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก : "5 คะแนน",
    ตัวตั้ง_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ : "4",
    ตัวหาร_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ : "5",
    ผลลัพธ์_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ : "ร้อยละ 80",
    คะแนนการประเมินตนเอง_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ : "5 คะแนน",
    ตัวตั้ง_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร : "6",
    ตัวหาร_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร : "5",
    ผลลัพธ์_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร : "ร้อยละ 120",
    คะแนนการประเมินตนเอง_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร : "5 คะแนน",
    คะแนนเฉลี่ย_ผลการดำเนินการในภาพรวม : "5 คะแนน",
    เป้าหมาย_การประเมินตนเองจากผลการดำเนินงาน : "5 คะแนน",
    ผลการดำเนินงาน_การประเมินตนเองจากผลการดำเนินงาน : "5",
    คะแนนการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน : "5",
    การบรรลุเป้าหมาย_การประเมินตนเองจากผลการดำเนินงาน : "บรรลุ",

  });

  const handleChange = (event, property) => {
    setDateTqf7_2({
      ...dataTqf7_2,
      [property]: event.target.value,
    });
    console.log(dataTqf7_2);
  };


  return (
    <div>
      {/***********************************************/}
      <Panel header="4.1.1การรับและแต่งตั้งอาจารย์ประจําหลักสูตร">
        <div>
          <span>เรื่องย่อ</span><br/><br/>
            <InputTextarea autoResize style={{ width: '100%' }} value={dataTqf7_2.เรื่องย่อ_การรับและแต่งตั้งอาจารย์ประจําหลักสูตร}/><br/><br/>
            <span>ระบบกลไก</span><br/><br/>
            <InputTextarea autoResize style={{ width: '100%' }} value={dataTqf7_2.ระบบกลไก_การรับและแต่งตั้งอาจารย์ประจําหลักสูตร}/><br/><br/>
            <span>ผลการดําเนินงาน</span><br/><br/>
            <InputTextarea autoResize style={{ width: '100%' }} value={dataTqf7_2.ผลการดําเนินงาน_การรับและแต่งตั้งอาจารย์ประจําหลักสูตร}/><br/><br/>
            <span>การประเมินกระบวนการ</span><br/><br/>
            <InputTextarea autoResize style={{ width: '100%' }} value={dataTqf7_2.การประเมินกระบวนการ_การรับและแต่งตั้งอาจารย์ประจําหลักสูตร}/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span><br/><br/>
            <InputTextarea autoResize style={{ width: '100%' }} value={dataTqf7_2.การปรับปรุงกระบวนการ_การรับและแต่งตั้งอาจารย์ประจําหลักสูตร}/><br/><br/>
        </div>
      </Panel><br/><br/>
      {/***********************************************/}
      <Panel header="4.1.2 การบริหารอาจารย์ประจำหลักสูตร">
      <div>
            <span>ระบบกลไก</span><br/><br/>
            <InputTextarea autoResize style={{ width: '100%' }} value={dataTqf7_2.ระบบกลไก_การบริหารอาจารย์ประจำหลักสูตร}/><br/><br/>
            <span>ผลการดําเนินงาน</span><br/><br/>
            <InputTextarea autoResize style={{ width: '100%' }} value={dataTqf7_2.ผลการดําเนินงาน_การบริหารอาจารย์ประจำหลักสูตร}/><br/><br/>
            <span>การประเมินกระบวนการ</span><br/><br/>
            <InputTextarea autoResize style={{ width: '100%' }} value={dataTqf7_2.การประเมินกระบวนการ_การบริหารอาจารย์ประจำหลักสูตร}/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span><br/><br/>
            <InputTextarea autoResize style={{ width: '100%' }} value={dataTqf7_2.การปรับปรุงกระบวนการ_การบริหารอาจารย์ประจำหลักสูตร}/><br/><br/>
        </div>
      </Panel><br/><br/>
      {/***********************************************/}
      <Panel header="4.1.3 การส่งเสริมและพัฒนาอาจารย์ประจำหลักสูตร">
      <div>
            <span>ระบบกลไก</span><br/><br/>
            <InputTextarea autoResize style={{ width: '100%' }} value={dataTqf7_2.ระบบกลไก_การส่งเสริมและพัฒนาอาจารย์ประจำหลักสูตร}/><br/><br/>
            <span>ผลการดําเนินงาน</span><br/><br/>
            <InputTextarea autoResize style={{ width: '100%' }} value={dataTqf7_2.ผลการดําเนินงาน_การส่งเสริมและพัฒนาอาจารย์ประจำหลักสูตร}/><br/><br/>
            <span>การประเมินกระบวนการ</span><br/><br/>
            <InputTextarea autoResize style={{ width: '100%' }} value={dataTqf7_2.การประเมินกระบวนการ_การส่งเสริมและพัฒนาอาจารย์ประจำหลักสูตร}/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span><br/><br/>
            <InputTextarea autoResize style={{ width: '100%' }} value={dataTqf7_2.การปรับปรุงกระบวนการ_การส่งเสริมและพัฒนาอาจารย์ประจำหลักสูตร}/><br/><br/>
        </div>
      </Panel><br/><br/>
      {/***********************************************/}
      <Panel header="การประเมินตนเองจากผลการดำเนินงาน ">
      <div>
          <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>เป้าหมาย</th>
                <th className='TH'>ผลการดำเนินงาน</th>
                <th className='TH'>คะแนนการประเมินตนเอง</th>
                <th className='TH'>การบรรลุเป้าหมาย</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'><InputText value = {dataTqf7_2.เป้าหมาย_อาจารย์} onChange={(e) => handleChange(e, 'เป้าหมาย_อาจารย์')}></InputText></td>
                <td className='TD'><InputText value = {dataTqf7_2.ผลการดำเนินงาน_อาจารย์} onChange={(e) => handleChange(e, 'ผลการดำเนินงาน_อาจารย์')}></InputText></td>
                <td className='TD'><InputText value = {dataTqf7_2.คะแนนการประเมินตนเอง_อาจารย์} onChange={(e) => handleChange(e, 'คะแนนการประเมินตนเอง_อาจารย์')}></InputText></td>
                <td className='TD'><InputText value = {dataTqf7_2.การบรรลุเป้าหมาย_อาจารย์} onChange={(e) => handleChange(e, 'การบรรลุเป้าหมาย_อาจารย์')}></InputText></td>
              </tr>
            </tbody>
          </table>
        </div>
      </Panel><br/><br/>
      {/***********************************************/}
      <Panel header="รายการหลักฐานอ้างอิง ">
      <div>
          <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>รหัสเอกสาร</th>
                <th className='TH'>รายการเอกสารหลักฐาน</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'><InputText value = {dataTqf7_2.รหัสเอกสาร1} onChange={(e) => handleChange(e, 'รหัสเอกสาร1')}></InputText></td>
                <td className='TD'><InputTextarea autoResize value = {dataTqf7_2.รายการเอกสารหลักฐาน1} onChange={(e) => handleChange(e, 'รายการเอกสารหลักฐาน1')}></InputTextarea></td>
              </tr>
              <tr>
                <td className='TD'><InputText value = {dataTqf7_2.รหัสเอกสาร2} onChange={(e) => handleChange(e, 'รหัสเอกสาร2')}></InputText></td>
                <td className='TD'><InputTextarea autoResize value = {dataTqf7_2.รายการเอกสารหลักฐาน2} onChange={(e) => handleChange(e, 'รายการเอกสารหลักฐาน2')}></InputTextarea></td>
              </tr>
              <tr>
                <td className='TD'><InputText value = {dataTqf7_2.รหัสเอกสาร3} onChange={(e) => handleChange(e, 'รหัสเอกสาร3')}></InputText></td>
                <td className='TD'><InputTextarea autoResize value = {dataTqf7_2.รายการเอกสารหลักฐาน3} onChange={(e) => handleChange(e, 'รายการเอกสารหลักฐาน3')}></InputTextarea></td>
              </tr>
              <tr>
                <td className='TD'><InputText value = {dataTqf7_2.รหัสเอกสาร4} onChange={(e) => handleChange(e, 'รหัสเอกสาร4')}></InputText></td>
                <td className='TD'><InputTextarea autoResize value = {dataTqf7_2.รายการเอกสารหลักฐาน4} onChange={(e) => handleChange(e, 'รายการเอกสารหลักฐาน4')}></InputTextarea></td>
              </tr>
              <tr>
                <td className='TD'><InputText value = {dataTqf7_2.รหัสเอกสาร5} onChange={(e) => handleChange(e, 'รหัสเอกสาร5')}></InputText></td>
                <td className='TD'><InputTextarea autoResize value = {dataTqf7_2.รายการเอกสารหลักฐาน5} onChange={(e) => handleChange(e, 'รายการเอกสารหลักฐาน5')}></InputTextarea></td>
              </tr>
              <tr>
                <td className='TD'><InputText value = {dataTqf7_2.รหัสเอกสาร6} onChange={(e) => handleChange(e, 'รหัสเอกสาร6')}></InputText></td>
                <td className='TD'><InputTextarea autoResize value = {dataTqf7_2.รายการเอกสารหลักฐาน6} onChange={(e) => handleChange(e, 'รายการเอกสารหลักฐาน6')}></InputTextarea></td>
              </tr>
              <tr>
                <td className='TD'><InputText value = {dataTqf7_2.รหัสเอกสาร7} onChange={(e) => handleChange(e, 'รหัสเอกสาร7')}></InputText></td>
                <td className='TD'><InputTextarea autoResize value = {dataTqf7_2.รายการเอกสารหลักฐาน7} onChange={(e) => handleChange(e, 'รายการเอกสารหลักฐาน7')}></InputTextarea></td>
              </tr>
              <tr>
                <td className='TD'><InputText value = {dataTqf7_2.รหัสเอกสาร8} onChange={(e) => handleChange(e, 'รหัสเอกสาร8')}></InputText></td>
                <td className='TD'><InputTextarea autoResize value = {dataTqf7_2.รายการเอกสารหลักฐาน8} onChange={(e) => handleChange(e, 'รายการเอกสารหลักฐาน8')}></InputTextarea></td>
              </tr>
            </tbody>
          </table>
        </div>
      </Panel><br/><br/>
      {/***********************************************/}
      <Panel header="4.2.1 ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก">
        <div>
        <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>รายการข้อมูลพื้นฐาน</th>
                <th className='TH'>ผลการดำเนินการ</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'>จำนวนอาจารย์ประจำหลักสูตรที่มีวุฒิปริญญาเอก</td>
                <td className='TD'><InputText autoResize value = {dataTqf7_2.ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก1} onChange={(e) => handleChange(e, 'ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก1')}></InputText></td>
              </tr>
              <tr>
                <td className='TD'>จำนวนอาจารย์ประจำหลักสูตรทั้งหมด</td>
                <td className='TD'><InputText autoResize value = {dataTqf7_2.ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก2} onChange={(e) => handleChange(e, 'ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก2')}></InputText></td>
              </tr>
              <tr>
                <td className='TD'>ร้อยละของอาจารย์ประจำที่มีวุฒิปริญญาเอก</td>
                <td className='TD'><InputText autoResize value = {dataTqf7_2.ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก3} onChange={(e) => handleChange(e, 'ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก3')}></InputText></td>
              </tr>
              <tr>
                <td className='TD'>เทียบคะแนนเต็ม 5 = ร้อยละ 40 ขึ้นไป</td>
                <td className='TD'><InputText  value = {dataTqf7_2.ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก4} onChange={(e) => handleChange(e, 'ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก4')}></InputText></td>
              </tr>
            </tbody>
          </table>
          <br/><br/>
          <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>รหัสเอกสาร</th>
                <th className='TH'>รายการเอกสารหลักฐาน</th>
              </tr>
            </thead>
            <tbody>
              <tr>
              <td className='TD'><InputText  value = {dataTqf7_2.รหัสเอกสาร_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก} onChange={(e) => handleChange(e, 'รหัสเอกสาร_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก')}></InputText></td>
                <td className='TD'><InputText  value = {dataTqf7_2.รายการเอกสารหลักฐาน_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก} onChange={(e) => handleChange(e, 'รายการเอกสารหลักฐาน_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก')}></InputText></td>
              </tr>
            </tbody>
          </table>
        </div>
      </Panel><br/><br/>
      {/***********************************************/}
      <Panel header="4.2.2 ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ ">
      <div>
        <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>รายการข้อมูลพื้นฐาน</th>
                <th className='TH'>ผลการดำเนินการ</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'>จำนวนอาจารย์ประจำหลักสูตรที่มีวุฒิปริญญาเอก</td>
                <td className='TD'><InputText autoResize value = {dataTqf7_2.ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ1} onChange={(e) => handleChange(e, 'ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ1')}></InputText></td>
              </tr>
              <tr>
                <td className='TD'>จำนวนอาจารย์ประจำหลักสูตรทั้งหมด</td>
                <td className='TD'><InputText autoResize value = {dataTqf7_2.ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ2} onChange={(e) => handleChange(e, 'ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ2')}></InputText></td>
              </tr>
              <tr>
                <td className='TD'>ร้อยละของอาจารย์ประจำที่มีวุฒิปริญญาเอก</td>
                <td className='TD'><InputText autoResize value = {dataTqf7_2.ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ3} onChange={(e) => handleChange(e, 'ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ3')}></InputText></td>
              </tr>
              <tr>
                <td className='TD'>เทียบคะแนนเต็ม 5 = ร้อยละ 60 ขึ้นไป</td>
                <td className='TD'><InputText  value = {dataTqf7_2.ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ4} onChange={(e) => handleChange(e, 'ผลการดำเนินการ_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ4')}></InputText></td>
              </tr>
            </tbody>
          </table>
          <br/><br/>
          <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>รหัสเอกสาร</th>
                <th className='TH'>รายการเอกสารหลักฐาน</th>
              </tr>
            </thead>
            <tbody>
              <tr>
              <td className='TD'><InputText  value = {dataTqf7_2.รหัสเอกสาร_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ} onChange={(e) => handleChange(e, 'รหัสเอกสาร_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ')}></InputText></td>
                <td className='TD'><InputText  value = {dataTqf7_2.รายการเอกสารหลักฐาน_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ} onChange={(e) => handleChange(e, 'รายการเอกสารหลักฐาน_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ')}></InputText></td>
              </tr>
            </tbody>
          </table>
        </div>
      </Panel><br/><br/>
      {/***********************************************/}
      <Panel header="4.2.3 ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร">
        <div>
            <span>ผลการดำเนินการ</span><br/><br/>
          <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>เกณฑ์มาตรฐาน</th>
                <th className='TH'>ผลการดำเนินการ</th>
              </tr>
            </thead>
            <tbody>
              <tr>
              <td className='TD'>ผลรวมถ่วงน้ำหนักของงานวิจัยหรืองานสร้างสรรค์ที่ตีพิมพ์หรือเผยแพร่</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลการดำเนินงาน_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร1} onChange={(e) => handleChange(e, 'ผลการดำเนินงาน_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร1')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'>จำนวนอาจารย์ประจำหลักสูตรทั้งหมด</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลการดำเนินงาน_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร2} onChange={(e) => handleChange(e, '')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'>ร้อยละของงานวิจัยหรืองานสร้างสรรค์ที่ได้รับการตีพิมพ์หรือเผยแพร่ ต่อจำนวนอาจารย์ประจำหลักสูตรทั้งหมด </td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลการดำเนินงาน_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร3} onChange={(e) => handleChange(e, '')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'>เทียบคะแนน 5 คะแนน = ร้อยละ 20 ขึ้นไป</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลการดำเนินงาน_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร4} onChange={(e) => handleChange(e, '')}></InputText></td>
              </tr>
            </tbody>
          </table>
          <br/><br/><span>ข้อมูลประกอบการคำนวณผลงานทางวิชาการของอาจารย์ประจําหลักสูตร</span><br/><br/>
          <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>ลำดับที่</th>
                <th className='TH'>ข้อมูลพื้นฐานประกอบตัวบ่งชี้</th>
                <th className='TH'>ค่าน้ำหนัก</th>
                <th className='TH'>จำนวนชิ้นงาน</th>
                <th className='TH'>ผลรวมถ่วงน้ำหนัก</th>
              </tr>
            </thead>
            <tbody>
              <tr>
              <td className='TD'>1</td>
              <td className='TD'>จำนวนอาจารย์ประจําหลักสูตรทั้งหมด</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก1} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก1')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน1} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน1')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก1} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก1')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'>2</td>
              <td className='TD'>จำนวนรวมของบทความวิจัยที่ได้รับการตีพิมพ์ (อาจารย์ประจําหลักสูตร)</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก2} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก2')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน2} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน2')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก2} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก2')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>- บทความวิจัยฉบับสมบูรณ์ที่ตีพิมพ์ในรายงานสืบเนื่องจากการประชุมวิชาการระดับชาติ</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก3} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก3')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน3} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน3')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก3} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก3')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>- บทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในรายงานสืบเนื่องจากการประชุมวิชาการระดับชาติ</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก4} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก4')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน4} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน4')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก4} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก4')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>- บทความวิจัยฉบับสมบูรณ์ที่ตีพิมพ์ในรายงานสืบเนื่องจากการประชุมวิชาการระดับนานาชาติ</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก5} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก5')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน5} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน5')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก5} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก5')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>- บทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในรายงานสืบเนื่องจากการประชุมวิชาการระดับนานาชาติ</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก6} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก6')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน6} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน6')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก6} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก6')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>- บทความวิจัยฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารทางวิชาการระดับชาติที่ไม่อยู่ในฐานข้อมูล ตามประกาศ ก.พ.อ. แต่สถาบันนําเสนอสภาสถาบันอนุมัติและจัดทําเป็นประกาศให้ทราบเป็นการทั่วไป และแจ้งให้ กพอ.ทราบภายใน 30 วันนับแต่วันที่ออกประกาศ</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก7} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก7')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน7} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน7')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก7} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก7')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>-   ผลงานที่ได้รับการจดอนุสิทธิบัตร</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก8} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก8')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน8} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน8')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก8} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก8')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>-   บทความวิจัยที่ตีพิมพ์ในวารสารวิชาการที่ปรากฏในฐานข้อมูล TCI กลุ่มที่ 2</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก9} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก9')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน9} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน9')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก9} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก9')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>-   บทความวิชาการที่ตีพิมพ์ในวารสารวิชาการที่ปรากฏในฐานข้อมูล TCI กลุ่มที่ 2</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก10} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก10')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน10} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน10')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก10} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก10')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>-   บทความวิจัยที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่ไม่อยู่ในฐานข้อมูล ตามประกาศ ก.พ.อ. แต่สถาบันนําเสนอสภาสถาบันอนุมัติและจัดทําเป็นประกาศให้ทราบเป็นการทั่วไป และแจ้งให้ กพอ. ทราบภายใน 30 วันนับแต่วันที่ออกประกาศ (ซึ่งไม่อยู่ใน Beall’s list)   </td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก11} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก11')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน11} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน11')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก11} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก11')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>-   บทความวิชาการที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่ไม่อยู่ในฐานข้อมูล ตามประกาศ ก.พ.อ. แต่สถาบันนําเสนอสภาสถาบันอนุมัติและจัดทําเป็นประกาศให้ทราบเป็นการทั่วไป และแจ้งให้ กพอ. ทราบภายใน 30 วันนับแต่วันที่ออกประกาศ (ซึ่งไม่อยู่ใน Beall’s list) </td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก12} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก12')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน12} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน12')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก12} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก12')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>-   บทความวิจัยฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการที่ปรากฏในฐานข้อมูล TCI กลุ่มที่ 1</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก13} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก13')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน13} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน13')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก13} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก13')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>-   บทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการที่ปรากฏในฐานข้อมูล TCI กลุ่มที่ 1</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก14} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก14')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน14} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน14')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก14} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก14')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>-   บทความวิจัยที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่ปรากฏในฐานข้อมูลระดับนานาชาติตามประกาศ ก.พ.อ.</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก15} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก15')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน15} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน15')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก15} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก1')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>-   บทความวิชาการที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่ปรากฏในฐานข้อมูลระดับนานาชาติตามประกาศ ก.พ.อ.</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก16} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก16')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน16} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน16')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก16} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก16')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>-   ผลงานได้รับการจดสิทธิบัตร</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก17} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก17')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน17} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน17')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก17} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก17')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>-   ผลงานวิชาการรับใช้สังคมที่ได้รับการประเมินผ่านเกณฑ์การขอตําแหน่งทางวิชาการแล้ว </td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก18} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก18')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน18} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน18')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก18} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก18')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>-   ผลงานวิจัยที่หน่วยงานหรือองค์กรระดับชาติว่าจ้างให้ดําเนินการ</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก19} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก19')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน19} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน19')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก19} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก19')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>-   ผลงานค้นพบพันธุ์พืช พันธุ์สัตว์ ที่ค้นพบใหม่และได้รับการจดทะเบียน </td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก20} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก20')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน20} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน20')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก20} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก20')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>-   ตําราที่ได้รับการประเมินผ่านเกณฑ์การขอตําแหน่งทางวิชาการแล้ว </td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก21} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก21')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน21} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน21')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก21} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก21')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>-   หนังสือที่ได้รับการประเมินผ่านเกณฑ์การขอตําแหน่งทางวิชาการแล้ว</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก22} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก22')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน22} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน22')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก22} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก22')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>-   งานแปลที่ได้รับการประเมินผ่านเกณฑ์การขอตําแหน่งทางวิชาการแล้ว</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก23} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก23')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน23} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน23')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก23} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก23')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>-   ตําราที่ผ่านการพิจารณาตามหลักเกณฑ์การประเมินตําแหน่งทางวิชาการ แต่ไม่ได้นํามาขอรับการประเมินตําแหน่งทางวิชาการ</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก24} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก24')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน24} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน24')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก24} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก24')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>-   หนังสือที่ผ่านการพิจารณาตามหลักเกณฑ์การประเมินตําแหน่งทางวิชาการ แต่ไม่ได้นํามาขอรับการประเมินตําแหน่งทางวิชาการ</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก25} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก25')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน25} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน25')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก25} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก25')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD'>-   งานแปลที่ผ่านการพิจารณาตามหลักเกณฑ์การประเมินตําแหน่งทางวิชาการ แต่ไม่ได้นํามาขอรับการประเมินตําแหน่งทางวิชาการ</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ค่าน้ำหนัก26} onChange={(e) => handleChange(e, 'ค่าน้ำหนัก26')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.จำนวนชิ้นงาน26} onChange={(e) => handleChange(e, 'จำนวนชิ้นงาน26')}></InputText></td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวมถ่วงน้ำหนัก26} onChange={(e) => handleChange(e, 'ผลรวมถ่วงน้ำหนัก26')}></InputText></td>
              </tr>
              <tr>
              <td className='TD'></td>
              <td className='TD' colSpan="3">ผลรวมถ่วงน้ำหนักของผลงานทางวิชาการของอาจารย์ประจําหลักสูตร</td>
              <td className='TD'><InputText  value = {dataTqf7_2.ผลรวม} onChange={(e) => handleChange(e, 'ผลรวม')}></InputText></td>
              </tr>
            </tbody>
          </table><br/><br/>


            <span>รายการหลักฐานอ้างอิง</span><br/><br/>
            <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>รหัสเอกสาร</th>
                <th className='TH'>ชื่อบทความวิจัยฉบับสมบูรณ์ (Full Paper) ที่ได้รับการตีพิมพ์เผยแพร่ (ไทย/อังกฤษ)</th>
                <th className='TH'>ชื่อเจ้าของผลงานและผู้ร่วม</th>
                <th className='TH'>ชื่อการประชุมวิชาการ วัน-เดือน-ปี สถานที่/จังหวัด/ประเทศที่จัด หรือชื่อวารสาร วันเดือนปีที่เผยแพร่</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.รหัสเอกสาร9} onChange={(e) => handleChange(e, 'รหัสเอกสาร9')}></InputTextarea></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.ชื่อบทความวิจัยฉบับสมบูรณ์1} onChange={(e) => handleChange(e, 'ชื่อบทความวิจัยฉบับสมบูรณ์1')}></InputTextarea></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.ชื่อเจ้าของผลงานและผู้ร่วม1} onChange={(e) => handleChange(e, 'ชื่อเจ้าของผลงานและผู้ร่วม1')}></InputTextarea></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.ชื่อการประชุมวิชาการ1} onChange={(e) => handleChange(e, 'ชื่อการประชุมวิชาการ1')}></InputTextarea></td>
              </tr>
              <tr>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.รหัสเอกสาร10} onChange={(e) => handleChange(e, 'รหัสเอกสาร10')}></InputTextarea></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.ชื่อบทความวิจัยฉบับสมบูรณ์2} onChange={(e) => handleChange(e, 'ชื่อบทความวิจัยฉบับสมบูรณ์2')}></InputTextarea></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.ชื่อเจ้าของผลงานและผู้ร่วม2} onChange={(e) => handleChange(e, 'ชื่อเจ้าของผลงานและผู้ร่วม2')}></InputTextarea></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.ชื่อการประชุมวิชาการ2} onChange={(e) => handleChange(e, 'ชื่อการประชุมวิชาการ2')}></InputTextarea></td>
              </tr>
              <tr>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.รหัสเอกสาร11} onChange={(e) => handleChange(e, 'รหัสเอกสาร11')}></InputTextarea></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.ชื่อบทความวิจัยฉบับสมบูรณ์3} onChange={(e) => handleChange(e, 'ชื่อบทความวิจัยฉบับสมบูรณ์3')}></InputTextarea></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.ชื่อเจ้าของผลงานและผู้ร่วม3} onChange={(e) => handleChange(e, 'ชื่อเจ้าของผลงานและผู้ร่วม3')}></InputTextarea></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.ชื่อการประชุมวิชาการ3} onChange={(e) => handleChange(e, 'ชื่อการประชุมวิชาการ3')}></InputTextarea></td>
              </tr>
              <tr>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.รหัสเอกสาร12} onChange={(e) => handleChange(e, 'รหัสเอกสาร12')}></InputTextarea></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.ชื่อบทความวิจัยฉบับสมบูรณ์4} onChange={(e) => handleChange(e, 'ชื่อบทความวิจัยฉบับสมบูรณ์4')}></InputTextarea></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.ชื่อเจ้าของผลงานและผู้ร่วม4} onChange={(e) => handleChange(e, 'ชื่อเจ้าของผลงานและผู้ร่วม4')}></InputTextarea></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.ชื่อการประชุมวิชาการ4} onChange={(e) => handleChange(e, 'ชื่อการประชุมวิชาการ4')}></InputTextarea></td>
              </tr>
              <tr>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.รหัสเอกสาร13} onChange={(e) => handleChange(e, 'รหัสเอกสาร13')}></InputTextarea></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.ชื่อบทความวิจัยฉบับสมบูรณ์1} onChange={(e) => handleChange(e, 'ชื่อบทความวิจัยฉบับสมบูรณ์5')}></InputTextarea></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.ชื่อเจ้าของผลงานและผู้ร่วม5} onChange={(e) => handleChange(e, 'ชื่อเจ้าของผลงานและผู้ร่วม5')}></InputTextarea></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.ชื่อการประชุมวิชาการ5} onChange={(e) => handleChange(e, 'ชื่อการประชุมวิชาการ5')}></InputTextarea></td>
              </tr>
              <tr>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.รหัสเอกสาร14} onChange={(e) => handleChange(e, 'รหัสเอกสาร14')}></InputTextarea></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.ชื่อบทความวิจัยฉบับสมบูรณ์6} onChange={(e) => handleChange(e, 'ชื่อบทความวิจัยฉบับสมบูรณ์6')}></InputTextarea></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.ชื่อเจ้าของผลงานและผู้ร่วม6} onChange={(e) => handleChange(e, 'ชื่อเจ้าของผลงานและผู้ร่วม6')}></InputTextarea></td>
                <td className='TD'><InputTextarea autoResize style={{ width: '100%' }} value = {dataTqf7_2.ชื่อการประชุมวิชาการ6} onChange={(e) => handleChange(e, 'ชื่อการประชุมวิชาการ6')}></InputTextarea></td>
              </tr>
            </tbody>
          </table><br/><br/>



            <span>ผลการดำเนินการในภาพรวม</span><br/><br/>
            <table>
              <tr>
                <th rowspan="3">ประเด็นในการพิจารณา</th>
                <th colspan="2">ผลการดำเนินการ</th>
                <th rowspan="3">คะแนนการประเมินตนเอง</th>
              </tr>
              <tr>
                <th>ตัวตั้ง</th>
                <th rowspan="2">ผลลัพธ์</th>
              </tr>
              <tr>
                <th>ตัวหาร</th>
              </tr>

              <tr>
                <td rowspan="2">4.2.1 ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก 3 ร้อยละ 40</td>
                <td><InputText  value = {dataTqf7_2.ตัวตั้ง_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก} onChange={(e) => handleChange(e, 'ตัวตั้ง_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก')}></InputText></td>
                <td rowspan="2"><InputText  value = {dataTqf7_2.ผลลัพธ์_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก} onChange={(e) => handleChange(e, 'ผลลัพธ์_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก')}></InputText></td>
                <td rowspan="2"><InputText  value = {dataTqf7_2.คะแนนการประเมินตนเอง_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก} onChange={(e) => handleChange(e, 'คะแนนการประเมินตนเอง_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก')}></InputText></td>
              </tr>
              <tr>
                <td><InputText  value = {dataTqf7_2.ตัวหาร_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก} onChange={(e) => handleChange(e, 'ตัวหาร_ร้อยละของอาจารย์ประจําหลักสูตรที่มีคุณวุฒิปริญญาเอก')}></InputText></td>
              </tr>
              <tr>
                <td rowspan="2">4.2.2 ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ</td>
                <td><InputText  value = {dataTqf7_2.ตัวตั้ง_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ} onChange={(e) => handleChange(e, 'ตัวตั้ง_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ')}></InputText></td>
                <td rowspan="2"><InputText  value = {dataTqf7_2.ผลลัพธ์_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ} onChange={(e) => handleChange(e, 'ผลลัพธ์_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ')}></InputText></td>
                <td rowspan="2"><InputText  value = {dataTqf7_2.คะแนนการประเมินตนเอง_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ} onChange={(e) => handleChange(e, 'คะแนนการประเมินตนเอง_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ')}></InputText></td>
              </tr>
              <tr>
                <td><InputText  value = {dataTqf7_2.ตัวหาร_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ} onChange={(e) => handleChange(e, 'ตัวหาร_ร้อยละของอาจารย์ประจําหลักสูตรที่ดํารงตําแหน่งทางวิชาการ')}></InputText></td>
              </tr>
              <tr>
                <td rowspan="2">4.2.2 ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร</td>
                <td><InputText  value = {dataTqf7_2.ตัวตั้ง_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร} onChange={(e) => handleChange(e, 'ตัวตั้ง_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร')}></InputText></td>
                <td rowspan="2"><InputText  value = {dataTqf7_2.ผลลัพธ์_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร} onChange={(e) => handleChange(e, 'ผลลัพธ์_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร')}></InputText></td>
                <td rowspan="2"><InputText  value = {dataTqf7_2.คะแนนการประเมินตนเอง_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร} onChange={(e) => handleChange(e, 'คะแนนการประเมินตนเอง_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร')}></InputText></td>
              </tr>
              <tr>
                <td><InputText  value = {dataTqf7_2.ตัวหาร_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร} onCanPlay={(e) => handleChange(e, 'ตัวหาร_ผลงานทางวิชาการของอาจารย์ประจําหลักสูตร')}></InputText></td>
              </tr>
              <tr>
              	<td>คะแนนเฉลี่ย</td>
                <td></td>
                <td></td>
                <td><InputText  value = {dataTqf7_2.คะแนนเฉลี่ย_ผลการดำเนินการในภาพรวม} onChange={(e) => handleChange(e, 'คะแนนเฉลี่ย_ผลการดำเนินการในภาพรวม')}></InputText></td>
              </tr>
            </table><br/><br/>

            <span>การประเมินตนเองจากผลการดำเนินงาน</span><br/><br/>
          <table className='TA'>
            <thead>
              <tr>
                <th className='TH'>เป้าหมาย</th>
                <th className='TH'>ผลการดำเนินงาน</th>
                <th className='TH'>คะแนนการประเมินตนเอง</th>
                <th className='TH'>การบรรลุเป้าหมาย</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td className='TD'><InputText value = {dataTqf7_2.เป้าหมาย_การประเมินตนเองจากผลการดำเนินงาน} onChange={(e) => handleChange(e, 'เป้าหมาย_การประเมินตนเองจากผลการดำเนินงาน')} ></InputText></td>
                <td className='TD'><InputText value = {dataTqf7_2.ผลการดำเนินงาน_การประเมินตนเองจากผลการดำเนินงาน} onChange={(e) => handleChange(e, 'ผลการดำเนินงาน_การประเมินตนเองจากผลการดำเนินงาน')}></InputText></td>
                <td className='TD'><InputText value = {dataTqf7_2.คะแนนการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน} onChange={(e) => handleChange(e, 'คะแนนการประเมินตนเอง_การประเมินตนเองจากผลการดำเนินงาน')} ></InputText></td>
                <td className='TD'><InputText value = {dataTqf7_2.การบรรลุเป้าหมาย_การประเมินตนเองจากผลการดำเนินงาน} onChange={(e) => handleChange(e, 'การบรรลุเป้าหมาย_การประเมินตนเองจากผลการดำเนินงาน')} ></InputText></td>
              </tr>
            </tbody>
          </table>
        </div>
      </Panel><br/><br/>
      {/***********************************************/}
      <Panel header="ผลที่เกิดกับอาจารย์ประจําหลักสูตร">
        <div>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.ข้อมูลพื้นฐานประกอบผลการดำเนินงาน</span><br/><br/>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.ผลการดำเนินการ</span><br/><br/>
            <span>ความพึงพอใจของอาจารย์</span>
            <InputTextarea value='{ความพึงพอใจของอาจารย์}'/>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.การประเมินตนเองจากผลการดำเนินงาน</span>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.รายการหลักฐานอ้างอิง</span>
        </div>
      </Panel><br/><br/>
      {/***********************************************/}
      <Panel header="สรุปผลการประเมินตนเอง">
        <div>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.อาจารย์ประจำหลักสูตร</span>
        </div>
      </Panel><br/><br/>
      {/***********************************************/}
      
    </div>
  )
}

export default TQF7_2
