import React from 'react'

import { Panel } from 'primereact/panel'
import { InputTextarea } from 'primereact/inputtextarea'

function TQF7_3() {
  return (
    <div>
      <Panel header="การรับนักศึกษา">
        {/***********************************************/}
        <div>
            <span>การรับนักศึกษา</span>
            <InputTextarea autoResize value='{การรับนักศึกษา}'/><br/><br/>
            <span>ระบบกลไก</span>
            <InputTextarea autoResize value='{ระบบกลไก.การรับนักศึกษา}'/><br/><br/>
            <span>ผลการดำเนินงาน</span>
            <InputTextarea autoResize value='{ผลการดำเนินงาน.การรับนักศึกษา}'/><br/><br/>
            <span>การประเมินกระบวนการ</span>
            <InputTextarea autoResize value='{การประเมินกระบวนการ.การรับนักศึกษา}'/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span>
            <InputTextarea autoResize value='{การปรับปรุงกระบวนการ.การรับนักศึกษา}'/><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="การเตรียมความพร้อมก่อนเข้าศึกษา">
        {/***********************************************/}
        <div>
            <span>ระบบกลไก</span>
            <InputTextarea autoResize value='{ระบบกลไก.การเตรียมความพร้อมก่อนเข้าศึกษา}'/><br/><br/>
            <span>ผลการดำเนินงาน</span>
            <InputTextarea autoResize value='{ผลการดำเนินงาน.การเตรียมความพร้อมก่อนเข้าศึกษา}'/><br/><br/>
            <span>การประเมินกระบวนการ</span>
            <InputTextarea autoResize value='{การประเมินกระบวนการ.การเตรียมความพร้อมก่อนเข้าศึกษา}'/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span>
            <InputTextarea autoResize value='{การปรับปรุงกระบวนการ.การเตรียมความพร้อมก่อนเข้าศึกษา}'/><br/><br/>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.การประเมินตนเองจากผลการดำเนินงาน</span>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.รายการหลักฐานอ้างอิง</span>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="การส่งเสริมและพัฒนานักศึกษา">
        {/***********************************************/}
        <div>
            <span>การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี</span>
            <InputTextarea autoResize value='{การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี}'/><br/><br/>
            <span>ผลการดำเนินงาน</span>
            <InputTextarea autoResize value='{ผลการดำเนินงาน.การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี}'/><br/><br/>
            <span>การประเมินกระบวนการ</span>
            <InputTextarea autoResize value='{การประเมินกระบวนการ.การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี}'/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span>
            <InputTextarea autoResize value='{การปรับปรุงกระบวนการ.การควบคุมการดูแลการให้คําปรึกษาวิชาการและแนะแนวแก่นิสิตปริญญาตรี}'/><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21">
        {/***********************************************/}
        <div>
            <span>ระบบกลไก</span>
            <InputTextarea autoResize value='{ระบบกลไก.กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21}'/><br/><br/>
            <span>ผลการดําเนินงาน</span>
            <InputTextarea autoResize value='{ผลการดําเนินงาน.กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21}'/><br/><br/>
            <span>การประเมินกระบวนการ</span>
            <InputTextarea autoResize value='{การประเมินกระบวนการ.กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21}'/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span>
            <InputTextarea autoResize value='{การปรับปรุงกระบวนการ.กิจกรรมการพัฒนาศักยภาพของนิสิตและการเสริมสร้างทักษะการเรียนรู้ในศตวรรษที่ 21}'/><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="การควบคุมดูแลการให้คําปรึกษาวิทยานิพนธ์ แก่บัณฑิตศึกษา">
        {/***********************************************/}
        <div>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.การประเมินตนเองจากผลการดำเนินงาน</span>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.รายการหลักฐานอ้างอิง</span>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="ผลที่เกิดกับนักศึกษา">
        {/***********************************************/}
        <div>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.ข้อมูลนักศึกษา และจำนวนผู้สำเร็จการศึกษาตามแผน การศึกษาและจำนวนผู้สำเร็จการศึกษา</span>
            <span>ปัจจัยที่ส่งผลกระทบต่อจำนวนนักศึกษา</span>
            <InputTextarea autoResize value='{ปัจจัยที่ส่งผลกระทบต่อจำนวนนักศึกษา}'/><br/><br/>
            <span>การประเมินความพึงพอใจของนักศึกษา</span>
            <InputTextarea autoResize value='{การประเมินความพึงพอใจของนักศึกษา}'/><br/><br/>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="การจัดการข้อร้องเรียนของนักศึกษา">
        {/***********************************************/}
        <div>
            <span>ระบบกลไก</span>
            <InputTextarea autoResize value='{ระบบกลไก.การจัดการข้อร้องเรียนของนักศึกษา}'/><br/><br/>
            <span>ผลการดําเนินงาน</span>
            <InputTextarea autoResize value='{ผลการดําเนินงาน.การจัดการข้อร้องเรียนของนักศึกษา}'/><br/><br/>
            <span>การประเมินกระบวนการ</span>
            <InputTextarea autoResize value='{การประเมินกระบวนการ.การจัดการข้อร้องเรียนของนักศึกษา}'/><br/><br/>
            <span>การปรับปรุงกระบวนการ</span>
            <InputTextarea autoResize value='{การปรับปรุงกระบวนการ.การจัดการข้อร้องเรียนของนักศึกษา}'/><br/><br/>
            <span>การคงอยู่</span>
            <InputTextarea autoResize value='{การคงอยู่}'/><br/><br/>
            <span>การสำเร็จการศึกษา</span>
            <InputTextarea autoResize value='{การสำเร็จการศึกษา}'/><br/><br/>
            <span>ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา</span>
            <InputTextarea autoResize value='{ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา}'/><br/><br/>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.การประเมินตนเองจากผลการดำเนินงาน</span>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.รายการหลักฐานอ้างอิง</span>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="บัณฑิต">
        {/***********************************************/}
        <div>
            <span>ผลการดำเนินงาน</span>
            <InputTextarea autoResize value='{ผลการดำเนินงาน.บัณฑิต}'/><br/><br/>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.ข้อมูลประกอบการคำนวณคุณภาพของบัณฑิตหลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์</span>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.การประเมินตนเองจากผลการดำเนินงาน</span>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.รายการหลักฐานอ้างอิง</span>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="ร้อยละของบัณฑิตปริญญาตรีที่ได้งานทําหรือประกอบอาชีพอิสระภายใน 1 ปี">
        {/***********************************************/}
        <div>
            <span>ผลการดำเนินงาน</span>
            <InputTextarea autoResize value='{ผลการดำเนินงาน.ร้อยละของบัณฑิตปริญญาตรีที่ได้งานทําหรือประกอบอาชีพอิสระภายใน 1 ปี}'/><br/><br/>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.ข้อมูลประกอบการคำนวณภาวะการมีงานทำหรือประกอบอาชีพอิสระของบัณฑิตที่สำเร็จการศึกษา</span>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
      <Panel header="สรุปผลการประเมินตนเององค์ประกอบที่ 2 บัณฑิต และองค์ประกอบที่ 3 นักศึกษา">
        {/***********************************************/}
        <div>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.บัณฑิต.ผลการประเมินตนเองตามองค์ประกอบ</span>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.นักศึกษา.ผลการประเมินตนเองตามองค์ประกอบ</span>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.การประเมินตนเองจากผลการดำเนินงาน</span>
            <span>*เดี๋ยวกลับมาทำ*เป็นตาราง.รายการหลักฐานอ้างอิง</span>
        </div>
        {/***********************************************/}
      </Panel><br/><br/>
    </div>
  )
}

export default TQF7_3
